Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.CodeQuality.Analyzers/Core/ApiReview/xlf/ApiReviewAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, tr, zh_hans, zh_hant

# AvoidCallingProblematicMethodsTitle
source: Avoid calling problematic methods
cs: Nevolejte problematické metody
de: Keine problematischen Methoden aufrufen
es: Evitar llamar a métodos problemáticos
fr: Éviter d'appeler des méthodes susceptibles de poser des problèmes
it: Evitare di chiamare metodi problematici
ko: 문제가 있는 메서드를 호출하지 마세요.
pl: Unikaj wywoływania problematycznych metod
pt_br: Evite chamar métodos problemáticos
tr: Sorunlu yöntemleri çağırmaktan kaçının
zh_hans: 避免调用有问题的方法
zh_hant: 避免呼叫有問題的方法

# AvoidCallingProblematicMethodsDescription
source: A member calls a potentially dangerous or problematic method.
cs: Člen volá potenciálně nebezpečnou nebo problematickou metodu.
de: Ein Member ruft eine möglicherweise gefährliche oder problematische Methode auf.
es: Un miembro llama a un método potencialmente peligroso o problemático.
fr: Un membre appelle une méthode potentiellement dangereuse ou pouvant poser des problèmes.
it: Un membro chiama un metodo potenzialmente pericoloso o problematico.
ko: 멤버가 잠재적으로 위험하거나 문제가 있는 메서드를 호출합니다.
pl: Składowa wywołuje potencjalnie niebezpieczną lub problematyczną metodę.
pt_br: Um membro chama um método problemático ou potencialmente perigoso.
tr: Bir üye, tehlikeli veya sorunlu olabilecek bir yöntemi çağırıyor.
zh_hans: 成员调用可能存在危险或有问题的方法。
zh_hant: 成員呼叫了可能有危險或會有問題的方法。

# AvoidCallingProblematicMethodsMessageSystemGCCollect
source: Remove the call to GC.Collect from {0}. It is usually unnecessary to force garbage collection, and doing so can severely degrade performance.
cs: Odeberte volání do GC.Collect z {0}. Obvykle není nutné vynucovat uvolňování paměti a pokud to uděláte, může se výkon velmi snížit.
de: Entfernen Sie den Aufruf von GC.Collect aus "{0}". Normalerweise ist es nicht nötig, die Garbage Collection zu erzwingen. Dies kann zu erheblichen Leistungseinbußen führen.
es: Quite la llamada a GC.Collect de {0}. Normalmente no es necesario forzar la recolección de elementos no utilizados y, si lo hace, puede degradar considerablemente el rendimiento.
fr: Supprimez l'appel à GC.Collect dans {0}. En règle générale, il n'est pas nécessaire d'imposer un garbage collection. En effet, cela peut sérieusement dégrader les performances.
it: Rimuovere la chiamata a GC.Collect da {0}. Non è necessario forzare la Garbage Collection perché tale operazione può influire molto negativamente sulle prestazioni.
ko: {0}에서 GC.Collect에 대한 호출을 제거하세요. 이러한 호출은 일반적으로 불필요한 가비지를 수집하므로 성능을 크게 떨어뜨릴 수 있습니다.
pl: Usuń wywołanie GC.Collect z elementu {0}. Zazwyczaj nie jest konieczne wymuszanie odzyskiwania pamięci i robienie tego może znacznie pogorszyć wydajność.
pt_br: Remova a chamada para GC.Collect de {0}. Normalmente, é desnecessário forçar a coleta de lixo. Fazer isso pode impactar severamente o desempenho.
tr: {0} öğesinden GC.Collect çağrısını kaldırın. Çöp toplamanın zorlanması genelde gereksizdir ve performansı önemli ölçüde düşürebilir.
zh_hans: 从 {0} 中删除对 GC.Collect 的调用。通常不必强制进行垃圾回收，强制进行垃圾回收可能会严重降低性能。
zh_hant: 從 {0} 移除對 GC.Collect 的呼叫。一般情況下，並不需要強制進行記憶體回收，且如此做可能會大幅降低效能。

# AvoidCallingProblematicMethodsMessageSystemThreadingThreadResume
source: Remove the call to Thread.Resume from {0}. Suspending and resuming threads can be dangerous if the system is in the middle of a critical operation such as executing a class constructor of an important system type or resolving security for a shared assembly.
cs: Odeberte volání do Thread.Resume z {0}. Pozastavení a obnovení vláken může být nebezpečné, pokud systém provádí kritickou operaci, třeba spouští konstruktor třídy důležitého typu systému nebo překládá zabezpečení sdíleného sestavení.
de: Entfernen Sie den Aufruf von Thread.Resume aus "{0}". Das Anhalten und Fortsetzen von Threads kann gefährlich sein, wenn das System gerade einen kritischen Vorgang ausführt. Dazu gehört beispielsweise die Ausführung eines Klassenkonstruktors eines wichtigen Systemtyps oder die Auflösung der Sicherheit für eine freigegebene Assembly.
es: Quite la llamada a Thread.Resume de {0}. Suspender y reanudar subprocesos puede ser peligroso si el sistema está en medio de una operación crítica como, por ejemplo, ejecutar un constructor de clases de un tipo de sistema importante o resolver la seguridad de un ensamblado compartido.
fr: Supprimez l'appel à Thread.Resume dans {0}. L'interruption et la reprise de threads peuvent être dangereuses si le système est en train d'effectuer une opération critique, par exemple l'exécution d'un constructeur de classe d'un type système important ou la résolution de la sécurité pour un assembly partagé.
it: Rimuovere la chiamata a Thread.Resume da {0}. Può essere pericoloso sospendere e riprendere i thread se il sistema sta eseguendo un'operazione critica, ad esempio durante l'esecuzione di un costruttore di classe di un importante tipo di sistema o la risoluzione della sicurezza per un assembly condiviso.
ko: {0}에서 Thread.Resume에 대한 호출을 제거하세요. 시스템에서 중요한 시스템 형식의 클래스 생성자를 실행하고 있거나 공유 어셈블리의 보안을 확인하고 있는 경우처럼 중요한 작업을 수행하는 동안 스레드를 일시 중단하고 다시 시작하면 위험할 수 있습니다.
pl: Usuń wywołanie Thread.Resume z elementu {0}. Zawieszanie i wznawianie wątków może być niebezpieczne, jeśli system jest w trakcie krytycznej operacji, takiej jak wykonywanie konstruktora klasy ważnego typu systemu lub rozwiązywanie zabezpieczeń dla udostępnionego zestawu.
pt_br: Remova a chamada para Thread.Resume de {0}. Suspender e resumir threads pode ser perigoso quando o sistema está em meio a uma operação crítica como a execução de um construtor de classe de um tipo de sistema importante ou resolvendo a segurança para um assembly compartilhado.
tr: {0} öğesinden Thread.Resume çağrısını kaldırın. Sistem önemli bir sistem türünün sınıf oluşturucusunu yürütme ya da paylaşılan bir bütünleştirilmiş kod için güvenliği çözümleme gibi kritik bir işlemin ortasındaysa iş parçacıklarının askıya alınıp sürdürülmesi tehlikeli olabilir.
zh_hans: 从 {0} 中删除对 Thread.Resume 的调用。如果系统正在进行关键操作(例如，正在执行重要系统类型的类构造函数或正在解析共享程序集的安全性)，挂起和恢复线程可能十分危险。
zh_hant: 從 {0} 移除對 Thread.Resume 的呼叫。如果系統目前正在進行重要的作業，例如正在執行某個重要系統類型的類別建構函式，或是正在解決某個共用組件的安全性，則暫止與繼續執行緒都可能會造成危險。

# AvoidCallingProblematicMethodsMessageSystemThreadingThreadSuspend
source: Remove the call to Thread.Suspend from {0}. Suspending and resuming threads can be dangerous if the system is in the middle of a critical operation such as executing a class constructor of an important system type or resolving security for a shared assembly.
cs: Odeberte volání do Thread.Suspend z {0}. Pozastavení a obnovení vláken může být nebezpečné, pokud systém provádí kritickou operaci, třeba spouští konstruktor třídy důležitého typu systému nebo překládá zabezpečení sdíleného sestavení.
de: Entfernen Sie den Aufruf von Thread.Suspend aus "{0}". Das Anhalten und Fortsetzen von Threads kann gefährlich sein, wenn das System gerade einen kritischen Vorgang ausführt. Dazu gehört beispielsweise die Ausführung eines Klassenkonstruktors eines wichtigen Systemtyps oder die Auflösung der Sicherheit für eine freigegebene Assembly.
es: Quite la llamada a Thread.Suspend de {0}. Suspender y reanudar subprocesos puede ser peligroso si el sistema está en medio de una operación crítica como, por ejemplo, ejecutar un constructor de clases de un tipo de sistema importante o resolver la seguridad de un ensamblado compartido.
fr: Supprimez l'appel à Thread.Suspend dans {0}. L'interruption et la reprise de threads peuvent être dangereuses si le système est en train d'effectuer une opération critique, par exemple l'exécution d'un constructeur de classe d'un type système important ou la résolution de la sécurité pour un assembly partagé.
it: Rimuovere la chiamata a Thread.Suspend da {0}. Può essere pericoloso sospendere e riprendere i thread se il sistema sta eseguendo un'operazione critica, ad esempio durante l'esecuzione di un costruttore di classe di un importante tipo di sistema o la risoluzione della sicurezza per un assembly condiviso.
ko: {0}에서 Thread.Suspend에 대한 호출을 제거하세요. 시스템에서 중요한 시스템 형식의 클래스 생성자를 실행하고 있거나 공유 어셈블리의 보안을 확인하고 있는 경우처럼 중요한 작업을 수행하는 동안 스레드를 일시 중단하고 다시 시작하면 위험할 수 있습니다.
pl: Usuń wywołanie Thread.Suspend z elementu {0}. Zawieszanie i wznawianie wątków może być niebezpieczne, jeśli system jest w trakcie krytycznej operacji, takiej jak wykonywanie konstruktora klasy ważnego typu systemu lub rozwiązywanie zabezpieczeń dla udostępnionego zestawu.
pt_br: Remova a chamada para Thread.Suspend de {0}. Suspender e resumir threads pode ser perigoso quando o sistema está em meio a uma operação crítica como a execução de um construtor de classe de um tipo de sistema importante ou resolvendo a segurança para um assembly compartilhado.
tr: {0} öğesinden Thread.Suspend çağrısını kaldırın. Sistem önemli bir sistem türünün sınıf oluşturucusunu yürütme ya da paylaşılan bir bütünleştirilmiş kod için güvenliği çözümleme gibi kritik bir işlemin ortasındaysa iş parçacıklarının askıya alınıp sürdürülmesi tehlikeli olabilir.
zh_hans: 从 {0} 中移除对 Thread.Suspend 的调用。如果系统正在进行关键操作(例如，正在执行重要系统类型的类构造函数或正在解析共享程序集的安全性)，挂起和恢复线程可能十分危险。
zh_hant: 從 {0} 移除對 Thread.Suspend 的呼叫。如果系統目前正在進行重要的作業，例如正在執行某個重要系統類型的類別建構函式，或是正在解決某個共用組件的安全性，則暫止與繼續執行緒都可能會造成危險。

# AvoidCallingProblematicMethodsMessageSystemTypeInvokeMember
source: Remove the call to System.Type.InvokeMember with BindingFlags.NonPublic from {0}. Taking a dependency on a private member increases the chance of a breaking change in the future.
cs: Odeberte volání do System.Type.InvokeMember s BindingFlags.NonPublic z {0}. Využití závislosti u privátního členu zvyšuje možnost, že v budoucnu bude nutné provést výraznou změnu.
de: Entfernen Sie den Aufruf von System.Type.InvokeMember mit BindingFlags.NonPublic aus "{0}". Durch das Übernehmen einer Abhängigkeit von einem privaten Member erhöht sich das Risiko auf eine zukünftige fehlerhafte Änderung.
es: Quite la llamada a System.Type.InvokeMember con BindingFlags.NonPublic de {0}. Tomar una dependencia en un miembro privado aumenta la posibilidad de que se produzca un cambio drástico en el futuro.
fr: Supprimez l'appel à System.Type.InvokeMember avec BindingFlags.NonPublic dans {0}. L'acceptation d'une dépendance pour un membre privé augmente les chances de rupture dans le futur.
it: Rimuovere la chiamata a System.Type.InvokeMember con BindingFlags.NonPublic da {0}. L'uso di una dipendenza su un membro privato aumenta la possibilità di una modifica importante in futuro.
ko: {0}에서 BindingFlags.NonPublic을 사용하는 System.Type.InvokeMember에 대한 호출을 제거하세요. private 멤버에서 종속성을 사용하면 나중에 크게 바뀔 가능성이 큽니다.
pl: Usuń wywołanie System.Type.InvokeMember razem z BindingFlags.NonPublic z elementu {0}. Przyjęcie zależności dla prywatnego członka zwiększa szansę istotnej zmiany w przyszłości.
pt_br: Remova a chamada para System.Type.InvokeMember com BindingFlags.NonPublic de {0}. Usar uma dependência em um membro privado aumenta a chance de haver uma alteração interruptiva no futuro.
tr: {0} öğesinden BindingFlags.NonPublic bağlamalı System.Type.InvokeMember çağrısını kaldırın. Özel bir üyede bağımlılık alınması, gelecekte bozucu değişiklik olasılığını artırır.
zh_hans: 从 {0} 中删除对带有 BindingFlags.NonPublic 的 System.Type.InvokeMember 的调用。依赖私有成员会增加以后进行重大更改的可能性。
zh_hant: 從 {0} 移除利用 BindingFlags.NonPublic 對 System.Type.InvokeMember 的呼叫。相依於私用成員會增加日後阻礙變更的可能性。

# AvoidCallingProblematicMethodsMessageCoInitializeSecurity
source: {0} is a P/Invoke declaration to an OLE32 API that cannot be reliably called after the runtime has been initialized. The workaround is to write an unmanaged shim that will call the routine and then activate and call into managed code. You can do this using an export from a mixed-mode C++ DLL, by registering a managed component for use by COM, or by using the runtime hosting API.
cs: {0} je deklarace metody P/Invoke do rozhraní API OLE32, kterou nelze spolehlivě volat po inicializaci modulu runtime. Alternativním řešením je vytvořit nespravovaný kód shim, který zavolá rutinu a potom aktivuje a zavolá spravovaný kód. To můžete udělat pomocí exportu z knihovny DDL C++ ve smíšeném režimu, registrací spravované komponenty pro použití modelem COM nebo pomocí rozhraní API, které je hostitelem modulu runtime.
de: "{0}" ist eine P/Invoke-Deklaration für eine OLE32-API, die nach der Initialisierung der Runtime nicht zuverlässig aufgerufen werden kann. The Problemumgehung besteht darin, einen nicht verwalteten Shim zu schreiben, der die Routine aufruft und aktiviert und anschließend im verwalteten Code aufruft. Hierzu können Sie einen Export aus einer C++-DLL im gemischten Modus verwenden, indem Sie eine verwaltete Komponente für die Verwendung durch COM registrieren oder indem Sie die API für das Hosting der Laufzeit verwenden.
es: {0} es una declaración P/Invoke a una API OLE32 a la que no se puede llamar de forma confiable una vez inicializado el entorno de ejecución. La solución es escribir correcciones de compatibilidad (shim) no administradas que llamen a la rutina y, después, activen y llamen a código administrado. Para ello, use una exportación de una DLL de C++ en modo mixto, registre un componente administrado para que lo use COM o utilice la API de hospedaje del entorno de ejecución.
fr: {0} est une déclaration P/Invoke à une API OLE32 qui ne peut pas être appelée de manière fiable après l'initialisation du runtime. La solution consiste à écrire un shim non managé qui appelle la routine, puis l'active et l'appelle dans du code managé. Vous pouvez y parvenir en utilisant une exportation d'une DLL C++ en mode mixte, en inscrivant un composant managé à utiliser par COM ou en utilisant l'API d'hébergement du runtime.
it: {0} è una dichiarazione P/Invoke per un'API OLE32 che non può essere chiamata in modo affidabile dopo l'inizializzazione del runtime. Come soluzione alternativa è possibile scrivere uno shim non gestito che chiamerà la routine e quindi la attiverà e la chiamerà nel codice gestito. A questo scopo, è possibile usare un'esportazione da una DLL C++ in modalità mista, registrando un componente gestito per COM o usando l'API di hosting del runtime.
ko: {0}은(는) OLE32 API에 대한 P/Invoke 선언으로, 런타임이 초기화된 후에는 안정적으로 호출할 수 없습니다. 이 문제를 해결하려면 루틴을 호출하는 관리되지 않는 shim을 작성한 후 관리 코드를 활성화하여 호출해야 합니다. COM에서 사용할 수 있도록 관리되는 구성 요소를 등록하거나 런타임 호스팅 API를 사용하면 혼합 모드 C++ DLL의 내보내기를 통해 이를 수행할 수 있습니다.
pl: Element {0} jest deklaracją P/Invoke dla interfejsu API OLE32, która nie może być niezawodnie wywołana po zainicjowaniu środowiska uruchomieniowego. Obejściem jest napisanie niezarządzanej poprawki, która będzie wywoływać procedurę, a następnie uaktywniać i wywoływać zarządzany kod. Możesz to zrobić za pomocą eksportu z biblioteki DLL języka C++ trybu mieszanego, rejestrując zarządzany składnik do używania przez model COM lub używając interfejsu API hostingu środowiska uruchomieniowego.
pt_br: {0} é uma declaração P/Invoke para uma API OLE32 que não pode ser chamada de forma confiável após a inicialização do tempo de execução. A solução alternativa é gravar um shim não gerenciado que chamará a rotina e ativará e chamará o código gerenciado. É possível fazer isso usando uma exportação de uma DLL C++ de modo misto ao registrar um componente gerenciado para uso pelo COM ou ao usar a API de hospedagem do tempo de execução.
tr: {0}, çalışma zamanı başlatıldıktan sonra güvenilir bir şekilde çağrılamayacak OLE32 API’ye yönelik bir P/Invoke bildirimi. Geçici çözüm, rutini çağıracak yönetilmeyen bir dolgu yazmak, sonra da etkinleştirip yönetilen koda çağırmaktır. Bunu karışık modlu bir C++ DLL’den dışarı aktarmayı kullanarak, COM ile kullanılmak üzere yönetilen bir bileşen kaydederek ya da çalışma zamanı barındırma API’sini kullanarak yapabilirsiniz.
zh_hans: {0} 是对 OLE32 API 的 P/Invoke 声明，在运行时初始化后无法可靠地调用该声明。解决方法是写入一个非托管程序，该程序调用例程，然后激活并调入托管代码。通过注册供 COM 使用的托管组件或使用运行时承载 API，就可以使用混合模式 C++ DLL 的导出内容实现上述功能。
zh_hant: {0} 是對 OLE32 API 的 P/Invoke 宣告，執行階段初始化之後可能無法正常地呼叫它。因應措施是撰寫一個在呼叫常式後會將其啟用，並呼叫受控程式碼的非受控填充碼。您可使用來自混合模式 C++ DLL 的匯出、註冊 COM 使用的受控元件，或是使用執行階段裝載 API 來執行這項作業。

# AvoidCallingProblematicMethodsMessageCoSetProxyBlanket
source: {0} is a P/Invoke declaration to an OLE32 API that cannot be reliably called against a runtime callable wrapper (a managed object wrapping a COM object). Runtime callable wrappers dynamically fetch interface pointers so the effect of the call might be arbitrarily lost. Runtime callable wrappers for a given COM object are also shared across an application domain so the call could possibly affect other users. Replace this call with a native wrapper COM object for the interface pointer that does the appropriate CoSetProxyBlanket calls.
cs: {0} je deklarace metody P/Invoke do rozhraní API OLE32, kterou nelze spolehlivě volat oproti objektu volatelnému za běhu (spravovaný objekt, který zabaluje objekt modelu COM). Objekty volatelné za běhu dynamicky načítají ukazatele rozhraní, takže nahodile může dojít ke ztrátě efektu volání. Objekty volatelné za běhu pro daný objekt modelu COM se také sdílí napříč doménou, takže volání by mohlo ovlivnit ostatní uživatele. U ukazatele rozhraní, který provádí příslušná volání CoSetProxyBlanket, nahraďte toto volání objektem modelu COM nativní obálky.
de: "{0}" ist eine P/Invoke-Deklaration für eine OLE32-API, die nicht zuverlässig für einen Runtime Callable Wrapper (ein verwaltetes Objekt, das ein COM-Objekt umschließt) aufgerufen werden kann. Runtime Callable Wrapper rufen Schnittstellenzeiger dynamisch ab, sodass die Wirkung des Aufrufs willkürlich verloren gehen kann. Runtime Callable Wrapper für ein bestimmtes COM-Objekt werden auch in der gesamten Anwendungsdomäne freigegeben, sodass der Aufruf sich auch auf andere Benutzer auswirken kann. Ersetzen Sie diesen Aufruf durch ein COM-Objekt mit einem nativen Wrapper für den Schnittstellenzeiger, der die geeigneten CoSetProxyBlanket-Aufrufe ausführt.
es: {0} es una declaración P/Invoke a una API OLE32 a la que no se puede llamar de forma confiable respecto a un contenedor RCW (objeto administrado que contiene un objeto COM). Los contenedores RCW capturan punteros de interfaz de forma dinámica; por tanto, el efecto de la llamada se puede perder de forma arbitraria. Los contenedores RCW de un objeto COM dado se comparten también en el dominio de una aplicación, de forma que la llamada podría afectar a otros usuarios. Reemplace esta llamada por un objeto COM contenedor nativo para el puntero de interfaz que realiza las llamadas a CoSetProxyBlanket correspondientes.
fr: {0} est une déclaration P/Invoke à une API OLE32 qui ne peut pas être appelée de manière fiable sur un wrapper RCW (objet managé incluant un objet COM dans un wrapper). Dans la mesure où les wrappers RCW récupèrent (fetch) dynamiquement les pointeurs d'interface, l'effet de l'appel peut être arbitrairement perdu. Dans la mesure où les wrappers RCW d'un objet COM donné sont également partagés dans un domaine d'application, l'appel peut affecter d'autres utilisateurs. Remplacez cet appel par un objet COM de wrapper natif pour le pointeur d'interface qui effectue les appels CoSetProxyBlanket appropriés.
it: {0} è una dichiarazione P/Invoke per un'API OLE32 che non può essere chiamata in modo affidabile su un oggetto Runtime Callable Wrapper, ovvero un oggetto gestito che esegue il wrapping di un oggetto COM. Gli oggetti Runtime Callable Wrapper recuperano dinamicamente i puntatori a interfaccia, quindi l'effetto della chiamata potrebbe andare arbitrariamente perso. Gli oggetti Runtime Callable Wrapper relativi a un determinato oggetto COM sono inoltre condivisi in un dominio dell'applicazione, quindi la chiamata potrebbe interessare altri utenti. Sostituire questa chiamata con un oggetto COM wrapper nativo per il puntatore a interfaccia che effettua le chiamate appropriate a CoSetProxyBlanket.
ko: {0}는 런타임 호출 가능 래퍼 (COM 개체를 래핑하는 관리 되는 개체)에 대 한 안정적으로 호출 될 수 없습니다 OLE32 API에는 P/Invoke 선언 이다. 런타임 호출 가능 래퍼는 동적으로 호출의 효과 임의로 손실 될 수 있습니다 그래서 인터페이스 포인터를 가져옵니다. 통화 가능 하 게 다른 사용자에 영향을 미칠 수 있도록 지정된 된 COM 개체에 대 한 런타임 호출 가능 래퍼 또한 응용 프로그램 도메인에 걸쳐 공유 됩니다. 이 호출을 적절 한 CoSetProxyBlanket 호출을 수행 하는 인터페이스 포인터에 대 한 네이티브 래퍼 COM 개체를 바꿉니다.
pl: Element {0} jest deklaracją P/Invoke dla interfejsu API OLE32, który nie może być niezawodnie wywoływany dla wywoływalnego programu owijania środowiska uruchomieniowego (obiekt zarządzany owija obiekt COM). Wywoływalne programy owijania środowiska uruchomieniowego dynamicznie pobierają wskaźniki interfejsu, więc efekt wywołania może zostać arbitralnie utracony. Wywoływalne programy owijania środowiska uruchomieniowego dla danego obiektu COM są również udostępniane w domenie aplikacji, więc wywołanie może ewentualnie mieć wpływ na innych użytkowników. Zastąp to wywołanie natywnym programem owijania obiektu COM dla wskaźnika interfejsu, który wykonuje odpowiednie wywołania CoSetProxyBlanket.
pt_br: {0} é uma declaração P/Invoke para uma API OLE32 que não pode ser chamada de forma confiável com relação a um runtime callable wrapper (um objeto gerenciado que encapsula um objeto COM). Runtime callable wrappers buscam ponteiros de interface dinamicamente, de modo que o efeito da chamada pode ser arbitrariamente perdido. Runtime callable wrappers para um determinado objeto COM também são compartilhados ao longo de um domínio de aplicativos. Assim, a chamada poderia afetar outros usuários. Substitua esta chamada por um objeto COM wrapper nativo para o ponteiro de interface que faz as chamadas CoSetProxyBlanket apropriadas.
tr: {0}, çalışma zamanında çağrılabilecek bir sarmalayıcıya (bir COM nesnesini sarmalayan bir yönetilen nesne) göre güvenilir bir şekilde çağrılamayacak OLE32 API’ye yönelik bir P/Invoke bildirimi. Çalışma zamanında çağrılabilen sarmalayıcılar arabirim işaretçilerini dinamik olarak getirdiğinden, çağrının etkisi rastgele olarak kaybolabilir. Belirli bir COM nesnesi için çalışma zamanında çağrılabilen sarmalayıcılar uygulama etki alanının tamamında da paylaşıldığından, çağrının diğer kullanıcıları etkileme olasılığı vardır. Bu çağrıyı, uygun CoSetProxyBlanket çağrılarını gerçekleştiren arabirim işaretçisi için yerel bir sarmalayıcı COM nesnesiyle değiştirin.
zh_hans: {0} 是对 OLE32 API 的 P/Invoke 声明，无法针对运行时可调用包装器(用于包装 COM 对象的托管对象)可靠地调用该声明。运行时可调用包装器动态提取接口指针，因此调用的效果可能会无故丢失。还可跨应用程序域共享给定 COM 对象的运行时可调用包装器，因此该调用可能会影响其他用户。用执行相应 CoSetProxyBlanket 调用的接口指针的本机包装器 COM 对象替换此调用。
zh_hant: {0} 是對 OLE32 API 的 P/Invoke 宣告，無法正常地對執行階段可呼叫包裝函式 (包裝 COM 物件的受控物件) 進行呼叫。執行階段可呼叫包裝函式會動態擷取介面指標，因此有可能有時會出現遺漏呼叫的情況。指定的 COM 物件之執行階段可呼叫包裝函式，也會跨應用程式定義域共用，所以該呼叫可能會影響其他使用者。針對進行適當 CoSetProxyBlanket 呼叫的介面指標，以原生包裝函式 COM 物件來取代此呼叫。

source: Remove the call to SafeHandle.DangerousGetHandle from {0}.
cs: Odeberte volání do SafeHandle.DangerousGetHandle z {0}.
de: Entfernen Sie den Aufruf von SafeHandle.DangerousGetHandle aus "{0}".
es: Quite la llamada a SafeHandle.DangerousGetHandle de {0}.
fr: Supprimez l'appel à SafeHandle.DangerousGetHandle dans {0}.
it: Rimuovere la chiamata a SafeHandle.DangerousGetHandle da {0}.
ko: {0}에서 SafeHandle.DangerousGetHandle에 대한 호출을 제거하세요.
pl: Usuń wywołanie SafeHandle.DangerousGetHandle z elementu {0}.
pt_br: Remova a chamada para SafeHandle.DangerousGetHandle de {0}.
tr: {0} öğesinden SafeHandle.DangerousGetHandle çağrısını kaldırın.
zh_hans: 从 {0} 中删除对 SafeHandle.DangerousGetHandle 的调用。
zh_hant: 從 {0} 移除對 SafeHandle.DangerousGetHandle 的呼叫。
