Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.CodeQuality.Analyzers/Core/ApiReview/xlf/ApiReviewAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, tr, zh_hans, zh_hant

# AvoidCallingProblematicMethodsMessageSystemReflectionAssemblyLoadFrom
source: Remove the call to Assembly.LoadFrom from {0}.
cs: Odeberte volání do Assembly.LoadFrom z {0}.
de: Entfernen Sie den Aufruf von Assembly.LoadFrom aus "{0}".
es: Quite la llamada a Assembly.LoadFrom de {0}.
fr: Supprimez l'appel à Assembly.LoadFrom dans {0}.
it: Rimuovere la chiamata a Assembly.LoadFrom da {0}.
ko: {0}에서 Assembly.LoadFrom에 대한 호출을 제거하세요.
pl: Usuń wywołanie Assembly.LoadFrom z elementu {0}.
pt_br: Remova a chamada para Assembly.LoadFrom de {0}.
tr: {0} öğesinden Assembly.LoadFrom çağrısını kaldırın.
zh_hans: 从 {0} 中删除对 Assembly.LoadFrom 的调用。
zh_hant: 從 {0} 移除對 Assembly.LoadFrom 的呼叫。

# AvoidCallingProblematicMethodsMessageSystemReflectionAssemblyLoadFile
source: Remove the call to Assembly.LoadFile from {0}.
cs: Odeberte volání do Assembly.LoadFile z {0}.
de: Entfernen Sie den Aufruf von Assembly.LoadFile aus "{0}".
es: Quite la llamada a Assembly.LoadFile de {0}.
fr: Supprimez l'appel à Assembly.LoadFile dans {0}.
it: Rimuovere la chiamata a Assembly.LoadFile da {0}.
ko: {0}에서 Assembly.LoadFile에 대한 호출을 제거하세요.
pl: Usuń wywołanie Assembly.LoadFile z elementu {0}.
pt_br: Remova a chamada para Assembly.LoadFile de {0}.
tr: {0} öğesinden Assembly.LoadFile çağrısını kaldırın.
zh_hans: 从 {0} 中删除对 Assembly.LoadFile 的调用。
zh_hant: 從 {0} 移除對 Assembly.LoadFile 的呼叫。

# AvoidCallingProblematicMethodsMessageSystemReflectionAssemblyLoadWithPartialName
source: Remove the call to Assembly.LoadWithPartialName from {0}.
cs: Odeberte volání do Assembly.LoadWithPartialName z {0}.
de: Entfernen Sie den Aufruf von Assembly.LoadWithPartialName aus "{0}".
es: Quite la llamada a Assembly.LoadWithPartialName de {0}.
fr: Supprimez l'appel à Assembly.LoadWithPartialName dans {0}.
it: Rimuovere la chiamata a Assembly.LoadWithPartialName da {0}.
ko: {0}에서 Assembly.LoadWithPartialName에 대한 호출을 제거하세요.
pl: Usuń wywołanie Assembly.LoadWithPartialName z elementu {0}.
pt_br: Remova a chamada para Assembly.LoadWithPartialName de {0}.
tr: {0} öğesinden Assembly.LoadWithPartialName çağrısını kaldırın.
zh_hans: 从 {0} 中删除对 Assembly.LoadWithPartialName 的调用。
zh_hant: 從 {0} 移除對 Assembly.LoadWithPartialName 的呼叫。

# CategoryReliability
source: Reliability
cs: Spolehlivost
de: Zuverlässigkeit
es: Fiabilidad
fr: Fiabilité
it: Affidabilità
ko: 안정성
pl: Niezawodność
pt_br: Confiabilidade
tr: Güvenilirlik
zh_hans: 可靠性
zh_hant: 可靠性
