Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.CodeQuality.Analyzers/Core/Maintainability/xlf/MicrosoftMaintainabilityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ko, pt_br, tr, zh_hant

# DoNotIgnoreMethodResultsMessageHResultOrErrorCode
source: {0} calls {1} but does not use the HRESULT or error code that the method returns. This could lead to unexpected behavior in error conditions or low-resource situations. Use the result in a conditional statement, assign the result to a variable, or pass it as an argument to another method.
cs: {0} volá {1}, ale nepoužívá HRESULT ani kód chyby, který tato metoda vrací. To může vést k neočekávanému chování při výskytu chyby nebo nedostatku prostředků. Použijte výsledek v podmíněném příkazu, přiřaďte výsledek proměnné nebo ho předejte jako argument jiné metodě.
de: "{0}" ruft "{1}" auf, verwendet jedoch nicht den HRESULT-Wert oder den Fehlercode, der von der Methode zurückgegeben wird. Dies kann zu unerwartetem Verhalten bei Fehlerbedingungen oder in Situationen mit Ressourcenknappheit führen. Verwenden Sie das Ergebnis in einer Bedingungsanweisung, weisen Sie das Ergebnis einer Variablen zu, oder übergeben Sie es als Argument an eine andere Methode.
es: {0} llama a {1} pero no usa el código de error o HRESULT que devuelve el método. Esto puede dar lugar a un comportamiento inesperado en condiciones de error o situaciones de pocos recursos. Use el resultado en una instrucción condicional, asigne el resultado a una variable o páselo como argumento a otro método.
fr: {0} appelle {1} mais n'utilise pas la valeur HRESULT ou le code d'erreur retourné par la méthode. Cela peut entraîner un comportement inattendu dans les conditions d'erreurs ou dans les situations où les ressources sont limitées. Utilisez le résultat dans une instruction conditionnelle, assignez-le à une variable ou passez-le en tant qu'argument à une autre méthode.
it: {0} chiama {1} ma non usa l'HRESULT o il codice errore restituito dal metodo. Questo potrebbe causare un comportamento imprevisto in condizioni di errore o in situazioni di risorse insufficienti. Usare il risultato in un'istruzione condizionale, assegnare il risultato a una variabile o passarlo come argomento a un altro metodo.
ko: {0}이(가) {1}을(를) 호출하지만 메서드가 반환하는 HRESULT 또는 오류 코드를 사용하지 않습니다. 이로 인해 오류 상태의 예기치 않은 동작이 발생하거나 리소스가 부족해질 수 있습니다. 결과를 조건문에 사용하거나 변수에 할당하거나 다른 메서드에 인수로 전달하세요.
pt_br: {0} chama {1}, mas não usa HRESULT ou o código do erro retornado pelo método. Isso poderia levar a um comportamento inesperado em condições de erro ou situações de poucos recursos. Use o resultado em uma instrução condicional, atribua o resultado a uma variável ou passe-o como argumento para outro método.
tr: {0}, {1} çağırıyor ancak yöntemin döndürdüğü HRESULT veya hata kodunu kullanmıyor. Bu, hata koşullarında ya da düşük kaynak durumlarında beklenmedik davranışlara neden olabilir. Bir koşullu ifadedeki sonucu kullanın, sonucu bir değişkene atayın veya bir bağımsız değişken olarak başka bir yönteme geçirin.
zh_hant: {0} 呼叫了 {1}，但未使用方法傳回的 HRESULT 或錯誤碼。如此可能會導致錯誤情況或資源不足時出現非預期的行為。請使用條件陳述式中的結果、將結果指派到變數，或將其以引數方式傳遞到另一個方法。

# DoNotIgnoreMethodResultsMessageTryParse
source: {0} calls {1} but does not explicitly check whether the conversion succeeded. Either use the return value in a conditional statement or verify that the call site expects that the out argument will be set to the default value when the conversion fails.
cs: {0} volá {1}, ale explicitně nekontroluje, jestli byl převod úspěšný. Buď použijte návratovou hodnotu v podmíněném příkazu, nebo ověřte, jestli volající web očekává, že se výstupní argument nastaví na výchozí hodnotu, když se převod nepodaří.
de: "{0}" ruft "{1}" auf, überprüft aber nicht explizit, ob die Konvertierung erfolgreich verlaufen ist. Verwenden Sie entweder den Rückgabewert in einer Bedingungsanweisung, oder prüfen Sie, ob die Aufrufsite erwartet, dass das ausgehende Argument bei einem Konvertierungsfehler auf den Standardwert festgelegt wird.
es: {0} llama a {1} pero no comprueba de forma explícita si la conversión se realizó correctamente. Use el valor devuelto en una instrucción condicional o compruebe que el sitio de la llamada espera que el argumento de salida se establezca en el valor predeterminado cuando la conversión no es correcta.
fr: {0} appelle {1} mais ne vérifie pas explicitement si la conversion a réussi. Utilisez la valeur de retour dans une instruction conditionnelle, ou vérifiez que le site d'appel s'attend à ce que l'argument out accepte la valeur par défaut en cas d'échec de la conversion.
it: {0} chiama {1} ma non verifica in modo esplicito se la conversione è riuscita. Usare il valore restituito in un'istruzione condizionale o verificare che il sito di chiamata preveda l'impostazione dell'argomento out sul valore predefinito in caso di conversione non riuscita.
ko: {0}이(가) {1}을(를) 호출하지만 변환 성공 여부를 명시적으로 검사하지 않습니다. 반환 값을 조건문에 사용하거나, 변환에 실패하면 out 인수가 기본값으로 설정되도록 호출 사이트가 지정되어 있는지 확인하세요.
pt_br: {0} chama {1}, mas não verifica explicitamente se a conversão foi bem-sucedida. Use o valor retornado em uma instrução condicional ou verifique se o local da chamada espera que o argumento de saída seja definido como o valor padrão quando a conversão falha.
tr: {0}, {1} çağırıyor ancak dönüşümün başarılı olup olmadığını açıkça denetlemiyor. Dönüş değerini koşullu bir ifadede kullanın veya çağırma sitesinin çıkış değerinin dönüşüm başarısız olduğunda varsayılan değere ayarlanmasını beklediğini doğrulayın.
zh_hant: {0} 呼叫了 {1}，但未明確地檢查轉換是否成功。請在條件陳述式中使用傳回值，或確認呼叫位置在轉換失敗時，預期會將 out 引數設為預設值。

# AvoidUninstantiatedInternalClassesTitle
source: Avoid uninstantiated internal classes
cs: Vyhněte se interním třídám bez vytvořené instance.
de: Nicht instanziierte interne Klassen vermeiden
es: Evitar las clases internas sin instancia
fr: Éviter les classes internes non instanciées
it: Evitare classi interne per cui non è stata creata un'istanza
ko: 인스턴스화되지 않는 내부 클래스를 사용하지 마세요.
pt_br: Evite classes internas sem instâncias
tr: Örneklendirilmemiş iç sınıflardan kaçının
zh_hant: 避免未具現化的內部類別

# AvoidUninstantiatedInternalClassesDescription
source: An instance of an assembly-level type is not created by code in the assembly.
cs: Instance typu na úrovni sestavení není vytvořená kódem v tomto sestavení.
de: Eine Instanz eines Typs auf Assemblyebene wird nicht von Code in der Assembly erstellt.
es: El código no crea ninguna instancia de un tipo de nivel de ensamblado en el ensamblado.
fr: Une instance d'un type au niveau de l'assembly n'est pas créée par du code dans l'assembly.
it: Il codice nell'assembly non crea un'istanza di un tipo a livello di assembly.
ko: 어셈블리 수준 형식의 인스턴스는 어셈블리 코드에서 만들어지지 않습니다.
pt_br: Uma instância de um tipo de nível de assembly não é criada pelo código no assembly.
tr: Derleme düzeyi bir türün örneği derlemede kod tarafından oluşturulmaz.
zh_hant: 組件層級類型的執行個體，並非由組件中的程式碼所建立。

# AvoidUninstantiatedInternalClassesMessage
source: {0} is an internal class that is apparently never instantiated. If so, remove the code from the assembly. If this class is intended to contain only static members, make it static (Shared in Visual Basic).
cs: {0} je interní třída, jejíž instance není zjevně vůbec vytvořená. V takovém případě odeberte tento kód ze sestavení. Pokud má tato třída obsahovat jenom statické členy, nastavte ji jako statickou (sdílenou ve Visual Basicu).
de: "{0}" ist eine interne Klasse, die offenbar niemals instanziiert wird. Entfernen Sie in diesem Fall den Code aus der Assembly. Wenn diese Klasse nur statische Member enthalten soll, legen Sie sie als "static" fest ("Shared" in Visual Basic).
es: {0} es una clase interna de la que aparentemente nunca se crea una instancia. Si es así, quite el código del ensamblado. Si esta clase está destinada a contener solo miembros estáticos, conviértala en static (Shared en Visual Basic).
fr: {0} est une classe interne qui n'est apparemment jamais instanciée. Si tel est le cas, supprimez le code de l'assembly. Si cette classe est destinée à contenir uniquement des membres statiques, rendez-la static (Shared en Visual Basic).
it: {0} è una classe internal per la quale sembra che non sia stata mai creata un'istanza. In tal caso, rimuovere il codice dall'assembly. Se questa classe deve contenere solo membri static, impostarla come static (Shared in Visual Basic).
ko: {0}은(는) 인스턴스화되지 않는 내부 클래스입니다. 어셈블리에서 해당 코드를 제거하세요. 이 클래스가 정적 멤버만 포함하는 경우 static(Visual Basic의 경우 Shared)으로 설정하세요.
pt_br: {0} é uma classe interna cuja instância aparentemente nunca é criada. Caso seja, remova o código do assembly. Se essa classe destina-se a conter apenas membros estáticos, torne-a estática (Shared no Visual Basic).
tr: {0} hiç örneklenmemiş gibi görünen bir iç sınıftır. Öyleyse, kodu derlemeden kaldırın. Bu sınıfın yalnızca statik üyeler içermesi gerekiyorsa, statik yapın (Visual Basic’te Shared).
zh_hant: {0} 是明顯從未具現化的內部類別。若是如此，請從組件中移除該程式碼。如果此類別預計只會包含靜態成員，請將其設為 Static (在 Visual Basic 中為 Shared)。

# AvoidUnusedPrivateFieldsTitle
source: Avoid unused private fields
cs: Vyhněte se nepoužitým privátním polím.
de: Nicht verwendete private Felder vermeiden
es: Evitar los campos privados sin utilizar
fr: Évitez les champs privés inutilisés
it: Evitare campi privati inutilizzati
ko: 사용하지 않는 프라이빗 필드를 사용하지 마세요.
pt_br: Evite campos particulares não utilizados
tr: Kullanılmayan özel alanlardan kaçının
zh_hant: 避免未使用的私用欄位

# AvoidUnusedPrivateFieldsDescription
source: Private fields were detected that do not appear to be accessed in the assembly.
cs: Byla zjištěna privátní pole, která se podle všeho v tomto sestavení nepoužívají.
de: Private Felder wurden ermittelt, auf die in der Assembly offenbar nicht zugegriffen wird.
es: Se detectaron campos privados a los que no parece que se acceda en el ensamblado
fr: Des champs privés qui ne semblent pas être accessibles dans l'assembly ont été détectés.
it: Sono stati rilevati campi privati che sembrano essere inutilizzati nell'assembly.
ko: 어셈블리 내부에서 액세스되지 않는 프라이빗 필드가 발견되었습니다.
pt_br: Foram detectados campos particulares que não parecem ser acessados dentro do assembly.
tr: Derleme içerisinde erişilmeyen özel alanlar algılandı.
zh_hant: 偵測到似乎無法於組件內存取的私用欄位。

# AvoidUnusedPrivateFieldsMessage
source: Unused field '{0}'.
cs: Nepoužité pole {0}.
de: Nicht verwendetes Feld "{0}".
es: El campo “{0}” no se usa.
fr: Champ '{0}' inutilisé.
it: Il campo '{0}' è inutilizzato.
ko: 사용하지 않는 필드 '{0}'.
pt_br: Campo '{0}' não utilizado.
tr: Kullanılmayan alan '{0}'.
zh_hant: 未使用的欄位 '{0}'。

# DoNotIgnoreMethodResultsMessagePureMethod
source: {0} calls {1} but does not use the value the method returns. Because {1} is marked as a Pure method, it cannot have side effects. Use the result in a conditional statement, assign the result to a variable, or pass it as an argument to another method.
cs: {0} volá {1}, ale nepoužívá hodnotu, kterou tato metoda vrací. Protože {1} je označená jako metoda Pure, nemůže mít vedlejší účinky. Použijte výsledek v podmíněném příkazu, přiřaďte výsledek proměnné nebo ho předejte jako argument jiné metodě.
de: "{0}" ruft "{1}" auf, verwendet jedoch nicht den von der Methode zurückgegebenen Wert. Weil "{1}" als Pure-Methode markiert ist, kann sie keine Nebeneffekte haben. Verwenden Sie das Ergebnis in einer Bedingungsanweisung, weisen Sie das Ergebnis einer Variablen zu, oder übergeben Sie es als Argument an eine andere Methode.
es: {0} llama a {1} pero no usa el valor que el método devuelve. {1} se ha marcado como método Pure, por lo que no puede tener efectos secundarios. Use el resultado en una instrucción condicional, asigne el resultado a una variable o páselo como argumento a otro método.
fr: {0} appelle {1} mais n'utilise pas la valeur retournée par la méthode. Dans la mesure où {1} est marqué en tant que méthode Pure, il ne peut pas avoir d'effets secondaires. Utilisez le résultat dans une instruction conditionnelle, assignez-le à une variable ou passez-le en tant qu'argument à une autre méthode.
it: {0} chiama {1} ma non usa il valore restituito dal metodo. Dal momento che {1} è contrassegnato come metodo Pure, non può avere effetti collaterali. Usare il risultato in un'istruzione condizionale, assegnare il risultato a una variabile o passarlo come argomento a un altro metodo.
ko: {0}이(가) {1}을(를) 호출하지만 메서드가 반환하는 값을 사용하지 않습니다. {1}이(가) 순수 메서드로 표시되어 있으므로 의도하지 않은 결과가 발생하지 않습니다. 결과를 조건문에 사용하거나 변수에 할당하거나 다른 메서드에 인수로 전달하세요.
pt_br: {0} chama {1}, mas não usa o valor retornado pelo método. Como {1} é marcado como um método Pure, ele não pode ter efeitos colaterais. Use o resultado em uma instrução condicional, atribua o resultado a uma variável ou passe-o como argumento para outro método.
tr: {0} {1} çağırıyor ancak yöntemin döndürdüğü değeri kullanmıyor. {1} Saf yöntem olarak işaretlendiğinden yan etkilere sahip olamaz. Bir koşullu ifadedeki sonucu kullanın, sonucu bir değişkene atayın veya bir bağımsız değişken olarak başka bir yönteme geçirin.
zh_hant: {0} 呼叫了 {1}，但未使用方法傳回的值。因為 {1} 標記為 Pure 方法，所以不能有副作用。請使用條件陳述式中的結果、將結果指派到變數，或將其以引數方式傳遞到另一個方法。

# UseNameOfInPlaceOfStringDescription
source: Using nameof helps keep your code valid when refactoring.
cs: Použití nameof pomůže zachovat platnost vašeho kódu při refaktoringu.
de: Durch das Verwenden von "nameof" behält Ihr Code beim Refactoring seine Gültigkeit.
es: El uso de nameof ayuda a mantener el código válido durante la refactorización.
fr: L'utilisation de nameof permet à votre code de rester valide lors de la refactorisation.
it: Se si usa nameof, il codice rimarrà valido durante il refactoring.
ko: nameof를 사용하면 리팩터링 시 코드를 유효하게 유지할 수 있습니다.
pt_br: Usar nameof ajuda a manter seu código válido ao refatorar.
tr: Nameof kullanmak yeniden düzenlerken kodunuzun geçerli kalmasına yardımcı olur.
zh_hant: 使用 nameof 可以協助您於重構時保持程式碼的有效性。

# UseNameOfInPlaceOfStringMessage
source: Use nameof in place of string literal '{0}'
cs: Namísto řetězcového literálu {0} použijte nameof.
de: "nameof" anstelle des Zeichenfolgenliterals "{0}" verwenden
es: Use nameof en lugar del literal de cadena "{0}"
fr: Utiliser nameof à la place du littéral de chaîne '{0}'
it: Usare nameof invece del valore letterale stringa '{0}'
ko: 문자열 리터럴 '{0}' 대신 nameof 사용
pt_br: Usar nameof em lugar do literal de cadeia de caracteres '{0}'
tr: Dize sabiti '{0}' yerine nameof kullanın
zh_hant: 使用 nameof 取代字串常值 '{0}'

# UseNameOfInPlaceOfStringTitle
source: Use nameof to express symbol names
cs: K vyjádření názvů symbolů použijte nameof
de: "nameof" für Symbolnamen verwenden
es: Use nameof para expresar nombres de símbolos
fr: Utiliser nameof pour exprimer les noms de symboles
it: Usare nameof per esprimere nomi di simbolo
ko: 기호 이름을 표시하기 위해 nameof 사용
pt_br: Usar nameof para expressar nomes de símbolo
tr: Sembol adlarını ifade etmek için nameof kullanın
zh_hant: 使用 nameof 表示符號名稱
