Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.CodeQuality.Analyzers/Core/Maintainability/xlf/MicrosoftMaintainabilityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ko, pt_br, tr, zh_hant

# AvoidUnmantainableCodeDescription
source: The maintainability index is calculated by using the following metrics: lines of code, program volume, and cyclomatic complexity. Program volume is a measure of the difficulty of understanding of a symbol that is based on the number of operators and operands in the code. Cyclomatic complexity is a measure of the structural complexity of the type or method. A low maintainability index indicates that code is probably difficult to maintain and would be a good candidate to redesign.
cs: Index udržovatelnosti se počítá pomocí těchto metrik: řádky kódu, objem programu a cyklomatická složitost. Objem programu je míra, jak obtížné je porozumět symbolu založenému na počtu operátorů a operandů v kódu. Cyklomatická složitost je míra strukturální složitosti typu nebo metody. Nízký index udržovatelnosti může znamenat, že kód bude pravděpodobně obtížné udržovat a byl by vhodným kandidátem na změnu návrhu.
de: Der Wartbarkeitsindex wird mithilfe der folgenden Metriken berechnet: Codezeilen, Programmvolumen und zyklomatische Komplexität. Das Programmvolumen ist ein Maß für die Verständnisschwierigkeit für ein Symbol, das auf der Anzahl von Operatoren und Operanden im Code basiert. Zyklomatische Komplexität ist ein Maß für die strukturelle Komplexität des Typs oder der Methode. Ein niedriger Wartbarkeitsindex weist darauf hin, dass Code wahrscheinlich schwer zu warten ist und ein guter Kandidat für eine Neuentwicklung wäre.
es: El índice de mantenimiento se calcula con las métricas siguientes: líneas de código, volumen del programa y complejidad ciclomática. El volumen del programa es una medida de la dificultad para entender un símbolo que se basa en el número de operadores y de operandos en el código. La complejidad ciclomática es una medida de la complejidad estructural del tipo o método. Un índice de mantenimiento bajo indica que el código es probablemente difícil de mantener y sería un buen candidato para rediseñarlo.
fr: L'indice de maintenabilité est calculé à l'aide des métriques suivantes : lignes de code, volume de programme et complexité cyclomatique. Le volume de programme est une mesure de la difficulté de compréhension d'un symbole en fonction du nombre d'opérateurs et d'opérandes dans le code. La complexité cyclomatique est une mesure de la complexité structurelle du type ou de la méthode. Un faible indice de maintenabilité indique que le code est probablement difficile à tenir à jour, et qu'il est préférable de revoir sa conception.
it: Per calcolare l'indice di manutenibilità, si usano le metriche seguenti: righe di codice, volume del programma e complessità ciclomatica. Il volume del programma misura la difficoltà di comprensione di un simbolo sulla base del numero di operatori e operandi presenti nel codice. La complessità ciclomatica misura la complessità strutturale del tipo o del metodo. Un indice di manutenibilità basso indica che il codice è probabilmente più difficile da gestire ed è quindi un valido candidato per la riprogettazione.
ko: 유지 관리 인덱스는 코드, 프로그램 볼륨 및 순환 복잡성 줄과 같은 메트릭을 사용하여 계산됩니다. 프로그램 볼륨은 코드에 있는 연산자 및 피연산자 개수에 따른 기호 이해도의 측정값입니다. 순환 복잡성은 형식이나 메서드에 대한 구조적 복잡성의 측정값입니다. 낮은 유지 관리 인덱스는 코드를 유지 관리하기 어려울 수 있어 다시 설계하기 좋은 후보임을 나타냅니다.
pt_br: O índice de facilidade de manutenção é calculado usando as seguintes métricas: linhas de código, volume do programa e complexidade ciclomática. O volume do programa é uma medida da dificuldade de entender um símbolo baseado no número de operadores e operandos no código. A complexidade ciclomática é uma medida da complexidade estrutural do tipo ou do método. Um índice de facilidade de manutenção baixo indica que, provavelmente, o código é difícil de ser mantido e seria um bom candidato para a reformulação.
tr: Bakım endeksi şu ölçümler kullanılarak hesaplanır: kod satırları, program hacmi ve döngüsel karmaşıklık. Program hacmi, koddaki işleç ve işlenen sayısına bağlı olarak bir sembolün anlaşılma zorluğu ölçüsüdür. Döngüsel karmaşıklık, türün veya metodun yapısal karmaşıklık ölçüsüdür. Düşük bakım endeksi, kodun bakımının zor olabileceğini ve yeniden tasarlanmak için iyi bir aday olduğunu gösterir.
zh_hant: 使用下列度量可計算維護性指數: 程式碼行數、程式量以及循環複雜度。從程式量可測出了解符號的困難度，而其取決於程式碼中的運算子與運算元數目。而循環複雜度可測出類型或方法的結構性複雜度。維護指數低，表示程式碼的維護可能較困難，而重新設計會是比較好的選擇。

# AvoidUnmantainableCodeMessage
source: '{0}' has a maintainability index of '{1}'. Rewrite or refactor the code to increase its maintainability index (MI) above '{2}'.
cs: {0} má index udržovatelnosti {1}. Přepište nebo refaktorujte kód tak, aby se index udržovatelnosti zvýšil nad {2}.
de: "{0}" hat einen Wartbarkeitsindex von "{1}". Schreiben Sie den Code neu, oder gestalten Sie ihn um, um den Wartbarkeitsindex auf einen Wert über "{2}" zu erhöhen.
es: "{0}" tiene un índice de mantenimiento de "{1}". Escriba o refactorice el código para aumentar su índice de mantenimiento sobre "{2}".
fr: '{0}' a un indice de maintenabilité de '{1}'. Réécrivez ou refactorisez le code pour monter son indice de maintenabilité au-dessus de '{2}'.
it: L'indice di manutenibilità di '{0}' è '{1}'. Riscrivere il codice o effettuarne il refactoring per aumentare l'indice di manutenibilità sopra '{2}'.
ko: '{0}'의 유지 관리 인덱스가 '{1}'입니다. 코드를 다시 작성하거나 리펙터링하여 MI(유지 관리 인덱스)를 '{2}' 이상으로 늘리세요.
pt_br: '{0}' tem um índice de manutenção de '{1}'. Reescreva ou refatore o código para aumentar o seu índice de manutenção (MI) acima de '{2}'.
tr: '{0}' öğesinin bakım endeksi '{1}'. Kodu yeniden yazarak veya yeniden düzenleyerek bakım endeksini (MI) '{2}' düzeyinin üstüne çıkarın.
zh_hant: ‘{0}’ 的可維護性指數為 '{1}’。請重寫或重構程式碼，以將其可維護性指數 (MI) 提高到 ‘{2}’ 以上。

# AvoidUnmantainableCodeTitle
source: Avoid unmaintainable code
cs: Vyhněte se neudržovatelnému kódu
de: Nicht wartbaren Code vermeiden
es: Evite código que no se puede mantener
fr: Éviter le code impossible à maintenir
it: Evita codice non gestibile
ko: 유지 관리할 수 없는 코드는 사용하지 마십시오.
pt_br: Evitar código de difícil manutenção
tr: Sürdürülemeyen koddan kaçın
zh_hant: 避免無法維護的程式碼

# InvalidEntryInCodeMetricsConfigFileDescription
source: Invalid entry in code metrics rule specification file
cs: Neplatná položka v souboru specifikace pravidel metrik kódu
de: Ungültiger Eintrag in der Datei zur Spezifikation von Regeln für Codemteriken.
es: Entrada no válida en el archivo de especificación de regla de métricas de código
fr: Entrée non valide dans le fichier de spécification de règle de métrique du code
it: Voce non valida nel file di specifica delle regole per la metrica del codice
ko: 코드 메트릭 규칙 사양 파일의 잘못된 항목
pt_br: Entrada inválida no arquivo de especificação de regra de medição de código
tr: Kod ölçümleri kural belirtimi dosyasında geçersiz giriş
zh_hant: 程式碼度量規則規格檔案中的項目無效

# InvalidEntryInCodeMetricsConfigFileMessage
source: Invalid entry '{0}' in code metrics rule specification file '{1}'
cs: Neplatná položka {0} v souboru specifikace pravidel metrik kódu {1}
de: Ungültige Eingabe "{0}" in der Spezifikationsdatei "{1}" für Codemetrikregeln.
es: Entrada no válida "{0}" en el archivo de especificación de la regla de métricas de código "{1}"
fr: Entrée non valide '{0}' dans le fichier de spécification de règle de métrique du code '{1}'
it: Voce non valida '{0}' nel file '{1}' di specifica delle regole per la metrica del codice
ko: 코드 메트릭 규칙 사용 파일 '{1}'의 잘못된 항목 '{0}'
pt_br: Entrada inválida '{0}' no arquivo de especificação de medição de código '{1}'
tr: '{1}' adlı kod ölçümleri kural belirtimi dosyasındaki '{0}' girişi geçersiz
zh_hant: 程式碼度量規則規格檔案 ‘{1}’ 中的項目 ‘{0}’ 無效

# InvalidEntryInCodeMetricsConfigFileTitle
source: Invalid entry in code metrics rule specification file
cs: Neplatná položka v souboru specifikace pravidel metrik kódu
de: Ungültiger Eintrag in der Spezifikationsdatei für die Codemetrikregeln.
es: Entrada no válida en el archivo de especificación de regla de métricas de código
fr: Entrée non valide dans le fichier de spécification de règle de métrique du code
it: Voce non valida nel file di specifica delle regole per la metrica del codice
ko: 코드 메트릭 규착 사양 파일의 잘못된 항목
pt_br: Entrada inválida no arquivo de especificação de regra de métricas de código
tr: Ölçüm kuralı belirtim dosyasında geçersiz giriş
zh_hant: 程式碼度量規則規格檔案中的項目無效

# VariableNamesShouldNotMatchFieldNamesTitle
source: Variable names should not match field names
cs: Názvy proměnných se nemají shodovat s názvy polí.
de: Variablennamen dürfen nicht mit Feldnamen übereinstimmen
es: Los nombres de las variables no deben coincidir con los nombres de los campos
fr: Les noms de variables ne doivent pas correspondre à des noms de champs
it: I nomi di variabile non devono corrispondere ai nomi di campo
ko: 변수 이름과 필드 이름이 일치하지 않아야 합니다.
pt_br: Nomes de variáveis não devem corresponder a nomes de campos
tr: Değişken adları alan adlarıyla eşleşmemelidir
zh_hant: 變數名稱不應與欄位名稱相符

# VariableNamesShouldNotMatchFieldNamesDescription
source: An instance method declares a parameter or a local variable whose name matches an instance field of the declaring type, leading to errors.
cs: Metoda instance deklaruje parametr nebo lokální proměnnou, jejíž název se shoduje s polem instance deklarujícího typu, což způsobí chyby.
de: Eine Instanzenmethode deklariert einen Parameter oder eine lokale Variable, deren Name mit einem Instanzenfeld des deklarierenden Typs übereinstimmt. Dies führt zu Fehlern.
es: Un método de instancia declara un parámetro o una variable local cuyo nombre coincide con un campo de instancia del tipo declarativo, lo que genera errores.
fr: Une méthode d'instance déclare un paramètre ou une variable locale dont le nom correspond à un champ d'instance du type déclarant, ce qui entraîne des erreurs.
it: Un metodo di istanza dichiara un parametro o una variabile locale il cui nome corrisponde a un campo di istanza del tipo dichiarante, quindi vengono generati errori.
ko: 인스턴스 메서드가 매개 변수 또는 지역 변수를 선언하며 지역 변수의 이름이 선언 형식의 인스턴스 필드와 일치하여 오류가 발생합니다.
pt_br: Um método de instância declara um parâmetro ou uma variável local cujo nome corresponde a um campo de instância do tipo declarativo, ocasionando erros.
tr: Bir örnek yöntemi, adı bildiren türün bir örnek alanıyla eşleşen bir parametre veya yerel değişken bildirerek hatalara neden oluyor.
zh_hant: 執行個體方法宣告的參數或區域變數，其名稱與宣告類型的執行個體欄位相符，所以導致錯誤。

# VariableNamesShouldNotMatchFieldNamesMessageLocal
source: {0}, a variable declared in {1}, has the same name as an instance field on the type. Change the name of one of these items.
cs: Proměnná {0} deklarovaná v {1} má stejný název jako pole instance u tohoto typu. Změňte název jedné z těchto položek.
de: "{0}", eine in "{1}" deklarierte Variable, besitzt denselben Namen wie ein Instanzenfeld für den Typ. Ändern Sie den Namen eines der Elemente.
es: {0}, una variable declarada en {1}, tiene el mismo nombre que un campo de instancia en el tipo. Cambie el nombre de uno de estos elementos.
fr: {0}, une variable déclarée dans {1}, a le même nom qu'un champ d'instance sur le type. Changez le nom de l'un de ces éléments.
it: La variabile {0} dichiarata in {1} ha lo stesso nome di un campo di istanza sul tipo. Modificare il nome di uno di questi elementi.
ko: {1}에서 선언된 변수 {0}의 이름이 이 형식의 인스턴스 필드와 일치합니다. 이 항목 중 하나의 이름을 변경하세요.
pt_br: {0}, uma variável declarada em {1}, tem o mesmo nome de um campo de instância no tipo. Altere o nome de um desses itens.
tr: {0} {1} içinde tanımlanmış bir değişkendir ve tür üzerindeki bir örnek alanıyla aynı ada sahiptir. Bu öğelerden birinin adını değiştirin.
zh_hant: {0} 是在 {1} 中宣告的變數，其與類型上的執行個體欄位有相同的名稱。請變更其中一個這些項目的名稱。

# VariableNamesShouldNotMatchFieldNamesMessageParameter
source: {0}, a parameter declared in {1}, has the same name as an instance field on the type. Change the name of one of these items.
cs: Parametr {0} deklarovaný v {1} má stejný název jako pole instance u tohoto typu. Změňte název jedné z těchto položek.
de: "{0}", ein in "{1}" deklarierter Parameter, besitzt denselben Namen wie ein Instanzenfeld für den Typ. Ändern Sie den Namen eines der Elemente.
es: {0}, un parámetro declarado en {1}, tiene el mismo nombre que un campo de instancia en el tipo. Cambie el nombre de uno de estos elementos.
fr: {0}, un paramètre déclaré dans {1}, a le même nom qu'un champ d'instance sur le type. Changez le nom de l'un de ces éléments.
it: Il parametro {0} dichiarato in {1} ha lo stesso nome di un campo di istanza sul tipo. Modificare il nome di uno di questi elementi.
ko: {1}에서 선언된 매개 변수 {0}의 이름이 이 형식의 인스턴스 필드와 일치합니다. 이 항목 중 하나의 이름을 변경하세요.
pt_br: {0}, um parâmetro declarado em {1}, tem o mesmo nome de um campo de instância no tipo. Altere o nome de um desses itens.
tr: {0} {1} içinde tanımlanmış bir parametredir ve tür üzerindeki bir örnek alanıyla aynı ada sahiptir. Bu öğelerden birinin adını değiştirin.
zh_hant: {0} 是在 {1} 中宣告的參數，其與類型上的執行個體欄位具有相同的名稱。請變更其中一個這些項目的名稱。

# ReviewUnusedParametersTitle
source: Review unused parameters
cs: Zkontrolujte nepoužité parametry.
de: Nicht verwendete Parameter überprüfen
es: Revisar parámetros sin utilizar
fr: Passer en revue les paramètres inutilisés
it: Esaminare i parametri inutilizzati
ko: 사용하지 않는 매개 변수를 검토하세요.
pt_br: Examinar parâmetros não utilizados
tr: Kullanılmayan parametreleri gözden geçirin
zh_hant: 檢閱未使用的參數

# ReviewUnusedParametersDescription
source: Avoid unused paramereters in your code. If the parameter cannot be removed, then change its name so it starts with an underscore and is optionally followed by an integer, such as '_', '_1', '_2', etc. These are treated as special discard symbol names.
cs: Podpis metody obsahuje parametr, který se nepoužívá v těle metody.
de: Eine Methodensignatur enthält einen Parameter, der im Methodentext nicht verwendet wird.
es: Una signatura de método incluye un parámetro que no se usa en el cuerpo del método.
fr: Une signature de méthode inclut un paramètre qui n'est pas utilisé dans le corps de la méthode.
it: Una firma di metodo include un parametro non usato nel corpo del metodo.
ko: 메서드 시그니처가 메서드 본문에서 사용하지 않는 매개 변수를 포함합니다.
pt_br: Uma assinatura de método inclui um parâmetro não usado no corpo do método.
tr: Yöntem imzası yöntem gövdesinde kullanılmayan bir parametre içeriyor.
zh_hant: 方法簽章包括並未用於方法主體中的參數。

# ReviewUnusedParametersMessage
source: Parameter {0} of method {1} is never used. Remove the parameter or use it in the method body.
cs: Parametr {0} metody {1} se vůbec nepoužívá. Odeberte tento parametr nebo ho použijte v těle metody.
de: Der Parameter "{0}" der Methode "{1}" wird niemals verwendet. Entfernen Sie den Parameter, oder verwenden Sie ihn im Methodentext.
es: El parámetro {0} del método {1} no se usa nunca. Quite el parámetro o úselo en el cuerpo del método.
fr: Le paramètre {0} de la méthode {1} n'est jamais utilisé. Supprimez le paramètre ou utilisez-le dans le corps de la méthode.
it: Il parametro {0} del metodo {1} non viene mai usato. Rimuovere il parametro o usarlo nel corpo del metodo.
ko: {1} 메서드의 {0} 매개 변수가 사용되지 않았습니다. 매개 변수를 제거하거나 메서드 본문에 사용하세요.
pt_br: O parâmetro {0} do método {1} nunca é usado. Remova o parâmetro ou use-o no corpo do método.
tr: {1} yönteminin {0} parametresi hiçbir zaman kullanılmıyor. Parametreyi kaldırın veya yöntem gövdesinde kullanın.
zh_hant: 方法 {1} 的參數 {0} 從未使用過。請移除此參數，或將其用於方法主體中。

# RemoveUnusedParameterMessage
source: Remove unused parameter
cs: Odebrat nepoužívaný parametr
de: Nicht verwendete Parameter entfernen
es: Quitar parámetro no utilizado
fr: Supprimer le paramètre inutilisé
it: Rimuovere il parametro inutilizzato
ko: 사용하지 않는 매개 변수를 제거하세요.
pt_br: Remover o parâmetro não utilizado
tr: Kullanılmayan parametreyi kaldırma
zh_hant: 移除未使用的參數

# DoNotIgnoreMethodResultsTitle
source: Do not ignore method results
cs: Neignorujte výsledky metod.
de: Methodenergebnisse nicht ignorieren
es: No omitir resultados del método
fr: Ne pas ignorer les résultats des méthodes
it: Non ignorare i risultati del metodo
ko: 메서드 결과를 무시하지 마세요.
pt_br: Não ignorar resultados de métodos
tr: Yöntem sonuçlarını yoksaymayın
zh_hant: 請勿略過方法結果

# DoNotIgnoreMethodResultsDescription
source: A new object is created but never used; or a method that creates and returns a new string is called and the new string is never used; or a COM or P/Invoke method returns an HRESULT or error code that is never used.
cs: Je vytvořený nový objekt, který se vůbec nepoužívá; nebo se volá metoda, která vytváří a vrací nový řetězec, který se vůbec nepoužívá; nebo metoda COM či P/Invoke vrací HRESULT nebo kód chyby, který se vůbec nepoužívá.
de: Ein neues Objekt wird erstellt, aber nicht verwendet, oder eine Methode wird aufgerufen, die eine neue Zeichenfolge erstellt und zurückgibt, aber die neue Zeichenfolge wird niemals verwendet, oder eine COM- oder P/Invoke-Methode gibt einen HRESULT-Wert oder einen Fehlercode zurück, der nicht verwendet wird.
es: Se crea un objeto pero no se usa nunca, se llama a un método que crea y devuelve una cadena nueva la cual no se usa nunca o bien un método P/Invoke o COM devuelve un código de error o HRESULT que no se usa nunca.
fr: Un objet est créé mais jamais utilisé, ou une méthode qui crée et retourne une nouvelle chaîne est appelée mais celle-ci n'est jamais utilisée, ou bien une méthode COM ou P/Invoke retourne une valeur HRESULT ou un code d'erreur qui n'est jamais utilisé.
it: Un nuovo oggetto viene creato ma mai usato oppure viene chiamato un metodo che crea e restituisce una nuova stringa che non viene mai usata oppure un metodo COM o P/Invoke restituisce un HRESULT o un codice errore che non viene mai usato.
ko: 새 개체가 만들어졌으나 사용되지 않았습니다. 또는 새 문자열을 만들고 반환한 메서드가 호출되었으며 새 문자열이 사용되지 않았습니다. 또는 COM 또는 P/Invoke가 사용되지 않는 HRESULT 또는 오류 코드를 반환합니다.
pt_br: Um novo objeto é criado, mas nunca usado; ou um método que cria e retorna uma nova cadeia de caracteres é chamado e a nova cadeia de caracteres nunca é usada; ou um método COM ou P/Invoke retorna um HRESULT ou um código de erro que nunca é usado.
tr: Yeni bir nesne oluşturulur ancak hiçbir zaman kullanılmaz; veya yeni bir dize oluşturup döndüren bir yöntem çağrılır ve yeni dize hiçbir zaman kullanılmaz; veya bir COM ya da P/Invoke yöntemi hiçbir zaman kullanılmayan bir HRESULT veya hata kodu döndürür.
zh_hant: 已建立但從未使用的新物件; 或是會建立並傳回呼叫的新字串之方法，以及從未使用過的新字串; 或是傳回 HRESULT 或從未使用過的錯誤碼之 COM 或 P/Invoke。

# DoNotIgnoreMethodResultsMessageObjectCreation
source: {0} creates a new instance of {1} which is never used. Pass the instance as an argument to another method, assign the instance to a variable, or remove the object creation if it is unnecessary.
cs: {0} vytváří novou instanci {1}, která se vůbec nepoužívá. Předejte tuto instanci jako argument jiné metodě, přiřaďte tuto instanci proměnné nebo odeberte vytvoření objektu, pokud je nepotřebný.
de: "{0}" erstellt eine neue Instanz von "{1}", die nicht verwendet wird. Übergeben Sie die Instanz als Argument an eine andere Methode, weisen Sie die Instanz einer Variablen zu, oder entfernen Sie die Objekterstellung, sofern sie unnötig ist.
es: {0} crea una instancia de {1} que no se usa nunca. Pase la instancia como argumento a otro método, asigne la instancia a una variable o quite la creación del objeto si no es necesaria.
fr: {0} crée une instance de {1} qui n'est jamais utilisée. Passez l'instance en tant qu'argument à une autre méthode, assignez l'instance à une variable ou supprimez la création d'objet si elle n'est pas nécessaire.
it: {0} crea una nuova istanza di {1} che non viene mai usata. Passare l'istanza come argomento di un altro metodo, assegnare l'istanza a una variabile oppure rimuovere la creazione dell'oggetto se non è necessaria.
ko: {0}이(가) 사용되지 않는 {1}의 새 인스턴스를 만듭니다. 인스턴스를 다른 메서드에 인수로 전달하고 변수에 할당하거나 불필요한 경우 개체 만들기를 제거하세요.
pt_br: {0} cria uma nova instância de {1} que nunca é usada. Passe a instância como argumento para outro método, atribua a instância a uma variável ou remova a criação do objeto se ela for desnecessária.
tr: {0} hiçbir zaman kullanılmayan yeni bir {1} örneği oluşturuyor. Örneği bir bağımsız değişken olarak başka yönteme geçirin, örneği bir değişkene atayın ya da gereksizse nesne oluşturmayı kaldırın.
zh_hant: {0} 建立了 {1} 的新執行個體，但從未使用過。請將執行個體以引數方式傳遞到另一個方法、將執行個體指派到變數，或是移除該物件建立 (若不需要的話)。

# DoNotIgnoreMethodResultsMessageStringCreation
source: {0} calls {1} but does not use the new string instance that the method returns. Pass the instance as an argument to another method, assign the instance to a variable, or remove the call if it is unnecessary.
cs: {0} volá {1}, ale nepoužívá novou instanci řetězce, kterou tato metoda vrací. Předejte tuto instanci jako argument jiné metodě, přiřaďte tuto instanci proměnné nebo odeberte volání, pokud je nepotřebné.
de: "{0}" ruft "{1}" auf, verwendet jedoch nicht die neue Zeichenfolgeninstanz, die von der Methode zurückgegeben wird. Übergeben Sie die Instanz als Argument an eine andere Methode, weisen Sie die Instanz einer Variablen zu, oder entfernen Sie den Aufruf, sofern er unnötig ist.
es: {0} llama a {1} pero no usa la nueva instancia de cadena que devuelve el método. Pase la instancia como argumento a otro método, asigne la instancia a una variable o quite la llamada si no es necesaria.
fr: {0} appelle {1} mais n'utilise pas la nouvelle instance de chaîne retournée par la méthode. Passez l'instance en tant qu'argument à une autre méthode, assignez l'instance à une variable ou supprimez l'appel s'il n'est pas nécessaire.
it: {0} chiama {1} ma non usa la nuova istanza di stringa restituita dal metodo. Passare l'istanza come argomento di un altro metodo, assegnare l'istanza a una variabile oppure rimuovere la chiamata se non è necessaria.
ko: {0}이(가) {1}을(를) 호출하지만 메서드가 반환하는 새 문자열 인스턴스를 사용하지 않습니다. 인스턴스를 다른 메서드에 인수로 전달하고 변수에 할당하거나 불필요한 경우 호출을 제거하세요.
pt_br: {0} chama {1}, mas não usa a instância da nova cadeia de caracteres retornada pelo método. Passe a instância como argumento para outro método, atribua a instância a uma variável ou remova a chamada se ela for desnecessária.
tr: {0}, {1} çağırıyor ancak yöntemin döndürdüğü yeni dize örneğini kullanmıyor. Örneği bir bağımsız değişken olarak başka yönteme geçirin, örneği bir değişkene atayın ya da gereksizse çağrıyı kaldırın.
zh_hant: {0} 呼叫了 {1}，但未使用方法傳回的新字串執行個體。請將執行個體以引數方式傳遞到另一個方法、將執行個體指派到變數，或是移除該呼叫 (若不需要的話)。
