Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.CodeQuality.Analyzers/Core/Maintainability/xlf/MicrosoftMaintainabilityAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ko, pt_br, tr, zh_hant

# AvoidDeadConditionalCodeAlwaysTruFalseOrNullMessage
source: '{0}' is always '{1}'. Remove or refactor the condition(s) to avoid dead code.
cs: {0} bude vždy {1}. Odeberte nebo refaktorujte podmínku tak, abyste se vyhnuli mrtvému kódu.
de: "{0}" ist immer "{1}". Entfernen Sie die Bedingung(en), oder gestalten Sie sie um, um toten Code zu vermeiden.
es: "{0}" siempre es "{1}". Quite o refactorice las condiciones para evitar el código no alcanzado.
fr: '{0}' est toujours '{1}'. Supprimez ou refactorisez les conditions pour éviter d'avoir du code mort.
it: '{0}' è sempre '{1}'. Rimuovere le condizioni o effettuarne il refactoring per evitare codice non utilizzato.
ko: '{0}'은(는) 항상 '{1}'입니다. 데드 코드를 방지하려면 조건을 제거하거나 리팩터링합니다.
pt_br: '{0}' é sempre '{1}'. Remova ou refatore as condições para evitar um código morto.
tr: '{0}' her zaman: '{1}'. Ölü kod oluşmasını önlemek için koşulları kaldırın veya yeniden düzenleyin.
zh_hant: '{0}' 一律是 '{1}'。請移除條件或重構條件，避免使用無作用程式碼。

# AvoidDeadConditionalCodeNeverNullMessage
source: '{0}' is never '{1}'. Remove or refactor the condition(s) to avoid dead code.
cs: {0} nikdy nebude {1}. Odeberte nebo refaktorujte podmínku tak, abyste se vyhnuli mrtvému kódu.
de: "{0}" ist niemals "{1}". Entfernen Sie die Bedingung(en), oder gestalten Sie sie um, um toten Code zu vermeiden.
es: "{0}" nunca es "{1}". Quite o refactorice las condiciones para evitar el código no alcanzado.
fr: '{0}' n'est jamais '{1}'. Supprimez ou refactorisez les conditions pour éviter d'avoir du code mort.
it: '{0}' non è mai '{1}'. Rimuovere le condizioni o effettuarne il refactoring per evitare codice non utilizzato.
ko: '{0}'은(는) '{1}'이(가) 아닙니다. 데드 코드를 방지하려면 조건을 제거하거나 리팩터링합니다.
pt_br: '{0}' nunca é '{1}'. Remova ou refatore as condições para evitar um código morto.
tr: '{0}' asla '{1}' değildir. Ölü kod oluşmasını önlemek için koşulları kaldırın veya yeniden düzenleyin.
zh_hant: '{0}' 一律不會是 '{1}'。請移除條件或重構條件，避免使用無作用程式碼。

# AvoidDeadConditionalCodeTitle
source: Avoid dead conditional code
cs: Vyhněte se mrtvému podmíněnému kódu
de: Toten bedingten Code vermeiden
es: Evitar código condicional no alcanzado
fr: Éviter le code conditionnel mort
it: Evitare codice di condizione non utilizzato
ko: 데드 조건부 코드 방지
pt_br: Evite um código condicional morto
tr: Ölü koşullu kod oluşmasından kaçının
zh_hant: 避免使用無作用條件式程式碼

# AvoidExcessiveClassCouplingDescription
source: This rule measures class coupling by counting the number of unique type references that a symbol contains. Symbols that have a high degree of class coupling can be difficult to maintain. It is a good practice to have types and methods that exhibit low coupling and high cohesion. To fix this violation, try to redesign the code to reduce the number of types to which it is coupled.
cs: Toto pravidlo měří párování tříd tak, že počítá jedinečné odkazy na typy obsažené v symbolu. Symboly s vysokým stupněm párování tříd může být složité udržovat. Doporučeným postupem je používat typy a metody s nízkým párováním a vysokou kohezí. Pokud chcete porušení tohoto pravidla opravit, zkuste kód přepracovat tak, aby se snížil počet typů, na které se páruje.
de: Diese Regel misst die Kopplung zwischen Klassen, indem sie die Anzahl der eindeutigen Typrefenzen in einem Symbol zählt. Es kann schwierig sein, Symbole, bei denen viele Klassen aneinder gekoppelt sind, zu verwalten. Es werden Typen und Methoden empfohlen, die wenige Kopplungen und ein hohes Maß an Kohäsion aufweisen. Wenn Sie diesen Verstoß beheben möchten, gestalten Sie den Code um, um die Anzahl an Typen zu reduzieren, an die dieser gekoppelt ist.
es: Esta regla mide el acoplamiento de clase contando el número de referencias de tipo únicas que contiene un símbolo. Los símbolos que tienen un alto grado de acoplamiento de la clase pueden ser difíciles de mantener. Es una buena práctica tener tipos y métodos que exhiben un acoplamiento bajo y una alta cohesión. Para corregir esta infracción, intente rediseñar el código para reducir el número de tipos a los que está acoplado.
fr: Cette règle mesure le couplage de classes en comptant le nombre de références de type uniques que contient un symbole. Les symboles qui ont un haut degré de couplage de classes peuvent être difficiles à maintenir. Une bonne pratique est d'avoir des types et des méthodes qui présentent un faible couplage et une cohésion élevée. Pour corriger cette infraction, essayez de revoir le code afin de réduire le nombre de types auquel il est couplé.
it: Questa regola misura gli accoppiamenti tra classi conteggiando il numero di riferimenti al tipo univoci contenuti in un simbolo. I simboli con un grado elevato di accoppiamento tra classi possono essere difficili da gestire. È consigliabile avere tipi e metodi che mostrano un accoppiamento basso e una coesione elevata. Per risolvere questa violazione, provare a riprogettare il codice in modo da ridurre il numero di tipi a cui viene accoppiato.
ko: 이 규칙은 기호에 포함된 고유한 unique type references that a symbol contains. Symbols that have a high degree of class coupling can be difficult to maintain. It is a good practice to have types and methods that exhibit low coupling and high cohesion. To fix this violation, try to redesign the code to reduce the number of types to which it is coupled.
pt_br: Esta regra mede o acoplamento de classes pela contagem do número de referências de tipo único que um símbolo contém. Símbolos que têm um alto grau de acoplamento de classe podem ser difíceis de manter. É uma prática recomendada ter tipos e métodos que apresentam baixo acoplamento e alta coesão. Para corrigir essa violação, tente reprojetar o código para reduzir o número de tipos para aos quais ela está acoplada.
tr: Bu kural, bir sembolün içerdiği benzersiz tür başvurularını sayarak sınıf bağlantılarını ölçer. Yüksek düzeyde sınıf bağlantısı içeren sembollerin bakımının yapılması zor olabilir. Düşük bağlantı düzeyine ve yüksek uyuma sahip türler ve metotlar kullanılması iyi bir uygulamadır. Bu ihlali düzeltmek için kodu yeniden tasarlayarak kodun bağlı olduğu tür sayısını azaltmayı deneyin.
zh_hant: 此規則會計算符號包含的唯一類型參考數目來衡量類別結合程度。類別結合程度高的符號可能難以維護。建議讓類型與方法的結合程度低而內聚程度高。若要修正此違規，請嘗試重新設計程式碼，減少其結合的類型數目。

# AvoidExcessiveClassCouplingMessage
source: '{0}' is coupled with '{1}' different types from '{2}' different namespaces. Rewrite or refactor the code to decrease its class coupling below '{3}'.
cs: {0} se páruje s {1} různými typy z {2} různých oborů názvů. Přepište nebo refaktorujte kód tak, aby se párování tříd snížilo pod {3}.
de: "{0}" wird mit "{1}" verschiedenen Typen von "{2}" verschiedenen Namespaces verknüpft. Schreiben Sie den Code neu, oder gestalten Sie ihn um, um die Kopplung zwischen Klassen auf einen Wert unter "{3}" zu senken.
es: "{0}" se combina con "{1}" tipos diferentes de "{2}" diferentes espacios de nombres. Reescriba o refactorice el código para disminuir su acoplamiento de clase por debajo de "{3}".
fr: '{0}' est couplé avec des types différents '{1}' d'espaces de noms différents '{2}'. Réécrivez ou refactorisez le code pour baisser son couplage de classe en dessous de '{3}'.
it: '{0}' è accoppiato a '{1}' tipi diversi di '{2}' spazi dei nomi diversi. Riscrivere il codice o effettuarne il refactoring per diminuire gli accoppiamenti di classe sotto '{3}'.
ko: '{0}'이(가) '{2}'개의 다른 네임스페이스에 있는 '{1}'개의 다른 형식과 결합되어 있습니다. 코드를 다시 작성하거나 리팩터링하여 클래스 결합 수준을 '{3}' 이하로 낮추세요.
pt_br: '{0}' está acoplado a tipos diferentes de '{1}' de '{2}' namespaces diferentes. Reescreva ou refatore o código para diminuir o acoplamento abaixo '{3}'.
tr: '{0}', '{2}' farklı ad alanından '{1}' farklı türe bağlı. Kodu yeniden yazarak veya yeniden düzenleyerek sınıf bağlantısını '{3}' düzeyinin altına düşürün.
zh_hant: ‘{0}’ 與 ‘{2}’ 個不同命名空間中 '{1}’ 個不同的類型結合。請重寫或重構程式碼，以將其類別結合程度降低至 ‘{3}’ 以下。

# AvoidExcessiveClassCouplingTitle
source: Avoid excessive class coupling
cs: Vyhněte se nadměrnému párování tříd
de: Übermäßige Klassenkopplungen vermeiden
es: Evite el acoplamiento excesivo de clases
fr: Éviter les couplages de classe excessifs
it: Evita un numero eccessivo di accoppiamenti di classi
ko: 클래스를 지나치게 많이 결합하지 마십시오.
pt_br: Evite o acoplamento de classes em excesso
tr: Aşırı miktarda sınıf bağlantısından kaçının
zh_hant: 避免過度的類別結合

# AvoidExcessiveComplexityDescription
source: Cyclomatic complexity measures the number of linearly independent paths through the method, which is determined by the number and complexity of conditional branches. A low cyclomatic complexity generally indicates a method that is easy to understand, test, and maintain. The cyclomatic complexity is calculated from a control flow graph of the method and is given as follows: `cyclomatic complexity = the number of edges - the number of nodes + 1`, where a node represents a logic branch point and an edge represents a line between nodes.
cs: Cyklomatická složitost měří počet lineárně nezávislých cest přes metodu, který se určuje jako počet a složitost podmíněných větví. Nízká cyklomatická složitost obecně naznačuje, že metodě je snadné porozumět a že se dá snadno testovat a udržovat. Cyklomatická složitost se počítá z grafu toků řízení metody a je daná tímto vztahem: cyklomatická složitost = počet hran − počet uzlů + 1, kde uzel představuje bod logické větve a hrana představuje čáru mezi uzly.
de: Zyklomatische Komplexität misst die Anzahl der linear unabhängigen Pfade über die Methode, die durch die Anzahl und Komplexität der bedingten Verzweigungen festgelegt wird. Eine niedrige zyklomatische Komplexität weist im Allgemeinen auf eine Methode hin, die einfach zu verstehen, zu testen und zu verwalten ist. Die zyklomatische Komplexität wird aus einem Ablaufsteuerungsgraphen der Methode berechnet und wie folgt angegeben: "Zyklomatische Komplexität = Anzahl der Edges – Anzahl der Knoten + 1", wobei ein Knoten für einen logischen Verzweigungspunkt und ein Edge für eine Linie zwischen Knoten steht.
es: La complejidad ciclomática mide el número de rutas de acceso independientes linealmente a través del método, que viene determinado por el número y la complejidad de las ramas condicionales. Una complejidad ciclomática baja indica un método que es fácil de entender, probar y mantener. Dicha complejidad se calcula a partir de un gráfico de flujos de control del método e indica lo siguiente: "complejidad ciclomática = número de bordes - número de nodos + 1", donde un nodo representa un punto de la rama de tipo lógico y un borde representa una línea entre los nodos.
fr: La complexité cyclomatique mesure le nombre de chemins linéairement indépendants dans la méthode, en fonction du nombre et de la complexité des branches conditionnelles. Une faible complexité cyclomatique indique généralement une méthode facile à comprendre, à tester et à tenir à jour. La complexité cyclomatique est calculée à partir d'un graphe de flux de contrôle de la méthode. Elle se présente comme suit : 'complexité cyclomatique = nombre d'arêtes - nombre de nœuds + 1', où un nœud représente un point de branchement logique et une arête représente une ligne entre les nœuds.
it: La complessità ciclomatica misura il numero di percorsi indipendenti in modo lineare nel metodo. Tale numero è determinato dal numero e dalla complessità dei rami condizionali. Una bassa complessità ciclomatica indica in genere un metodo facile da comprendere, testare e gestire. La complessità ciclomatica viene calcolata da un grafico del flusso di controllo del metodo ed è data dalla formula seguente: `complessità ciclomatica = numero di bordi - numero di nodi + 1`, dove un nodo rappresenta un punto ramo logico e un bordo rappresenta una linea tra nodi.
ko: 순환 복잡성은 조건부 분기의 개수 및 복잡성에 따라 결정되는 메서드를 통해 선형 독립 경로 수를 측정합니다. 낮은 순환 복잡성은 일반적으로 이해, 테스트 및 유지 관리하기 쉬운 메서드를 나타냅니다. 순환 종속성은 메서드의 제어 흐름 그래프에서 계산되고 다음과 같이 지정됩니다. '순환 복잡성 = 에지 수 - 노드 수 + 1'. 여기서 노드는 논리 분기 지점을 나타내고 에지는 노드 사이 줄을 나타냅니다.
pt_br: A complexidade ciclomática mede o número de caminhos linearmente independentes no método, que é determinado pelo número e a complexidade dos branches condicionais. Uma complexidade ciclomática baixa geralmente indica um método fácil de entender, testar e manter. Ela é calculada usando um grafo de fluxo de controle do método, da seguinte forma: 'complexidade ciclomática = o número de bordas - o número de nós + 1', em que um nó representa um ponto do branch lógico e uma borda representa uma linha entre os nós.
tr: Döngüsel karmaşıklık, metodun içerdiği doğrusal olarak bağımsız yolların sayısını ölçer. Bu ölçüm koşullu dalların sayısı ve karmaşıklığı ile belirlenir. Düşük döngüsel karmaşıklık genellikle bir metodun anlaşılmasının, test edilmesinin ve bakımının kolay olduğunu gösterir. Döngüsel karmaşıklık, metodun denetim akışı grafiğinden hesaplanır ve şu şekilde verilir: ‘döngüsel karmaşıklık = kenar sayısı – düğüm sayısı + 1’. Burada düğüm bir mantık dalı noktasını, kenar ise düğümler arasındaki bir çizgiyi temsil eder.
zh_hant: 循環複雜度會透過方法來測量線性獨立路徑的數目，而其取決於條件分支的數目及複雜度。循環複雜度較低通常表示方法很容易明瞭、測試及維護。循環複雜度由方法的控制流程圖進行計算，同時假設: '循環複雜度 = 邊緣數目 - 節點數目 + 1'，而節點則代表邏輯分支點，同時邊緣代表節點之間的線條。

# AvoidExcessiveComplexityMessage
source: '{0}' has a cyclomatic complexity of '{1}'. Rewrite or refactor the code to decrease its complexity below '{2}'.
cs: {0} má cyklomatickou složitost na úrovni {1}. Přepište nebo refaktorujte kód tak, aby se složitost snížila pod úroveň {2}.
de: "{0}" weist eine zyklomatische Komplexität von "{1}" auf. Schreiben Sie den Code neu, oder gestalten Sie ihn um, um die Komplexität auf einen Wert unter "{2}" zu senken.
es: "{0}" tiene una complejidad ciclomática de "{1}". Escriba o refactorice el código para reducir su complejidad a continuación "{2}".
fr: '{0}' a une complexité cyclomatique de '{1}'. Réécrivez ou refactorisez le code pour baisser sa complexité en dessous de '{2}'.
it: '{0}' contiene una complessità ciclomatica di '{1}'. Riscrivere il codice o effettuare il refactoring per diminuire la complessità sotto '{2}'.
ko: '{0}'의 순환 복잡성이 '{1}'입니다. 코드를 다시 작성하거나 리펙터링하여 복잡성을 '{2}' 이하로 줄이세요.
pt_br: '{0}' tem uma complexidade ciclomática de '{1}'. Reescreva ou refatore o código para diminuir sua complexidade abaixo de '{2}'.
tr: '{0}', '{1}' düzeyinde döngüsel karmaşıklığa sahip. Kodu yeniden yazarak veya yeniden düzenleyerek karmaşıklığı '{2}' düzeyinin altına düşürün.
zh_hant: ‘{0}’ 的循環複雜度為 ‘{1}’。請重寫或重構程式碼，以將其複雜度降低至 ‘{2}’ 以下。

# AvoidExcessiveComplexityTitle
source: Avoid excessive complexity
cs: Vyhněte se nadměrné složitosti
de: Übermäßige Komplexität vermeiden
es: Evite la excesiva complejidad
fr: Éviter la complexité excessive
it: Evita complessità eccessiva
ko: 지나치게 복잡하게 만들지 마십시오.
pt_br: Evitar complexidade excessiva
tr: Aşırı karmaşıklıktan kaçının
zh_hant: 避免過度複雜

# AvoidExcessiveInheritanceDescription
source: Deeply nested type hierarchies can be difficult to follow, understand, and maintain. This rule limits analysis to hierarchies in the same module. To fix a violation of this rule, derive the type from a base type that is less deep in the inheritance hierarchy or eliminate some of the intermediate base types.
cs: Hluboce vnořené hierarchie typů můžou být složité na sledování, pochopení a údržbu. Toto pravidlo omezuje analýzu na hierarchie ve stejném modulu. Pokud chcete porušení tohoto pravidla opravit, odvoďte typ od základního typu, který je méně hluboko v hierarchii dědičnosti, nebo eliminujte některé z mezilehlých základních typů.
de: Es kann schwierig sein, stark verschachtelte Typhierarchien nachzuverfolgen, nachzuvollziehen und zu verwalten. Diese Regel schränkt Analysen auf Hierarchien im selben Modul ein. Wenn Sie einen Verstoß gegen diese Regel beheben möchten, leiten Sie den Typ von einem Basistypen ab, dessen Vererbungshierarchie weniger stark verschachtelt ist, oder löschen Sie einige der Zwischenbasistypen.
es: Las jerarquías de tipo profundamente anidado pueden ser difíciles de seguir, entender y mantener. Esta regla limita el análisis a las jerarquías en el mismo módulo. Para corregir una infracción de esta regla, derive el tipo de un tipo base que es menos profundo en la jerarquía de herencia o elimine algunos de los tipos base intermedios.
fr: Les hiérarchies de type profondément imbriquées peuvent être difficiles à suivre, comprendre et maintenir. Cette règle limite l'analyse aux hiérarchies d'un même module. Pour corriger une infraction à cette règle, dérivez le type à partir d'un type de base ancré moins profondément dans la hiérarchie héritée ou éliminez des types de base intermédiaires.
it: Le gerarchie dei tipi con molti livelli di nidificazione possono essere difficili da seguire, comprendere e gestire. Questa regola consente di limitare l'analisi alle gerarchie presenti nello stesso modulo. Per correggere una violazione di questa regola, derivare il tipo da un tipo di base che si trova a un livello più superficiale della gerarchia di ereditarietà oppure eliminare alcuni dei tipi di base intermedi.
ko: 계층 구조가 많이 중첩된 형식은 추적, 이해 및 유지 관리하기 어려울 수 있습니다. 이 규칙은 분석을 같은 모듈 내의 계층 구조로 제한합니다. 이 규칙의 위반을 해결하려면 상속 계층 구조에서 수준이 낮은 기본 형식에서 형식을 파생하거나 중간 기본 형식 중 일부를 제거하세요.
pt_br: Hierarquias de tipo profundamente aninhadas podem ser difíceis de seguir, entender e manter. Esta regra limita a análise a hierarquias no mesmo módulo. Para corrigir uma violação desta regra, derive o tipo de um tipo básico menos profundo na hierarquia de herança ou elimine alguns dos tipos básicos intermediários.
tr: Çok fazla iç içe girmiş tür hiyerarşileri izlemeyi, anlamayı ve bakım yapmayı zorlaştırabilir. Bu kural, analizi aynı modül içindeki hiyerarşilerle sınırlı tutar. Bu kuralın ihlal edildiği bir durumu düzeltmek için türü devralınan hiyerarşiden daha az iç içe geçmiş bir hiyerarşiden alın veya ara taban türlerin bir kısmını kaldırın.
zh_hant: 深度巢狀類型階層可能難以遵循、了解及維護。此規則會限制對同一個模組中階層的分析。若要修正違規，請從繼承階層較淺層的基底類型衍生類型，或去除部分中層基底類型。

# AvoidExcessiveInheritanceMessage
source: '{0}' has an object hierarchy '{1}' levels deep within the defining module. If possible, eliminate base classes within the hierarchy to decrease its hierarchy level below '{2}': '{3}'
cs: {0} má hierarchii objektů, která v definujícím modulu dosahuje hloubky {1} úrovní. Pokud je to možné, eliminujte v hierarchii základní třídy tak, aby se počet úrovní v hierarchii snížil pod {2}: {3}
de: "{0}" weist eine "{1}" Ebenen tiefe Objekthierarchie innerhalb des definierenden Moduls auf. Löschen Sie nach Möglichkeit Basisklassen innerhalb der Hierarchie, um die Hierarchiebene auf einen Wert unter "{2}": "{3}" zu senken
es: "{0}" tiene un nivel de jerarquía de objetos "{1}" en el interior del módulo de definición. Si es posible, elimine las clases base dentro de la jerarquía para disminuir su nivel de jerarquía por debajo de "{2}": "{3}"
fr: '{0}' a des niveaux '{1}' de hiérarchie d'objets profondément ancrés dans le module de définition. Si possible, éliminez des classes de base dans la hiérarchie pour baisser le niveau de hiérarchie en dessous de '{2}' : '{3}'
it: '{0}' contiene una gerarchia di oggetti a '{1}' livelli nel modulo che si sta definendo. Se possibile, eliminare le classi base dalla gerarchia per ridurre il livello della gerarchia sotto '{2}': '{3}'
ko: '{0}'의 개체 계층 구조 '{1}' 수준이 정의 모듈 내에서 깊습니다els deep within the defining module. If possible, eliminate base classes within the hierarchy to decrease its hierarchy level below '{2}': '{3}'
pt_br: '{0}' tem uma hierarquia de objetos com '{1}' níveis no módulo de definição. Se possível, elimine as classes base na hierarquia para diminuir seu nível de hierarquia abaixo '{2}': '{3}'
tr: '{0}', tanımlama modülü içinde '{1}' düzey derinliğinde bir nesne hiyerarşisine sahip. Mümkünse hiyerarşideki temel sınıfları ortadan kaldırarak hiyerarşi düzeyini '{2}': '{3}' seviyesinin altına düşürün
zh_hant: ‘{0}’ 的物件階層 ‘{1}’ 層級位於定義模組深層。請盡可能去除階層中的基底類別，以將其階層層級降低至 '{2}': '{3}’ 以下

# AvoidExcessiveInheritanceTitle
source: Avoid excessive inheritance
cs: Vyhněte se nadměrné dědičnosti
de: Übermäßige Vererbung vermeiden
es: Evite una herencia excesiva
fr: Éviter les héritages excessifs
it: Evita ereditarietà eccessiva
ko: 상속성을 너무 많이 사용하지 마십시오.
pt_br: Evitar herança excessiva
tr: Aşırı devralmadan kaçının
zh_hant: 避免過度繼承
