Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.NetCore.Analyzers/Core/Security/xlf/MicrosoftNetCoreSecurityResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr

# ReviewCodeForXamlInjectionVulnerabilitiesTitle
source: Review code for XAML injection vulnerabilities
cs: Zkontrolujte ohrožení zabezpečení injektáží XAML v kódu
de: Code auf Sicherheitsrisiken durch XAML-Einschleusung überprüfen
es: Revisar vulnerabilidades de inyección de XAML en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection XAML
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo XAML injection
ja: コードをレビューし、XAML インジェクションの脆弱性を確認する
ko: 코드에서 XAML 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie kodu XAML
pt_br: Revisão de código quanto a vulnerabilidades de injeção de XAML
ru: Проверьте код на наличие уязвимостей к внедрению кода XAML
tr: Kodu XAML ekleme güvenlik açıkları için inceleyin

# ReviewCodeForXmlInjectionVulnerabilitiesMessage
source: Potential XML injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží XML, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch XML-Einschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" erweitert.
es: Se encontró una vulnerabilidad potencial de inyección de XML en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection XML a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo XML injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な XML インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 XML 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie kodu XML, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de XML, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению кода XML, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası XML ekleme güvenlik açığı bulundu.

# ReviewCodeForXmlInjectionVulnerabilitiesTitle
source: Review code for XML injection vulnerabilities
cs: Zkontrolujte ohrožení zabezpečení injektáží XML v kódu
de: Code auf Sicherheitsrisiken durch XML-Einschleusung überprüfen
es: Revisar vulnerabilidades de inyección de XML en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection XML
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo XML injection
ja: コードをレビューし、XML インジェクションの脆弱性を確認する
ko: 코드에서 XML 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie kodu XML
pt_br: Revisão de código quanto a vulnerabilidades de injeção de XML
ru: Проверьте код на наличие уязвимостей к внедрению кода XML
tr: Kodu XML ekleme güvenlik açıkları için inceleyin

# ReviewCodeForXssVulnerabilitiesMessage
source: Potential cross-site scripting (XSS) vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení skriptováním mezi weby (XSS), kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch XSS (Cross-Site Scripting) gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" erweitert.
es: Se encontró una vulnerabilidad potencial de ataque de scripts de sitios (XSS) en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une faille XSS (scripts intersites) a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo cross-site scripting (XSS) in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的なクロスサイト スクリプト (XSS) の脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 XSS(사이트 간 스크립팅) 취약성이 발견되었습니다.
pl: Wykryto potencjalną lukę umożliwiającą działanie skryptów międzywitrynowych (XSS), gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de XSS (cross-site scripting), em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к межсайтовым сценариям (XSS), где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası siteler arası betik yazma (XSS) güvenlik açığı bulundu.

# ReviewCodeForXssVulnerabilitiesTitle
source: Review code for XSS vulnerabilities
cs: Zkontrolujte ohrožení zabezpečení proti XSS v kódu
de: Code auf Sicherheitsrisiken durch XSS überprüfen
es: Revisar vulnerabilidades de XSS en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées aux failles XSS
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo XSS
ja: コードをレビューし、XSS の脆弱性を確認する
ko: 코드에서 XSS 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających działanie skryptów między witrynami
pt_br: Revisão de código quanto a vulnerabilidades de XSS
ru: Проверьте код на наличие уязвимостей к межсайтовым сценариям (XSS)
tr: Kodu XSS güvenlik açıkları için inceleyin
