Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.NetCore.Analyzers/Core/Security/xlf/MicrosoftNetCoreSecurityResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr

# NetDataContractSerializerDeserializeMaybeWithoutBinderSetTitle
source: Ensure NetDataContractSerializer.Binder is set before deserializing
cs: Před deserializací se ujistěte, že je nastavený NetDataContractSerializer.Binder
de: Vor der Deserialisierung sicherstellen, dass NetDataContractSerializer.Binder festgelegt ist
es: Asegurarse de que NetDataContractSerializer.Binder se ha establecido antes de deserializar
fr: Vérifiez que NetDataContractSerializer.Binder est défini avant d'effectuer la désérialisation
it: Assicurarsi che NetDataContractSerializer.Binder sia impostato prima della deserializzazione
ja: 逆シリアル化の前に NetDataContractSerializer.Binder が設定されていることを確認する
ko: deserialize하기 전에 NetDataContractSerializer.Binder를 설정해야 합니다.
pl: Upewnij się, że właściwość NetDataContractSerializer.Binder jest ustawiona przed deserializacją
pt_br: Verifique se o NetDataContractSerializer.Binder está definido antes de desserializar
ru: Убедитесь, что NetDataContractSerializer.Binder задан перед десериализацией
tr: Seri durumdan çıkarmadan önce NetDataContractSerializer.Binder öğesinin ayarlandığından emin olun

# NetDataContractSerializerDeserializeWithoutBinderSetMessage
source: The method '{0}' is insecure when deserializing untrusted data without a SerializationBinder to restrict the type of objects in the deserialized object graph.
cs: Když se deserializují nedůvěryhodná data bez SerializationBinderu, který omezí typ objektu v grafu deserializovaných objektů, není metoda {0} bezpečná.
de: Die Methode "{0}" ist unsicher, wenn nicht vertrauenswürdige Daten deserialisiert werden, ohne dass der Typ von Objekten im deserialisierten Objektgraphen durch einen SerializationBinder beschränkt wird.
es: El método "{0}" no es seguro al deserializar datos que no son de confianza sin un elemento SerializationBinder para restringir el tipo de objetos en el gráfico de objetos deserializados.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables sans SerializationBinder pour restreindre le type des objets dans le graphe d'objets désérialisés.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili senza un elemento SerializationBinder per limitare il tipo di oggetti nell'oggetto grafico deserializzato.
ja: SerializationBinder なしで信頼されていないデータを逆シリアル化して、逆シリアル化されたオブジェクト グラフ内でオブジェクトの型を制限する場合、メソッド '{0}' は安全ではありません。
ko: deserialize된 개체 그래프에서 개체 형식을 제한하기 위해 SerializationBinder 없이 신뢰할 수 없는 데이터를 deserialize하는 경우 '{0}' 메서드는 안전하지 않습니다.
pl: Metoda „{0}” jest niezabezpieczona podczas deserializowania niezaufanych danych bez użycia elementu SerializationBinder do ograniczenia typu obiektów na wykresie obiektu po deserializacji.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis sem um SerializationBinder para restringir o tipo de objetos no grafo de objeto desserializado.
ru: Метод "{0}" небезопасен при десериализации ненадежных данных без SerializationBinder для ограничения типа объектов в графе десериализованных объектов.
tr: Güvenilmeyen veriler, seri durumdan çıkarılmış nesne grafındaki nesnelerin türünü kısıtlamak için SerializationBinder kullanılmadan seri durumdan çıkarılırken '{0}' metodu güvenli değil.

# NetDataContractSerializerDeserializeWithoutBinderSetTitle
source: Do not deserialize without first setting NetDataContractSerializer.Binder
cs: Nedeserializovat dříve, než se nastaví NetDataContractSerializer.Binder
de: Nicht ohne Festlegung von NetDataContractSerializer.Binder deserialisieren
es: No deserializar sin establecer primero NetDataContractSerializer.Binder
fr: Ne pas effectuer de désérialisation sans avoir défini d'abord NetDataContractSerializer.Binder
it: Non deserializzare senza aver prima impostato NetDataContractSerializer.Binder
ja: NetDataContractSerializer.Binder を設定せずに逆シリアル化しない
ko: 먼저 NetDataContractSerializer.Binder를 설정하지 않고 deserialize하지 마세요.
pl: Nie wykonuj deserializacji bez uprzedniego ustawienia właściwości NetDataContractSerializer.Binder
pt_br: Não desserialize sem primeiro definir NetDataContractSerializer.Binder
ru: Не десериализируйте, не задав предварительно NetDataContractSerializer.Binder
tr: İlk olarak NetDataContractSerializer.Binder öğesini ayarlamadan seri durumdan çıkarmayın

# NetDataContractSerializerMethodUsedDescription
source: The method '{0}' is insecure when deserializing untrusted data. If you need to instead detect NetDataContractSerializer deserialization without a SerializationBinder set, then disable rule CA2310, and enable rules CA2311 and CA2312.
cs: Při deserializaci nedůvěryhodných dat není metoda {0} bezpečná. Pokud místo toho potřebujete zjišťovat deserializaci NetDataContractSerializeru bez nastaveného SerializationBinderu, zakažte pravidlo CA2310 a povolte pravidla CA2311 a CA2312.
de: Die Methode "{0}" ist bei der Deserialisierung nicht vertrauenswürdiger Daten unsicher. Wenn Sie stattdessen die NetDataContractSerializer-Deserialisierung ohne Festlegung von SerializationBinder erkennen müssen, deaktivieren Sie die Regel "CA2310", und aktivieren Sie die Regeln "CA2311" und "CA2312".
es: El método "{0}" no es seguro cuando se deserializan datos que no son de confianza. Si necesita detectar la deserialización de NetDataContractSerializer sin establecer un elemento SerializationBinder, deshabilite la regla CA2310 y habilite las reglas CA2311 y CA2312.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables. Si vous devez plutôt détecter la désérialisation NetDataContractSerializer sans avoir défini SerializationBinder, désactivez la règle CA2310, puis activez les règles CA2311 et CA2312.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili. Se invece è necessario rilevare la deserializzazione di NetDataContractSerializer senza un elemento SerializationBinder impostato, disabilitare la regola CA2310 e abilitare le regole CA2311 e CA2312.
ja: 信頼されていないデータを逆シリアル化する場合、メソッド '{0}' は安全ではありません。代わりに、SerializationBinder が設定されていない NetDataContractSerializer 逆シリアル化を検出する必要がある場合、ルール CA2310 を無効にし、ルール CA2311 と CA2312 を有効にします。
ko: 신뢰할 수 없는 데이터를 deserialize할 경우 '{0}' 메서드는 안전하지 않습니다. SerializationBinder를 설정하지 않고 NetDataContractSerializer deserialization을 검색해야 하는 경우에는 규칙 CA2310을 사용하지 않도록 설정하고 규칙 CA2311 및 CA2312를 사용하도록 설정합니다.
pl: Metoda „{0}” jest niezabezpieczona podczas deserializowania niezaufanych danych. Aby zamiast tego wykryć deserializację klasy NetDataContractSerializer bez ustawionego elementu SerializationBinder, wyłącz regułę CA2310 i włącz reguły CA2311 i CA2312.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis. Se, nesse caso, você precisar detectar a desserialização de NetDataContractSerializer sem um conjunto de SerializationBinder, desabilite a regra CA2310 e habilite as regras CA2311 and CA2312.
ru: Метод "{0}" небезопасен при десериализации ненадежных данных. Если вместо этого нужно обнаружить десериализацию NetDataContractSerializer без задания SerializationBinder, отключите правило CA2310 и включите правила CA2311 и CA2312.
tr: '{0}' metodu güvenilmeyen veriler seri durumdan çıkarılırken güvenli değil. Bunun yerine SerializationBinder ayarlanmadan NetDataContractSerializer seri durumdan çıkarma işlemi algılamanız gerekiyorsa, CA2310 kuralını devre dışı bırakıp CA2311 ve CA2312 kurallarını etkinleştirin.

# NetDataContractSerializerMethodUsedMessage
source: The method '{0}' is insecure when deserializing untrusted data.
cs: Při deserializaci nedůvěryhodných dat není metoda {0} bezpečná.
de: Die Methode "{0}" ist bei der Deserialisierung nicht vertrauenswürdiger Daten unsicher.
es: El método "{0}" no es seguro al deserializar datos que no son de confianza.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili.
ja: 信頼されていないデータを逆シリアル化する場合、メソッド '{0}' は安全ではありません。
ko: 신뢰할 수 없는 데이터를 deserialize하는 경우 '{0}' 메서드는 안전하지 않습니다.
pl: Metoda „{0}” jest niezabezpieczona podczas deserializacji niezaufanych danych.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis.
ru: Метод "{0}" небезопасен при десериализации ненадежных данных.
tr: '{0}' metodu güvenilmeyen veriler seri durumdan çıkarılırken güvenli değil.

# NetDataContractSerializerMethodUsedTitle
source: Do not use insecure deserializer NetDataContractSerializer
cs: Nepoužívat nezabezpečený deserializátor NetDataContractSerializer
de: Nicht den unsicheren NetDataContractSerializer zur Deserialisierung verwenden
es: No usar el deserializador no seguro NetDataContractSerializer
fr: Ne pas utiliser le désérialiseur non sécurisé NetDataContractSerializer
it: Non usare il deserializzatore non sicuro NetDataContractSerializer
ja: 安全でないデシリアライザー NetDataContractSerializer を使用しない
ko: 안전하지 않은 역직렬 변환기 NetDataContractSerializer를 사용하지 마세요.
pl: Nie używaj niezabezpieczonego deserializatora NetDataContractSerializer
pt_br: Não use o desserializador NetDataContractSerializer não seguro
ru: Не используйте небезопасный десериализатор NetDataContractSerializer
tr: Güvenli olmayan seri kaldırıcı NetDataContractSerializer kullanmayın

# ObjectStateFormatterMethodUsedMessage
source: The method '{0}' is insecure when deserializing untrusted data.
cs: Při deserializaci nedůvěryhodných dat není metoda {0} bezpečná.
de: Die Methode "{0}" ist bei der Deserialisierung nicht vertrauenswürdiger Daten unsicher.
es: El método "{0}" no es seguro al deserializar datos que no son de confianza.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili.
ja: 信頼されていないデータを逆シリアル化する場合、メソッド '{0}' は安全ではありません。
ko: 신뢰할 수 없는 데이터를 deserialize하는 경우 '{0}' 메서드는 안전하지 않습니다.
pl: Metoda „{0}” jest niezabezpieczona podczas deserializacji niezaufanych danych.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis.
ru: Метод "{0}" небезопасен при десериализации ненадежных данных.
tr: '{0}' metodu güvenilmeyen veriler seri durumdan çıkarılırken güvenli değil.

# ObjectStateFormatterMethodUsedTitle
source: Do not use insecure deserializer ObjectStateFormatter
cs: Nepoužívat nezabezpečený deserializátor ObjectStateFormatter
de: Nicht den unsicheren ObjectStateFormatter zur Deserialisierung verwenden
es: No usar el deserializador no seguro ObjectStateFormatter
fr: Ne pas utiliser le désérialiseur non sécurisé ObjectStateFormatter
it: Non usare il deserializzatore non sicuro ObjectStateFormatter
ja: 安全でないデシリアライザー ObjectStateFormatter を使用しない
ko: 안전하지 않은 역직렬 변환기 ObjectStateFormatter를 사용하지 마세요.
pl: Nie używaj niezabezpieczonego deserializatora ObjectStateFormatter
pt_br: Não use o desserializador ObjectStateFormatter não seguro
ru: Не используйте небезопасный десериализатор ObjectStateFormatter
tr: Güvenli olmayan seri kaldırıcı ObjectStateFormatter kullanmayın

# ReviewCodeForDllInjectionVulnerabilitiesMessage
source: Potential DLL injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží knihovny DLL, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch DLL-Einschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de inyección de DLL en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection de DLL a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo DLL injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な DLL インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 DLL 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie biblioteki DLL, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de DLL, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению DLL, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası DLL ekleme güvenlik açığı bulundu.

# ReviewCodeForDllInjectionVulnerabilitiesTitle
source: Review code for DLL injection vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení injektáží knihovny DLL v kódu
de: Code auf Sicherheitsrisiken durch DLL-Einschleusung überprüfen
es: Revisar vulnerabilidades de inyección de DLL en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection de DLL
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo DLL injection
ja: コードをレビューし、DLL インジェクションの脆弱性を確認する
ko: 코드에서 DLL 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie biblioteki DLL
pt_br: Revisão de código quanto a vulnerabilidades de injeção de DLL
ru: Проверьте код на наличие уязвимостей к внедрению DLL
tr: Kodu DLL ekleme güvenlik açıkları için inceleyin

# ReviewCodeForFilePathInjectionVulnerabilitiesMessage
source: Potential file path injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží cesty k souboru, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch Dateipfadeinschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de inyección de rutas de acceso de archivos en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection de chemin de fichier a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo file path injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的なファイル パス インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 파일 경로 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie ścieżki pliku, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de caminho, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению пути к файлу, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası dosya yolu ekleme güvenlik açığı bulundu.

# ReviewCodeForFilePathInjectionVulnerabilitiesTitle
source: Review code for file path injection vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení injektáží cesty k souboru v kódu
de: Code auf Sicherheitsrisiken durch Dateipfadeinschleusung überprüfen
es: Revisar vulnerabilidades de inyección de rutas de acceso de archivos en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection de chemin de fichier
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo file path injection
ja: コードをレビューし、ファイル パス インジェクションの脆弱性を確認する
ko: 코드에서 파일 경로 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie ścieżki pliku
pt_br: Revisão de código quanto a vulnerabilidades de injeção de caminho
ru: Проверьте код на наличие уязвимостей к внедрению пути к файлу
tr: Kodu dosya yolu ekleme güvenlik açıkları için inceleyin

# ReviewCodeForInformationDisclosureVulnerabilitiesMessage
source: Potential information disclosure vulnerability was found where '{0}' in method '{1}' may contain unintended information from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení zpřístupněním informací, kde {0} v metodě {1} může neúmyslně obsahovat informace z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch Informationsoffenlegung gefunden. "{0}" in der Methode "{1}" enthält möglicherweise nicht beabsichtigte Informationen aus "{2}" in Methode "{3}".
es: Se encontró una vulnerabilidad potencial de divulgación de información en la que "{0}" en el método "{1}" puede contener información no deseada de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à la divulgation d'informations a été détectée. '{0}' dans la méthode '{1}' peut contenir des informations non souhaitées en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo diffusione di informazioni in cui '{0}' nel metodo '{1}' può contenere informazioni non intenzionali di '{2}' nel metodo '{3}'.
ja: 潜在的な情報漏えいの脆弱性が見つかりました。メソッド '{1}' の '{0}' に、メソッド '{3}' の '{2}' からの意図しない情報が含まれる可能性があります。
ko: '{1}' 메서드의 '{0}'에 '{3}' 메서드에 있는 '{2}'의 의도하지 않은 데이터가 포함될 수 있는 잠재적인 정보 공개 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą ujawnienie informacji, gdzie element „{0}” w metodzie „{1}” może zawierać niezamierzone informacje z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de divulgação não autorizada de informação, em que o '{0}' no método '{1}' pode conter informações não intencionais de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к раскрытию информации, где "{0}" в методе "{1}" может содержать нежелательные сведения из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan istenmeyen bilgileri içeriyor olabileceği, bilgilerin açığa çıkmasına yönelik olası bir güvenlik açığı bulundu.

# ReviewCodeForInformationDisclosureVulnerabilitiesTitle
source: Review code for information disclosure vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení zpřístupněním informací
de: Code auf Sicherheitsrisiken durch Informationsoffenlegung überprüfen
es: Revisar vulnerabilidades de divulgación de información en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une divulgation d'informations
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo diffusione di informazioni
ja: コードをレビューし、情報漏えいの脆弱性を確認する
ko: 코드에서 정보 공개 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających ujawnienie informacji
pt_br: Revisão de código quanto a vulnerabilidades de divulgação não autorizada de informação
ru: Проверьте код на наличие уязвимостей к раскрытию информации
tr: Kodu bilgilerin açığa çıkması güvenlik açıkları için inceleyin

# ReviewCodeForLdapInjectionVulnerabilitiesMessage
source: Potential LDAP injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží protokolu LDAP, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch LDAP-Einschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de inyección de LDAP en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection LDAP a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo LDAP injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な LDAP インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 LDAP 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie protokołu LDAP, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de LDAP, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению LDAP, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası LDAP ekleme güvenlik açığı bulundu.

# ReviewCodeForLdapInjectionVulnerabilitiesTitle
source: Review code for LDAP injection vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení injektáží protokolu LDAP v kódu
de: Code auf Sicherheitsrisiken durch LDAP-Einschleusung überprüfen
es: Revisar vulnerabilidades de inyección de LDAP en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection LDAP
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo LDAP injection
ja: コードをレビューし、LDAP インジェクションの脆弱性を確認する
ko: 코드에서 LDAP 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie protokołu LDAP
pt_br: Revisão de código quanto a vulnerabilidades de injeção de LDAP
ru: Проверьте код на наличие уязвимостей к внедрению LDAP
tr: Kodu LDAP ekleme güvenlik açıkları için inceleyin
