Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.NetCore.Analyzers/Core/Security/xlf/MicrosoftNetCoreSecurityResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr

# ReviewCodeForOpenRedirectVulnerabilitiesMessage
source: Potential open redirect vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení otevřeným přesměrováním, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch offene Umleitung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de redireccionamiento abierto en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une redirection ouverte a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo reindirizzamento aperto in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的なオープン リダイレクトの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 오픈 리디렉션 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą istnienie otwartego przekierowania, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de redirecionamento aberto, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к открытому перенаправлению, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası açık yeniden yönlendirme güvenlik açığı bulundu.

# ReviewCodeForOpenRedirectVulnerabilitiesTitle
source: Review code for open redirect vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení otevřeným přesměrováním
de: Code auf Sicherheitsrisiken durch offene Umleitung überprüfen
es: Revisar vulnerabilidades de redireccionamiento abierto en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une redirection ouverte
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo reindirizzamento aperto
ja: コードをレビューし、オープン リダイレクトの脆弱性を確認する
ko: 코드에서 오픈 리디렉션 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających otwarcie przekierowania
pt_br: Revisão de código quanto a vulnerabilidades de redirecionamento aberto
ru: Проверьте код на наличие уязвимостей к открытому перенаправлению
tr: Kodu açık yeniden yönlendirme güvenlik açıkları için inceleyin

# ReviewCodeForProcessCommandInjectionVulnerabilitiesMessage
source: Potential process command injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží příkazu procesu, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch Prozessbefehlseinschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de inyección de comandos de proceso en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection de commande de processus a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo process command injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的なプロセス コマンド インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 프로세스 명령 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie polecenia procesu, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de comando de processo, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению команд процесса, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası işlem komutu ekleme güvenlik açığı bulundu.

# ReviewCodeForProcessCommandInjectionVulnerabilitiesTitle
source: Review code for process command injection vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení injektáží příkazu procesu v kódu
de: Code auf Sicherheitsrisiken durch Prozessbefehlseinschleusung überprüfen
es: Revisar vulnerabilidades de inyección de comandos de proceso en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection de commande de processus
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo process command injection
ja: コードをレビューし、プロセス コマンド インジェクションの脆弱性を確認する
ko: 코드에서 프로세스 명령 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie polecenia procesu
pt_br: Revisão de código quanto a vulnerabilidades de injeção de comando de processo
ru: Проверьте код на наличие уязвимостей к внедрению команд процесса
tr: Kodu işlem komutu ekleme güvenlik açıkları için inceleyin

# ReviewCodeForRegexInjectionVulnerabilitiesMessage
source: Potential regex injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží regulárního výrazu, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch Einschleusung regulärer Ausdrücke gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de inyección de expresiones regulares en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection regex a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo regex injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な正規表現インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 regex 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie wyrażenia regularnego, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de regex, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению регулярных выражений, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası normal ifade ekleme güvenlik açığı bulundu.

# ReviewCodeForRegexInjectionVulnerabilitiesTitle
source: Review code for regex injection vulnerabilities
cs: Zkontrolovat ohrožení zabezpečení injektáží regulárního výrazu v kódu
de: Code auf Sicherheitsrisiken durch Einschleusung regulärer Ausdrücke überprüfen
es: Revisar vulnerabilidades de inyección de expresiones regulares en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection regex
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo regex injection
ja: コードをレビューし、正規表現インジェクションの脆弱性を確認する
ko: 코드에서 regex 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie wyrażenia regularnego
pt_br: Revisão de código quanto a vulnerabilidades de injeção de regex
ru: Проверьте код на наличие уязвимостей к внедрению регулярных выражений
tr: Kodu normal ifade ekleme güvenlik açıkları için inceleyin

# ReviewCodeForSqlInjectionVulnerabilitiesMessage
source: Potential SQL injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží SQL, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch Einschleusung von SQL-Befehlen gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" verändert.
es: Se encontró una vulnerabilidad potencial de inyección de SQL en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection de code SQL a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo SQL injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な SQL インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 SQL 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie kodu SQL, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de SQL, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению кода SQL, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası SQL ekleme güvenlik açığı bulundu.

# ReviewCodeForSqlInjectionVulnerabilitiesTitle
source: Review code for SQL injection vulnerabilities
cs: Zkontrolujte ohrožení zabezpečení injektáží SQL v kódu
de: Code auf Sicherheitsrisiken durch Einschleusung von SQL-Befehlen überprüfen
es: Revisar vulnerabilidades de inyección de SQL en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection de code SQL
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo SQL injection
ja: コードをレビューし、SQL インジェクションの脆弱性を確認する
ko: 코드에서 SQL 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie kodu SQL
pt_br: Revisão de código quanto a vulnerabilidades de injeção de SQL
ru: Проверьте код на наличие уязвимостей к внедрению кода SQL
tr: Kodu SQL ekleme güvenlik açıkları için inceleyin

# BinaryFormatterDeserializeMaybeWithoutBinderSetMessage
source: The method '{0}' is insecure when deserializing untrusted data without a SerializationBinder to restrict the type of objects in the deserialized object graph.
cs: Když se deserializují nedůvěryhodná data bez SerializationBinderu, který omezí typ objektu v grafu deserializovaných objektů, není metoda {0} bezpečná.
de: Die Methode "{0}" ist unsicher, wenn nicht vertrauenswürdige Daten deserialisiert werden, ohne dass der Typ von Objekten im deserialisierten Objektgraphen durch einen SerializationBinder beschränkt wird.
es: El método "{0}" no es seguro al deserializar datos que no son de confianza sin un elemento SerializationBinder para restringir el tipo de objetos en el gráfico de objetos deserializados.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables sans SerializationBinder pour restreindre le type des objets dans le graphe d'objets désérialisés.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili senza un elemento SerializationBinder per limitare il tipo di oggetti nell'oggetto grafico deserializzato.
ja: SerializationBinder なしで信頼されていないデータを逆シリアル化して、逆シリアル化されたオブジェクト グラフ内でオブジェクトの型を制限する場合、メソッド '{0}' は安全ではありません。
ko: deserialize된 개체 그래프에서 개체 형식을 제한하기 위해 SerializationBinder 없이 신뢰할 수 없는 데이터를 deserialize하는 경우 '{0}' 메서드는 안전하지 않습니다.
pl: Metoda „{0}” jest niezabezpieczona podczas deserializowania niezaufanych danych bez użycia elementu SerializationBinder do ograniczenia typu obiektów na wykresie obiektu po deserializacji.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis sem um SerializationBinder para restringir o tipo de objetos no grafo de objeto desserializado.
ru: Метод "{0}" небезопасен при десериализации ненадежных данных без SerializationBinder для ограничения типа объектов в графе десериализованных объектов.
tr: Güvenilmeyen veriler, seri durumdan çıkarılmış nesne grafındaki nesnelerin türünü kısıtlamak için SerializationBinder kullanılmadan seri durumdan çıkarılırken '{0}' metodu güvenli değil.

# BinaryFormatterDeserializeMaybeWithoutBinderSetTitle
source: Ensure BinaryFormatter.Binder is set before calling BinaryFormatter.Deserialize
cs: Než zavoláte BinaryFormatter.Deserialize, ujistěte se, že je nastavený BinaryFormatter.Binder
de: Festlegung von BinaryFormatter.Binder vor dem Aufruf von BinaryFormatter.Deserialize sicherstellen
es: Asegurarse de que BinaryFormatter.Binder se ha establecido antes de llamar a BinaryFormatter.Deserialize
fr: Vérifiez que BinaryFormatter.Binder est défini avant d'appeler BinaryFormatter.Deserialize
it: Assicurarsi che BinaryFormatter.Binder sia impostato prima di chiamare BinaryFormatter.Deserialize
ja: BinaryFormatter.Deserialize を呼び出す前に BinaryFormatter.Binder が設定されていることを確認する
ko: BinaryFormatter.Deserialize를 호출하기 전에 BinaryFormatter.Binder를 설정해야 합니다.
pl: Upewnij się, że właściwość BinaryFormatter.Binder jest ustawiona przed wywołaniem metody BinaryFormatter.Deserialize
pt_br: Verifique se o BinaryFormatter.Binder está definido antes de chamar o BinaryFormatter.Deserialize
ru: Убедитесь, что BinaryFormatter.Binder задан перед вызовом BinaryFormatter.Deserialize
tr: BinaryFormatter.Deserialize çağırmadan önce BinaryFormatter.Binder öğesinin ayarlandığından emin olun

# BinaryFormatterDeserializeWithoutBinderSetMessage
source: The method '{0}' is insecure when deserializing untrusted data without a SerializationBinder to restrict the type of objects in the deserialized object graph.
cs: Když se deserializují nedůvěryhodná data bez SerializationBinderu, který omezí typ objektu v grafu deserializovaných objektů, není metoda {0} bezpečná.
de: Die Methode "{0}" ist unsicher, wenn nicht vertrauenswürdige Daten deserialisiert werden, ohne dass der Typ von Objekten im deserialisierten Objektgraphen durch einen SerializationBinder beschränkt wird.
es: El método "{0}" no es seguro al deserializar datos que no son de confianza sin un elemento SerializationBinder para restringir el tipo de objetos en el gráfico de objetos deserializados.
fr: La méthode '{0}' n'est pas sécurisée durant la désérialisation de données non fiables sans SerializationBinder pour restreindre le type des objets dans le graphe d'objets désérialisés.
it: Il metodo '{0}' non è sicuro quando si deserializzano dati non attendibili senza un elemento SerializationBinder per limitare il tipo di oggetti nell'oggetto grafico deserializzato.
ja: SerializationBinder なしで信頼されていないデータを逆シリアル化して、逆シリアル化されたオブジェクト グラフ内でオブジェクトの型を制限する場合、メソッド '{0}' は安全ではありません。
ko: deserialize된 개체 그래프에서 개체 형식을 제한하기 위해 SerializationBinder 없이 신뢰할 수 없는 데이터를 deserialize하는 경우 '{0}' 메서드는 안전하지 않습니다.
pl: Metoda „{0}” jest niezabezpieczona podczas deserializowania niezaufanych danych bez użycia elementu SerializationBinder do ograniczenia typu obiektów na wykresie obiektu po deserializacji.
pt_br: O método '{0}' não é seguro durante a desserialização de dados não confiáveis sem um SerializationBinder para restringir o tipo de objetos no grafo de objeto desserializado.
ru: Метод "{0}" небезопасен при десериализации ненадежных данных без SerializationBinder для ограничения типа объектов в графе десериализованных объектов.
tr: Güvenilmeyen veriler, seri durumdan çıkarılmış nesne grafındaki nesnelerin türünü kısıtlamak için SerializationBinder kullanılmadan seri durumdan çıkarılırken '{0}' metodu güvenli değil.

# BinaryFormatterDeserializeWithoutBinderSetTitle
source: Do not call BinaryFormatter.Deserialize without first setting BinaryFormatter.Binder
cs: Nevolat BinaryFormatter.Deserialize dříve, než se nastaví BinaryFormatter.Binder
de: BinaryFormatter.Deserialize nicht ohne Festlegung von BinaryFormatter.Binder aufrufen
es: No llame a BinaryFormatter.Deserialize sin establecer primero BinaryFormatter.Binder
fr: N'appelez pas BinaryFormatter.Deserialize sans avoir défini d'abord BinaryFormatter.Binder
it: Non chiamare BinaryFormatter.Deserialize senza aver prima impostato BinaryFormatter.Binder
ja: BinaryFormatter.Binder を設定せずに BinaryFormatter.Deserialize を呼び出さない
ko: 먼저 BinaryFormatter.Binder를 설정하지 않고 BinaryFormatter.Deserialize를 호출하지 마세요.
pl: Nie wywołuj metody BinaryFormatter.Deserialize bez uprzedniego ustawienia właściwości BinaryFormatter.Binder
pt_br: Não chame BinaryFormatter.Deserialize sem primeiro definir BinaryFormatter.Binder
ru: Не вызывайте BinaryFormatter.Deserialize, не задав предварительно BinaryFormatter.Binder
tr: İlk olarak BinaryFormatter.Binder öğesini ayarlamadan önce BinaryFormatter.Deserialize çağırmayın

# ReviewCodeForXPathInjectionVulnerabilitiesMessage
source: Potential XPath injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží XPath, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch XPath-Einschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" erweitert.
es: Se encontró una vulnerabilidad potencial de inyección de XPath en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection XPath a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo XPath injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な XPath インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 XPath 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie wyrażenia XPath, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de XPath, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению кода XPath, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası XPath ekleme güvenlik açığı bulundu.

# ReviewCodeForXPathInjectionVulnerabilitiesTitle
source: Review code for XPath injection vulnerabilities
cs: Zkontrolujte ohrožení zabezpečení injektáží XPath v kódu
de: Code auf Sicherheitsrisiken durch XPath-Einschleusung überprüfen
es: Revisar vulnerabilidades de inyección de XPath en el código
fr: Effectuer une revue du code pour détecter les vulnérabilités liées à une injection XPath
it: Esaminare il codice per verificare la presenza di vulnerabilità di tipo XPath injection
ja: コードをレビューし、XPath インジェクションの脆弱性を確認する
ko: 코드에서 XPath 삽입 취약성 검토
pl: Przegląd kodu pod kątem luk umożliwiających wstrzyknięcie wyrażenia XPath
pt_br: Revisão de código quanto a vulnerabilidades de injeção de XPath
ru: Проверьте код на наличие уязвимостей к внедрению кода XPath
tr: Kodu XPath ekleme güvenlik açıkları için inceleyin

# ReviewCodeForXamlInjectionVulnerabilitiesMessage
source: Potential XAML injection vulnerability was found where '{0}' in method '{1}' may be tainted by user-controlled data from '{2}' in method '{3}'.
cs: Našlo se potenciální ohrožení zabezpečení injektáží XAML, kde {0} v metodě {1} je možné poškodit uživatelem řízenými daty z {2} v metodě {3}.
de: Es wurde ein potenzielles Sicherheitsrisiko durch XAML-Einschleusung gefunden. "{0}" in der Methode "{1}" wurde möglicherweise durch benutzergesteuerte Daten aus "{2}" in Methode "{3}" erweitert.
es: Se encontró una vulnerabilidad potencial de inyección de XAML en la que "{0}" en el método "{1}" puede contaminarse por datos controlados por el usuario de "{2}" en el método "{3}".
fr: Une vulnérabilité potentielle liée à une injection XAML a été détectée. '{0}' dans la méthode '{1}' peut être altéré par des données contrôlées par l'utilisateur en provenance de '{2}' dans la méthode '{3}'.
it: È stata trovata una potenziale vulnerabilità di tipo XAML injection in cui '{0}' nel metodo '{1}' può essere contaminato da dati controllati dall'utente di '{2}' nel metodo '{3}'.
ja: 潜在的な XAML インジェクションの脆弱性が見つかりました。メソッド '{1}' の '{0}' は、メソッド '{3}' の '{2}' からのユーザーが制御するデータによって悪用される可能性があります。
ko: '{1}' 메서드의 '{0}'이(가) '{3}' 메서드의 '{2}'에서 사용자 제어 데이터에 의해 감염될 수 있는 잠재적인 XAML 삽입 취약성이 발견되었습니다.
pl: Znaleziono potencjalną lukę umożliwiającą wstrzyknięcie kodu XAML, gdzie element „{0}” w metodzie „{1}” może zostać zanieczyszczony danymi kontrolowanymi przez użytkownika z elementu „{2}” w metodzie „{3}”.
pt_br: Foi encontrada uma possível vulnerabilidade de injeção de XAML, em que o '{0}' no método '{1}' pode ter sido afetado pelos dados controlados pelo usuário de '{2}' no método '{3}'.
ru: Обнаружена потенциальная уязвимость к внедрению кода XAML, где "{0}" в методе "{1}" может быть испорчен пользовательскими данными из "{2}" в методе "{3}".
tr: '{1}' metodundaki '{0}' öğesinin '{3}' metodundaki '{2}' öğesinde bulunan kullanıcı denetimindeki veriler nedeniyle zarar görmüş olabileceği bir olası XAML ekleme güvenlik açığı bulundu.
