Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.NetCore.Analyzers/Core/Security/xlf/SystemSecurityCryptographyResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# UseSharedAccessProtocolHttpsOnlyMessage
source: Consider using Azure's role-based access control instead of a Shared Access Signature (SAS) if possible. If you still need to use a SAS, specify SharedAccessProtocol.HttpsOnly
cs: Pokud je to možné, zvažte použití řízení přístupu Azure na základě role namísto sdíleného přístupového podpisu (SAS). Pokud i přesto potřebujete používat sdílený přístupový podpis, zadejte SharedAccessProtocol.HttpsOnly.
de: Erwägen Sie (sofern möglich) die Verwendung der rollenbasierten Zugriffssteuerung von Azure anstelle einer Shared Access Signature (SAS). Wenn Sie weiterhin eine SAS benötigen, verwenden Sie SharedAccessProtocol.HttpsOnly.
es: Considere la posibilidad de usar el control de acceso basado en rol de Azure en lugar de una firma de acceso compartido (SAS), si es posible. Si tiene que usar una firma de acceso compartido, especifique SharedAccessProtocol.HttpsOnly.
fr: Si possible, utilisez la fonctionnalité RBAC (contrôle d'accès en fonction du rôle) d'Azure à la place d'une SAP (signature d'accès partagé). Si vous devez quand même utiliser une SAP, spécifiez SharedAccessProtocol.HttpsOnly
it: Se possibile, provare a usare il controllo degli accessi in base al ruolo di Azure, invece della firma di accesso condiviso. Se è necessario usare una firma di accesso condiviso, specificare SharedAccessProtocol.HttpsOnly
ja: 可能な場合は、Shared Access Signature (SAS) の代わりに、Azure のロールベースのアクセス制御を使用することを検討してください。依然として SAS を使用する必要がある場合は、SharedAccessProtocol を指定します。 HttpsOnly
ko: 가능한 경우 SAS(공유 액세스 서명) 대신 Azure의 역할 기반 액세스 제어를 사용하세요. 계속 SAS를 사용해야 할 경우 SharedAccessProtocol.HttpsOnly를 지정하세요.
pl: Jeśli to możliwe, rozważ użycie kontroli dostępu opartej na rolach platformy Azure zamiast sygnatury dostępu współdzielonego (SAS). Jeśli nadal chcesz używać sygnatury SAS, określ właściwość SharedAccessProtocol.HttpsOnly
pt_br: Se possível, considere usar o controle de acesso baseado em função do Azure em vez de uma SAS (Assinatura de Acesso Compartilhado). Se você ainda precisar usar uma SAS, especifique SharedAccessProtocol.HttpsOnly
ru: Если возможно, попробуйте использовать управление доступом на основе ролей Azure, а не подписанный URL-адрес (SAS). Если все-таки требуется использовать SAS, укажите SharedAccessProtocol.HttpsOnly.
tr: Mümkünse Paylaşılan Erişim İmzası (SAS) yerine Azure'un rol tabanlı erişim denetimini kullanmayı düşünün. Yine de SAS kullanmanız gerekiyorsa, SharedAccessProtocol.HttpsOnly belirtin
zh_hans: 如果可能，请考虑使用 Azure 基于角色的访问控制，而不是共享访问签名(SAS)。如果仍需使用 SAS，请指定 SharedAccessProtocol.HttpsOnly
zh_hant: 如果可行的話，請考慮從共用存取簽章 (SAS) 改為使用 Azure 的角色型存取控制。如果您仍需要使用 SAS，請指定 SharedAccessProtocol.HttpsOnly

# UseXmlReaderDescription
source: Processing XML from untrusted data may load dangerous external references, which should be restricted by using an XmlReader with a secure resolver or with DTD processing disabled.
cs: Zpracování kódu XML z nedůvěryhodných dat může načíst nebezpečné externí odkazy, což by se mělo omezit tím, že se použije XmlReader se zabezpečeným překladačem nebo se zakázaným zpracováním DTD.
de: Durch das Verarbeiten von XML aus nicht vertrauenswürdigen Daten werden möglicherweise gefährliche externe Verweise geladen, die mithilfe eines XmlReaders mit sicherem Konfliktlöser oder mit deaktivierter DTD-Verarbeitung eingeschränkt werden müssen.
es: Al procesar el código XML desde datos en los que no se confía, se pueden cargar referencias externas peligrosas, que se deben restringir usando un objeto XmlReader con una resolución segura o con el procesamiento de DTD deshabilitado.
fr: Le traitement XML à partir de données non fiables peut entraîner le chargement de références externes dangereuses. Vous devez limiter ce risque en utilisant un XmlReader avec un programme de résolution sécurisé ou avec une désactivation du traitement DTD.
it: Quando si carica codice XML da dati non attendibili, potrebbero essere caricati riferimenti esterni pericolosi, che devono essere limitati usando un elemento XmlReader con un resolver sicuro oppure disabilitando l'elaborazione DTD.
ja: 信頼されていないデータから XML を処理すると、危険な外部参照を読み込む可能性があります。XmlReader を安全なリゾルバーと共に使用するか、DTD 処理を無効にして使用することにより、この処理を制限する必要があります。
ko: 신뢰할 수 없는 데이터의 XML을 처리하면 위험한 외부 참조가 로드될 수 있습니다. 위험한 외부 참조는 안전한 확인자와 함께 또는 DTD 처리를 사용하지 않도록 설정한 상태로 XmlReader를 사용하여 제한해야 합니다.
pl: Przetwarzanie pliku XML na podstawie niezaufanych danych może spowodować załadowanie niebezpiecznych odwołań zewnętrznych, które powinny zostać ograniczone za pomocą czytnika XmlReader z bezpiecznym programem rozpoznawania nazw lub wyłączonym przetwarzaniem elementów DTD.
pt_br: O processamento de XML de dados não confiáveis pode carregar referências externas perigosas, que devem ser restritas usando um XmlReader com um resolvedor seguro ou com o processamento de DTD desabilitado.
ru: Обработка XML-кода из ненадежных данных может привести к загрузке опасных внешних ссылок, что следует ограничить, используя XmlReader с безопасным сопоставителем или отключив обработку DTD.
tr: Güvenilmeyen verilerden XML işlenirse tehlikeli dış başvurular yüklenebilir. Bunun, güvenli bir çözümleyicisi olan bir XmlReader kullanılarak veya DTD işleme devre dışı bırakılarak kısıtlanması gerekir.
zh_hans: 从不受信任的数据处理 XML 可能会加载危险的外部引用，这应该通过使用带有安全解析程序的 XmlReader 或禁用 DTD 处理来限制。
zh_hant: 處理不受信任資料的 XML，可能會載入危險的外部參考，應使用具有安全解析程式或已停用 DTD 處理的 XmlReader，加以限制。

source: Use XmlReader For DataSet Read Xml
cs: Použít XmlReader pro DataSet Read Xml
de: XmlReader zum Lesen von DataSet-XML verwenden
es: Utilizar XmlReader para el XML de lectura de DataSet
fr: Utiliser XmlReader pour la lecture des données XML d'un jeu de données
it: Usa XmlReader per il codice XML di lettura del set di dati
ja: DataSet Read Xml に XmlReader を使用する
ko: 데이터 세트 읽기 Xml에 XmlReader 사용
pl: Użyj czytnika XmlReader na potrzeby pliku XML odczytu zestawu danych
pt_br: Usar XmlReader para XML da Leitura do Conjunto de Dados
ru: Использовать XmlReader для чтения XML из набора данных
tr: DataSet Xml'i Okuma için XmlReader kullan
zh_hans: 将 XmlReader 用于数据集读取 Xml
zh_hant: 請為讀取資料集 XML 使用 XmlReader

source: Use XmlReader For Deserialize
cs: Použít XmlReader pro Deserialize
de: XmlReader zum Deserialisieren verwenden
es: Utilizar XmlReader para la deserialización
fr: Utiliser XmlReader pour la désérialisation
it: Usa XmlReader per la deserializzazione
ja: 逆シリアル化に XmlReader を使用する
ko: Deserialize에 XmlReader 사용
pl: Użyj czytnika XmlReader do deserializacji
pt_br: Usar XmlReader para Desserializar
ru: Использовать XmlReader для десериализации
tr: Seri Halden Çıkarma için XmlReader kullan
zh_hans: 将 XmlReader 用于反序列化
zh_hant: 請為還原序列化使用 XmlReader

source: Use XmlReader For Schema Read
cs: Použít XmlReader pro Schema Read
de: XmlReader zum Lesen von Schemas verwenden
es: Utilizar XmlReader para la lectura de esquema
fr: Utiliser XmlReader pour la lecture d'un schéma
it: Usa XmlReader per la lettura dello schema
ja: スキーマの読み取りに XmlReader を使用する
ko: 스키마 읽기에 XmlReader 사용
pl: Użyj czytnika XmlReader do odczytu schematu
pt_br: Usar XmlReader para Leitura de Esquema
ru: Использовать XmlReader для чтения схемы
tr: Şema Okuma için XmlReader kullan
zh_hans: 将 XmlReader 用于架构读取
zh_hant: 請為讀取結構描述使用 XmlReader

source: Use XmlReader For Validating Reader
cs: Použít XmlReader pro Validating Reader
de: XmlReader zum Überprüfen von Reader verwenden
es: Utilizar XmlReader para el lector de validación
fr: Utiliser XmlReader pour la validation d'un lecteur
it: Usare XmlReader per la convalida del lettore
ja: リーダーの検証に XmlReader を使用する
ko: 판독기 유효성 검사에 XmlReader 사용
pl: Użyj czytnika XmlReader do weryfikacji czytnika
pt_br: Usar XmlReader para Validar Leitor
ru: Использовать XmlReader для проверяющего модуля чтения
tr: Okuyucuyu Doğrulamak için XmlReader kullan
zh_hans: 将 XmlReader 用于验证读取器
zh_hant: 請為驗證讀取器使用 XmlReader

source: Use XmlReader For XPathDocument
cs: Použít XmlReader pro XPathDocument
de: XmlReader für XPathDocument verwenden
es: Utilizar XmlReader para XPathDocument
fr: Utiliser XmlReader pour XPathDocument
it: Usa XmlReader per XPathDocument
ja: XPathDocument に XmlReader を使用する
ko: XPathDocument에 XmlReader 사용
pl: Użyj czytnika XmlReader na potrzeby elementu XPathDocument
pt_br: Usar XmlReader para XPathDocument
ru: Использовать XmlReader для XPathDocument
tr: XPathDocument için XmlReader kullan
zh_hans: 将 XmlReader 用于 XPathDocument
zh_hant: 請為 XPathDocument 使用 XmlReader

# UseXmlReaderMessage
source: This overload of the {0}.{1} method is potentially unsafe, use an overload that takes a XmlReader instance instead
cs: Toto přetížení metody {0}.{1} nemusí být bezpečné. Použijte raději přetížení, které přijímá instanci XmlReader.
de: Diese Überladung der {0}.{1}-Methode ist möglicherweise unsicher. Verwenden Sie eine Überladung, die stattdessen eine XmlReader-Instanz akzeptiert.
es: Esta sobrecarga del método {0}.{1} no es potencialmente segura. Use en su lugar una sobrecarga que tome una instancia de XmlReader
fr: Cette surcharge de la méthode {0}.{1} est potentiellement non sécurisée. Utilisez une surcharge qui accepte une instance de XmlReader à la place
it: Questo overload del metodo {0}.{1} è potenzialmente insicuro. In alternativa usare un overload che accetta un'istanza di XmlReader
ja: {0}.{1} メソッドのこのオーバーロードは、安全ではない可能性があります。代わりに XmlReader インスタンスを使用するオーバーロードを使用してください
ko: {0}.{1} 메서드의 이 오버로드는 안전하지 않을 수 있으므로 대신 XmlReader 인스턴스를 사용하는 오버로드를 사용하세요.
pl: Przeciążenie metody {0}.{1} jest potencjalnie niebezpieczne. Zamiast tego użyj przeciążenia przyjmującego wystąpienie czytnika XmlReader
pt_br: Esta sobrecarga do método {0}.{1} é potencialmente insegura. Use uma sobrecarga que utiliza uma instância de XmlReader
ru: Эта перегрузка метода {0}.{1} потенциально небезопасна, используйте вместо этого перегрузку, которая принимает экземпляр XmlReader
tr: {0}.{1} yönteminin bu aşırı yüklemesi güvenli olmayabilir. Bunun yerine bir XmlReader örneğini alan bir aşırı yükleme kullanın
zh_hans: {0}.{1} 方法的此重载可能不安全，请改为使用带有 XmlReader 实例的重载
zh_hant: {0}.{1} 方法的此多載有可能不安全，請改為使用接受 XmlReader 執行個體的多載
