Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.NetCore.Analyzers/Core/Security/xlf/SystemSecurityCryptographyResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# ApprovedCipherMode
source: Do Not Use Unsafe Cipher Modes
cs: Nepoužívat nezabezpečené režimy šifrování
de: Verwenden Sie keine unsicheren Verschlüsselungsmodi.
es: No utilice modos de cifrado inseguro
fr: Ne pas utiliser de modes de chiffrement non sécurisés
it: Non usare modalità crittografia non sicure
ja: 安全ではない暗号モードを使用しないでください。
ko: 안전하지 않은 암호화 모드를 사용하지 마세요.
pl: Nie używaj niebezpiecznych trybów szyfrowania
pt_br: Não Usar Modos de Criptografia Inseguros
ru: Не использовать небезопасные режимы шифрования
tr: Güvenli olmayan şifreleme modlarını kullanmayın
zh_hans: 请勿使用不安全的密码模式
zh_hant: 不要使用不安全的 Cipher 模式

# ApprovedCipherModeDescription
source: These modes are vulnerable to attacks. Use only approved modes (CBC, CTS).
cs: Tyto režimy jsou zranitelné vůči útokům. Používejte jenom schválené režimy (CBC, CTS).
de: Diese Modi sind für Angriffe anfällig. Verwenden Sie nur zugelassene Modi (CBC, CTS).
es: Estos modos son vulnerables a ataques. Use solo modos aprobados (CBC, CTS).
fr: Ces modes sont vulnérables aux attaques. Utilisez uniquement des modes approuvés (CBC, CTS).
it: Queste modalità sono vulnerabili agli attacchi. Usare solo modalità approvate (CBC, CTS).
ja: これらのモードは、攻撃に対して脆弱です。承認されたモード (CBC、CTS) のみを使用してください。
ko: 이러한 모드는 공격에 취약합니다. 승인된 모드(CBC, CTS)만 사용하세요.
pl: Te tryby są podatne na ataki. Używaj jedynie zatwierdzonych trybów (CBC, CTS).
pt_br: Esses modos são vulneráveis a ataques. Use somente modos aprovados (CBC, CTS).
ru: Эти режимы являются уязвимыми для атак. Используйте только утвержденные режимы (CBC, CTS).
tr: Bu modlar saldırılara açıktır. Yalnızca onaylı modları (CBC, CTS) kullanın.
zh_hans: 这些模式容易受到攻击。请只使用批准的模式（CBC，CTS）。
zh_hant: 這些模式容易受到攻擊。請只使用經過核准的模式 (CBC，CTS)。

# ApprovedCipherModeMessage
source: It uses an unsafe Cipher Mode {0}
cs: Používá nezabezpečený režim šifrování {0}
de: Ein unsicherer Verschlüsselungsmodus ({0}) wird verwendet.
es: Utiliza un modo de cifrado inseguro {0}
fr: Utilise un mode de chiffrement non sécurisé {0}
it: Usa una modalità crittografia non sicura {0}
ja: 安全ではない暗号モード {0} を使用します
ko: 안전하지 않은 암호화 모드 {0}을(를) 사용합니다.
pl: Używa niebezpiecznego trybu szyfrowania {0}
pt_br: Ele usa um Modo de Criptografia inseguro {0}
ru: Он использует небезопасный режим шифрования {0}
tr: Güvenli olmayan {0} Şifreleme Modunu kullanıyor
zh_hans: 它使用不安全的密码模式 {0} .
zh_hant: 它會使用不安全的 Cipher 模式 {0}

# DefinitelyInstallRootCert
source: Do Not Add Certificates To Root Store
cs: Nepřidávat certifikáty do kořenového úložiště
de: Zertifikate nicht zum Stammspeicher hinzufügen
es: No agregar certificados al almacén raíz
fr: Ne pas ajouter de certificats au magasin racine
it: Non aggiungere certificati all'archivio radice
ja: ルート ストアに証明書を追加しない
ko: 루트 저장소에 인증서 추가 안 함
pl: Nie dodawaj certyfikatów do magazynu głównego
pt_br: Não Adicione Certificados Ao Armazenamento Raiz
ru: Не добавлять сертификаты в корневое хранилище
tr: Sertifikaları Kök Depoya Ekleme
zh_hans: 不将证书添加到根存储
zh_hant: 請勿將憑證新增至根存放區

# DefinitelyInstallRootCertMessage
source: Adding certificates to the operating system's trusted root certificates increases the risk of incorrectly authenticating an illegitimate certificate
cs: Když se certifikáty přidají mezi důvěryhodné kořenové certifikáty operačního systému, zvýší se riziko, že se nesprávně ověří nelegitimní certifikát.
de: Durch das Hinzufügen von Zertifikaten zu den vertrauenswürdigen Stammzertifikaten des Betriebssystems erhöht sich das Risiko, dass ein unzulässiges Zertifikat fälschlicherweise authentifiziert wird.
es: La adición de certificados a los certificados raíz de confianza del sistema operativo aumenta el riesgo de autenticar incorrectamente un certificado ilegítimo
fr: L'ajout de certificats aux certificats racines approuvés du système d'exploitation augmente le risque d'authentification incorrecte d'un certificat illégitime
it: L'aggiunta di certificati a certificati radice attendibili del sistema operativo aumenta il rischio di autenticazione non corretta di un certificato illegittimo
ja: オペレーティング システムの信頼されたルート証明書に証明書を追加すると、不正な証明書を誤って認証するリスクが高くなります
ko: 운영 체제의 신뢰할 수 있는 루트 인증서에 인증서를 추가하면 불법 인증서를 잘못 인증하게 될 위험이 늘어납니다.
pl: Dodanie certyfikatów do zaufanych certyfikatów głównych systemu operacyjnego zwiększa ryzyko niepoprawnego uwierzytelniania nieuprawnionego certyfikatu
pt_br: A adição de certificados aos certificados raiz confiáveis do sistema operacional aumenta o risco de autenticar incorretamente um certificado ilegítimo
ru: Добавление сертификатов в доверенные корневые сертификаты операционной системы увеличивает риск неправильной проверки подлинности сертификатов
tr: Sertifikaların, işletim sisteminin güvenilen kök sertifikalarına eklenmesi, geçerli olmayan bir sertifikanın hatalı bir şekilde kimliğinin doğrulanması riskini artırır
zh_hans: 如果将证书添加到操作系统受信任的根证书中，则会增加非法证书验证不当的风险
zh_hant: 將憑證新增至作業系統的受信任根憑證，會增加驗證非法憑證不正確的風險

# DefinitelyUseSecureCookiesASPNetCore
source: Use Secure Cookies In ASP.Net Core
cs: Používejte v ASP.Net Core zabezpečené soubory cookie
de: Sichere Cookies in ASP.NET Core verwenden
es: Usar cookies seguras en ASP.NET Core
fr: Utiliser des cookies sécurisés en ASP.Net Core
it: Usa cookie protetti in ASP.NET Core
ja: ASP.Net Core で安全な Cookie を使用します
ko: ASP.NET Core에서 보안 쿠키 사용
pl: Użyj bezpiecznych plików cookie na platformie ASP.Net Core
pt_br: Usar Cookies Seguros no ASP.Net Core
ru: Использовать защищенные файлы cookie в ASP.NET Core
tr: ASP.Net Core'da Güvenli Tanımlama Bilgileri Kullan
zh_hans: 在 ASP.Net Core 中使用安全 Cookie
zh_hant: 在 ASP.Net Core 中使用安全 Cookie

# DefinitelyUseSecureCookiesASPNetCoreMessage
source: Set CookieOptions.Secure = true when setting a cookie
cs: Při nastavování souboru cookie nastavte CookieOptions.Secure = true.
de: Beim Festlegen eines Cookies "CookieOptions.Secure = true" festlegen
es: Establecer CookieOptions.Secure en true al establecer una cookie
fr: Définir CookieOptions.Secure = true au moment de définir un cookie
it: Impostare CookieOptions.Secure = true durante l'impostazione di un cookie
ja: Cookie を設定する場合は、CookieOptions.Secure = true と設定してください。
ko: 쿠키를 설정할 때 CookieOptions.Secure = true를 설정합니다.
pl: Ustaw wartość CookieOptions.Secure = true podczas ustawiania pliku cookie
pt_br: Defina CookieOptions.Secure = true ao configurar um cookie
ru: Установить значение true для параметра CookieOptions.Secure при настройке файла cookie
tr: Tanımlama bilgisi ayarlarken CookieOptions.Secure = true olarak ayarlayın
zh_hans: 设置 Cookie 时设置 CookieOptions.Secure = true
zh_hant: 在設定 Cookie 時設定 CookieOptions.Secure = true

# DoNotAddArchiveItemPathToTheTargetFileSystemPath
source: Do Not Add Archive Item's Path To The Target File System Path
de: Dem Zieldateisystempfad nicht den Pfad des Archivelements hinzufügen
it: Non aggiungere il percorso dell'elemento di archivio al percorso del file system di destinazione
ja: アーカイブ項目のパスをターゲット ファイル システム パスに追加しない
ko: 대상 파일 시스템 경로에 아카이브 항목 경로 추가 안 함
pt_br: Não Adicionar o Caminho do Item de Arquivo Morto ao Caminho do Sistema de Arquivos de Destino
zh_hans: 请勿将存档项的路径添加到目标文件系统路径
zh_hant: 請勿將封存項目的路徑新增到目標檔案系統路徑

# DoNotAddArchiveItemPathToTheTargetFileSystemPathDescription
source: When extracting files from an archive and using the archive item's path, check if the path is safe. Archive path can be relative and can lead to file system access outside of the expected file system target path, leading to malicious config changes and remote code execution via lay-and-wait technique.
de: Wenn Dateien aus einem Archiv extrahiert werden und der Pfad des Archivelements verwendet wird, überprüfen Sie, ob der Pfad sicher ist. Der Archivpfad ist möglicherweise relativ und ermöglicht so den Dateisystemzugriff außerhalb des erwarteten Dateisystemzielpfads. Dies kann zu schädlichen Konfigurationsänderungen und zur Remotecodeausführung über die Lay-and-Wait-Technik führen.
it: Quando si estraggono file da un archivio e si usa il percorso dell'elemento di archiviazione, verificare che il percorso sia sicuro. Il percorso di archivio può essere relativo e può comportare l'accesso al file system al di fuori del percorso di destinazione previsto del file system, determinando modifiche di configurazione dannose e l'esecuzione di codice remoto tramite la tecnica lay-and-wait.
ja: アーカイブからファイルを抽出し、アーカイブ アイテムのパスを使用するときは、パスが安全であるかどうかを確認します。アーカイブ パスは相対パスの場合があり、想定されるファイル システムのターゲット パス以外でファイル システムへのアクセスを引き起こす可能性があります。これは、lay-and-wait の技法によって悪意のある構成変更とリモート コードの実行につながります。
ko: 아카이브에서 파일을 추출하고 아카이브 항목 경로를 사용할 때 경로가 안전한지 확인합니다. 아카이브 경로는 상대적일 수 있고 예상 파일 시스템 대상 경로 밖의 파일 시스템 액세스를 초래하여 lay-and-wait 기법을 통해 악의적으로 구성이 변경되고 원격 코드 실행이 이루어질 수 있습니다.
pt_br: Ao extrair arquivos de um arquivo morto e usar o caminho do item de arquivo morto, verifique se o caminho é seguro. O caminho do arquivo morto pode ser relativo e levar ao acesso ao sistema de arquivos fora do caminho de destino do sistema de arquivos esperado, causando alterações maliciosas na configuração e a execução remota de código por meio da técnica de espera passiva.
zh_hans: 从存档中提取文件并使用该存档项的路径时，请检查该路径是否安全。存档路径可以是相对路径，并可能导致文件系统在预期的文件系统目标路径之外进行访问，从而导致恶意配置更改并通过 "lay-and-wait" 方法执行远程代码。
zh_hant: 從封存擷取檔案並使用封存項目的路徑時，請檢查路徑是否安全。封存路徑可以是相對路徑，可能導致從預期的檔案系統目標路徑外存取檔案系統，從而引發透過偷襲技術進行的惡意組態變更及遠端程式碼執行。

# DoNotAddArchiveItemPathToTheTargetFileSystemPathMessage
source: When creating path for '{0} in method {1}' from relative archive item path to extract file and the source is an untrusted zip archive, make sure to sanitize relative archive item path '{2} in method {3}'
de: Wenn Sie einen Pfad für "{0} in der Methode "{1}" vom relativen Archivelementpfad zur Extraktionsdatei erstellen und die Quelle ein nicht vertrauenswürdiges ZIP-Archiv ist, stellen Sie sicher, dass der relative Archivelementpfad "{2}" in der Methode "{3}" bereinigt wird.
it: Quando si crea il percorso per '{0} nel metodo {1}' dal percorso relativo dell'elemento di archivio per estrarre il file e l'origine è un archivio ZIP non attendibile, assicurarsi di purificare il percorso relativo dell'elemento di archivio '{2} nel metodo {3}'
ja: 'メソッド {1} の {0}' のパスを相対アーカイブ アイテムのパスから作成してファイルを抽出し、ソースが信頼されていない zip アーカイブである場合は、'メソッド {3} の相対アーカイブ アイテムのパス {2}' をサニタイズしてください
ko: 파일을 추출하기 위해 상대 아카이브 항목 경로에서 '메서드 {1}의 {0}' 경로를 만들 때 소스가 신뢰할 수 없는 zip 아카이브인 경우 상대 아카이브 항목 경로 '메서드 {3}의 {2}'을(를) 삭제해야 합니다.
pt_br: Quando você criar o caminho para '{0} no método {1}' por meio do caminho do item de arquivo morto relativo para extrair o arquivo e a fonte for um arquivo zip não confiável, limpe o '{2} no método {3}' do caminho do item de arquivo morto relativo
zh_hans: 从提取文件的相对存档项路径为“方法 {1} 中的 {0}”创建路径时，如果源为不受信任的 ZIP 存档文件，请确保净化相对存档项路径“方法 {3} 中的 {2}”
zh_hant: 在從相對封存項目路徑建立「方法 {1} 中的 {0}」路徑以擷取檔案，而且來源是未受信任的 ZIP 封存時，請務必處理相對封存項目路徑「方法 {3} 中的 {2}」

# DefinitelyUseWeakKDFInsufficientIterationCount
source: Do Not Use Weak Key Derivation Function With Insufficient Iteration Count
de: Schwache Schlüsselableitungsfunktion nicht mit unzureichender Iterationsanzahl verwenden
it: Non usare la funzione di derivazione di chiave vulnerabile con un numero di iterazioni insufficiente
ja: 反復回数が十分でない弱いキー派生関数は使用しないでください
ko: 부족한 반복 횟수로 취약한 키 파생 함수를 사용하면 안 됨
pt_br: Não Use a Função de Derivação de Chaves Fraca com uma Contagem de Iteração Insuficiente
zh_hans: 请勿使用迭代计数不足的弱密钥派生功能
zh_hant: 不要使用反覆運算計數不足的弱式金鑰衍生函數 (Key Derivation Function)

# DefinitelyUseWeakKDFInsufficientIterationCountMessage
source: Use at least {0} iterations when deriving a cryptographic key from a password. By default, Rfc2898DeriveByte's IterationCount is only 1000
de: Verwenden Sie mindestens {0} Iterationen, wenn Sie einen kryptografischen Schlüssel aus einem Kennwort ableiten. Standardmäßig beträgt IterationCount von Rfc2898DeriveByte nur 1000.
it: Usare almeno {0} iterazioni durante la derivazione di una chiave crittografica da una password. Per impostazione predefinita, il valore di IterationCount per Rfc2898DeriveByte è solo 1000
ja: パスワードから暗号化キーを派生させる場合は、少なくとも {0} 回の反復を使用してください。既定では、Rfc2898DeriveByte の IterationCount は 1000 のみです
ko: 암호에서 암호화 키를 파생할 때 {0}회 이상의 반복을 사용하세요. 기본적으로 Rfc2898DeriveByte의 IterationCount는 1,000뿐입니다.
pt_br: Use pelo menos {0} iterações ao derivar uma chave de criptografia de uma senha. Por padrão, a IterationCount de Rfc2898DeriveByte é de apenas 1000
zh_hans: 基于密码派生加密密钥时，请至少进行 {0} 次迭代。默认情况下，Rfc2898DeriveByte 的 IterationCount 仅为 1000
zh_hant: 當從密碼衍生密碼編譯金鑰時，請至少使用 {0} 個反覆項目。根據預設，Rfc2898DeriveByte 的 IterationCount 只有 1000

source: Do Not Add Schema By URL
cs: Nepřidávejte schéma pomocí adresy URL.
de: Schema nicht nach URL hinzufügen
es: No agregar el esquema por dirección URL
fr: Ne pas ajouter de schéma par URL
it: Non aggiungere lo schema in base all'URL
ja: URL でスキーマを追加しない
ko: URL로 스키마를 추가하지 마세요.
pl: Nie dodawaj schematu przez adres URL
pt_br: Não Adicione O Esquema Por URL
ru: Не добавляйте схему по URL-адресу
tr: URL'ye Göre Şema Eklemeyin
zh_hans: 请勿通过 URL 添加架构
zh_hant: 請勿利用 URL 新增結構描述

# DoNotAddSchemaByURLDescription
source: This overload of XmlSchemaCollection.Add method internally enables DTD processing on the XML reader instance used, and uses UrlResolver for resolving external XML entities. The outcome is information disclosure. Content from file system or network shares for the machine processing the XML can be exposed to attacker. In addition, an attacker can use this as a DoS vector.
cs: Toto přetížení metody XmlSchemaCollection.Add vnitřně povolí zpracování DTD v použité instanci čtečky XML a pomocí UrlResolveru překládá externí entity XML. Výsledkem je zpřístupnění informací. Je možné, že se útočníkovi odhalí obsah ze souborového systému nebo sdílených síťových složek počítače, který zpracovává kód XML. Kromě toho to může útočník použít jako vektor útoku DoS.
de: Diese Überladung der XmlSchemaCollection.Add-Methode aktiviert intern die DTD-Verarbeitung in der verwendeten XML-Reader-Instanz und verwendet UrlResolver zum Auflösen externer XML-Entitäten. Das Ergebnis ist die Offenlegung von Informationen. Inhalte aus Dateisystem- oder Netzwerkfreigaben für den Computer, der die XML-Daten verarbeitet, können für Angreifer verfügbar gemacht werden. Darüber hinaus kann ein Angreifer sie als DoS-Vektor verwenden.
es: Esta sobrecarga del método XmlSchemaCollection.Add habilita internamente el procesamiento de DTD en la instancia de lector XML que se usa y utiliza UrlResolver para resolver entidades XML externas. El resultado es la divulgación de información. El contenido del sistema de archivos o de los recursos compartidos de red de la máquina que procesa el código XML puede exponerse al atacante. Además, un atacante puede usar esto como vector de ataque por denegación de servicio.
fr: Cette surcharge de la méthode XmlSchemaCollection.Add active de manière interne le traitement DTD sur l'instance de lecteur XML utilisée, puis utilise UrlResolver pour résoudre les entités XML externes. Il en résulte une divulgation d'informations. Le contenu du système de fichiers ou des partages réseau de la machine qui traite le code XML peut être exposé à un attaquant. En outre, un attaquant peut l'utiliser comme vecteur d'attaque DoS.
it: Questo overload del metodo XmlSchemaCollection.Add abilita internamente l'elaborazione della DTD sull'istanza usata del lettore XML e usa UrlResolver per risolvere le entità XML esterne. Il risultato implica la diffusione di informazioni. Il contenuto di file system o condivisioni di rete per il computer che elabora il codice XML può essere esposto a utenti malintenzionati. Un utente malintenzionato può inoltre usarlo come vettore DoS.
ja: XmlSchemaCollection.Add メソッドのこのオーバーロードは、使用される XML リーダー インスタンスでの DTD の処理を内部的に有効にし、外部の XML エンティティの解決に UrlResolver を使用します。結果として情報が漏えいします。XML を処理するマシンのファイル システムまたはネットワーク共有からのコンテンツが攻撃者に対して流出する可能性があります。また、攻撃者はこれを DoS ベクターとして使用する可能性もあります。
ko: XmlSchemaCollection.Add 메서드의 이 오버로드는 사용되는 XML 판독기에서 내부적으로 DTD 처리를 사용하도록 설정하고 UrlResolver를 사용하여 외부 XML 엔터티를 확인합니다. 결과는 정보 공개입니다. XML을 처리하는 머신에 대한 파일 시스템 또는 네트워크 공유의 콘텐츠가 공격자에게 공개될 수 있습니다. 또한 공격자가 이 취약성을 DoS 벡터로 사용할 수 있습니다.
pl: To przeciążenie metody XmlSchemaCollection.Add wewnętrznie umożliwia przetwarzanie elementu DTD w używanym wystąpieniu obiektu odczytującego XML i używa elementu UrlResolver do rozpoznawania zewnętrznych jednostek XML. Wynikiem jest ujawnienie informacji. Zawartość systemu plików lub udziałów sieciowych w przypadku maszynowego przetwarzania elementu XML może być narażona na atak. Ponadto atakujący może użyć tego jako wektora ataku DoS.
pt_br: Esta sobrecarga do método XmlSchemaCollection.Add habilita internamente o processamento de DTD na instância do leitor de XML usada e usa UrlResolver para resolver entidades externas do XML. O resultado é a divulgação não autorizada de informação. O conteúdo do sistema de arquivos ou dos compartilhamentos de rede do computador que processa o XML pode ser exposto a um invasor. Além disso, um invasor pode usar isso como um vetor de DoS.
ru: Эта внутренняя перегрузка метода XmlSchemaCollection.Add включает обработку DTD в используемом экземпляре модуля чтения XML, а также использует UrlResolver для разрешения внешних сущностей XML. Результатом является раскрытие информации. Содержимое из файловой системы или общих папок на компьютере, обрабатывающем XML-код, может быть раскрыто для злоумышленника. Кроме того, злоумышленник может использовать этот вектор для проведения атак типа "отказ в обслуживании".
tr: XmlSchemaCollection.Add metodunun bu aşırı yüklemesi, kullanılan XML okuyucu örneğinde dahili olarak DTD işleme sağlar ve dış XML varlıklarını çözümlemek için UrlResolver kullanır. Bunun sonucunda bilgilerin açığa çıkması durumu ortaya çıkar. Dosya sistemindeki içerikler veya XML'yi işleyen makinenin ağ paylaşımları saldırgana açılabilir. Buna ek olarak, bir saldırgan bunu DoS vektörü olarak kullanabilir.
zh_hans: XmlSchemaCollection.Add 方法的此项重载在内部启用了对所使用的 XML 读取器实例的 DTD 处理，并使用 UrlResolver 解析外部 XML 实体。这会导致信息泄漏。文件系统的内容或供计算机处理 XML 的网络共享中的内容可能会暴露给攻击者。此外，攻击者可将其用作 DoS 向量。
zh_hant: XmlSchemaCollection.Add 方法的此項多載，會在使用的 XML 讀取器執行個體上，從內部啟用 DTD 處理，然後使用 UrlResolver 解析外部 XML 實體。而結果就是會導致資訊外洩。攻擊者有可能會看到來自檔案系統或網路共用要進行機器處理 XML 的內容。此外，攻擊者也可將其用作為 DoS 向量。

# DoNotAddSchemaByURLMessage
source: This overload of the Add method is potentially unsafe because it may resolve dangerous external references
cs: Toto přetížení metody Add je potenciálně nebezpečné, protože může překládat nebezpečné externí odkazy.
de: Diese Überladung der Add-Methode ist möglicherweise unsicher, weil dadurch gefährliche externe Verweise aufgelöst werden können.
es: Esta sobrecarga del método Add es potencialmente insegura porque puede resolver referencias externas peligrosas.
fr: Cette surcharge de la méthode Add est potentiellement non sécurisée, car elle peut résoudre des références externes dangereuses
it: Questo overload del metodo Add è potenzialmente insicuro perché può risolvere riferimenti esterni pericolosi
ja: Add メソッドのこのオーバーロードは、危険な外部参照を解決することが考えられるため、安全ではない可能性があります
ko: Add 메서드의 이 오버로드는 위험한 외부 참조를 확인할 수 있으므로 잠재적으로 안전하지 않습니다.
pl: To przeciążenie metody Add jest potencjalnie niebezpieczne, ponieważ może spowodować powstanie niebezpiecznych odwołań zewnętrznych
pt_br: Esta sobrecarga do método Add possivelmente não é segura porque pode resolver referências externas perigosas
ru: Эта перегрузка метода Add потенциально небезопасна, так как может разрешать опасные внешние ссылки
tr: Tehlikeli dış başvuruları çözümleyebileceğinden Add metodunun bu aşırı yüklemesi güvenli olmayabilir
zh_hans: Add 方法的此项重载可能不安全，因为它可能会解析危险的外部引用
zh_hant: 因為 Add 方法的此項多載可能解析了危險的外部參考，而有可能不安全

source: Do Not Call Dangerous Methods In Deserialization
cs: Nevolejte nebezpečné metody při deserializaci
de: Keine gefährlichen Methoden bei der Deserialisierung aufrufen
es: No llame a métodos peligrosos durante la deserialización
fr: Ne pas appeler de méthodes dangereuses dans la désérialisation
it: Non chiamare metodi pericolosi durante la deserializzazione
ja: 逆シリアル化で危険なメソッドを呼び出さないでください
ko: 역직렬화에서 위험한 메서드를 호출하면 안 됨
pl: Nie wywołuj niebezpiecznych metod w deserializacji
pt_br: Não Chame Métodos Perigosos Durante a Desserialização
ru: Не вызывать опасные методы десериализации
tr: Seri Durumdan Çıkarırken Tehlikeli Metotlar Çağırma
zh_hans: 在反序列化中不要调用危险方法
zh_hant: 不要在還原序列化期間呼叫危險的方法
