Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.NetCore.Analyzers/Core/Security/xlf/SystemSecurityCryptographyResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# DoNotUseBrokenCryptographicAlgorithmsMessage
source: {0} uses a broken cryptographic algorithm {1}
cs: {0} používá prolomený kryptografický algoritmus {1}.
de: "{0}" verwendet einen beschädigten kryptografischen Algorithmus: {1}
es: {0} usa un algoritmo criptográfico dañado {1}.
fr: {0} utilise un algorithme de chiffrement cassé {1}
it: {0} usa un algoritmo di crittografia violato {1}
ja: {0} が、破られた暗号アルゴリズム {1} を使用します
ko: {0}이(가) 손상된 암호화 알고리즘 {1}을(를) 사용합니다.
pl: Element {0} używa złamanych algorytmów kryptograficznych {1}
pt_br: {0} usa um algoritmo de criptografia desfeito {1}
ru: {0} использует взломанный алгоритм шифрования {1}
tr: {0} bozuk {1} kriptografik algoritmasını kullanıyor
zh_hans: {0} 使用损坏的加密算法 {1}
zh_hant: {0} 使用損壞的密碼編譯演算法 {1}

# DoNotUseDSA
source: Do Not Use Digital Signature Algorithm (DSA)
cs: Nepoužívejte algoritmus DSA (Digital Signature Algorithm)
de: Digitalen Signaturalgorithmus (DSA) nicht verwenden
es: No usar el algoritmo de firma digital (DSA)
fr: Ne pas utiliser DSA (Digital Signature Algorithm)
it: Non usare l'algoritmo di firma digitale (DSA)
ja: デジタル署名アルゴリズム (DSA) を使用しない
ko: DSA (디지털 서명 알고리즘) 사용 안 함
pl: Nie używaj algorytmu Digital Signature Algorithm (DSA)
pt_br: Não Usar o DSA (Algoritmo de Assinatura Digital)
ru: Не использовать алгоритм DSA
tr: Dijital İmza Algoritması (DSA) Kullanma
zh_hans: 不使用数字签名算法(DSA)
zh_hant: 請勿使用數位簽章演算法 (DSA)

# DoNotUseDSADescription
source: DSA is too weak to use.
cs: Algoritmus DSA je příliš slabý a jeho použití se nedoporučuje.
de: DSA ist zu schwach für die Verwendung.
es: El algoritmo de firma digital no es suficientemente seguro para usarlo.
fr: L'algorithme DSA est trop faible pour être utilisé.
it: L'algoritmo DSA è troppo debole per essere usato.
ja: DSA は脆弱であるため使用しません。
ko: DSA가 보호 수준이 너무 낮아 사용할 수 없습니다.
pl: Algorytm DSA jest zbyt słaby, aby go użyć.
pt_br: O DSA é muito fraco para ser usado.
ru: Алгоритм DSA является слишком ненадежным для использования.
tr: DSA, kullanmak için çok zayıf.
zh_hans: DSA 太弱，无法使用。
zh_hant: DSA 太弱，所以無法使用。

# DoNotUseDSAMessage
source: Asymmetric encryption algorithm {0} is weak. Switch to an RSA with at least 2048 key size, ECDH or ECDSA algorithm instead
cs: Algoritmus asymetrického šifrování {0} je slabý. Použijte radši algoritmus RSA s velikostí klíče alespoň 2048, ECDH nebo ECDSA.
de: Der asymmetrische Verschlüsselungsalgorithmus "{0}" ist schwach. Wechseln Sie stattdessen zu einer RSA-Verschlüsselung mit ECDH- oder ECDSA-Algorithmus mit einer Schlüsselgröße von mindestens 2048.
es: El algoritmo de cifrado asimétrico {0} no es seguro. Cambie a un algoritmo de ECDSA o ECDH con RSA que tenga un tamaño de clave mínimo de 2048.
fr: L'algorithme de chiffrement asymétrique {0} est faible. Passez plutôt à un algorithme RSA avec une clé d'au moins 2 048 bits, à un algorithme ECDH ou à un algorithme ECDSA
it: L'algoritmo di crittografia asimmetrica {0} è debole. Passare a un algoritmo RSA con dimensione di chiave minima pari a 2048 oppure a un algoritmo ECDH o ECDSA
ja: 非対称暗号化アルゴリズム {0} が脆弱です。キー サイズが少なくとも 2048 の RSA、ECDH、または ECDSA アルゴリズムに切り替えてください
ko: 비대칭 암호화 알고리즘 {0}은(는) 보호 수준이 낮습니다. 최소 2048 키 크기, ECDH 또는 ECDSA 알고리즘이 포함된 RSA로 전환하세요.
pl: Algorytm szyfrowania asymetrycznego {0} jest słaby. Przełącz się na algorytm RSA z kluczem o rozmiarze co najmniej 2048, algorytm ECDH lub algorytm ECDSA
pt_br: O algoritmo de criptografia assimétrica {0} é fraco. Alterne para um RSA com um tamanho de chave de pelo menos 2048 ou para um algoritmo ECDH ou ECDSA
ru: Алгоритм асимметричного шифрования {0} является ненадежным. Перейдите на алгоритм RSA с размером ключа не менее 2048 бит или на алгоритмы ECDH или ECDSA
tr: Asimetrik şifreleme algoritması {0} zayıf. Bunun yerine en az 2048 anahtar boyutuna, ECDH veya ECDSA algoritmasına sahip bir RSA'ya geçiş yapın
zh_hans: 非对称加密算法 {0} 较弱。请转而切换到至少具有 2048 位密钥大小的 RSA、ECDH 或者 ECDSA 算法
zh_hant: 非對稱式加密演算法 {0} 是弱式加密。請改為切換成至少有 2048 金鑰大小的 RSA、ECDH 或 ECDSA 演算法

source: Do Not Use Deprecated Security Protocols
cs: Nepoužívejte zastaralé protokoly zabezpečení.
de: Verwenden Sie keine veralteten Sicherheitsprotokolle.
es: No usar protocolos de seguridad en desuso
fr: Ne pas utiliser de protocoles de sécurité dépréciés
it: Non usare protocolli di sicurezza deprecati
ja: 非推奨のセキュリティ プロトコルを使用しない
ko: 사용되지 않는 보안 프로토콜을 사용하지 마세요.
pl: Nie używaj przestarzałych protokołów zabezpieczeń
pt_br: Não Use Protocolos de Segurança Preteridos
ru: Не используйте нерекомендуемые протоколы безопасности
tr: Kullanım Dışı Güvenlik Protokollerini Kullanmayın
zh_hans: 请勿使用弃用的安全协议
zh_hant: 請勿使用已淘汰的安全性通訊協定

# DoNotUseDeprecatedSecurityProtocolsDescription
source: Using a deprecated security protocol rather than the system default is risky.
cs: Používání zastaralých protokolů zabezpečení místo systémových výchozích protokolů představuje riziko.
de: Die Verwendung eines veralteten Sicherheitsprotokolls anstelle des Systemstandards ist riskant.
es: El uso de un protocolo de seguridad en desuso en lugar del predeterminado del sistema supone un riesgo.
fr: L'utilisation d'un protocole de sécurité déprécié à la place du protocole par défaut du système est risquée.
it: L'uso di un protocollo di sicurezza deprecato rispetto a quello predefinito di sistema è rischioso.
ja: システムの既定値ではなく、非推奨のセキュリティ プロトコルを使用することは安全ではありません。
ko: 시스템 기본값이 아닌 사용되지 않는 보안 프로토콜을 사용하는 것은 위험합니다.
pl: Używanie przestarzałego protokołu zabezpieczeń zamiast domyślnego ustawienia systemowego jest ryzykowne.
pt_br: É arriscado usar um protocolo de segurança preterido em vez do padrão do sistema.
ru: Использование нерекомендуемого протокола безопасности вместо заданного по умолчанию в системе является рискованным.
tr: Sistem varsayılanı yerine bir kullanım dışı güvenlik protokolünü kullanmak risklidir.
zh_hans: 使用弃用的安全协议而不是系统默认协议将有风险。
zh_hant: 使用了已淘汰的安全性通訊協定而非系統預設值，相當具風險。

# DoNotUseDeprecatedSecurityProtocolsMessage
source: Hard-coded use of deprecated security protocol {0}
cs: Pevně zakódované použití zastaralého protokolu zabezpečení {0}
de: Hartcodierte Verwendung des veralteten Sicherheitsprotokolls "{0}"
es: Uso codificado de forma rígida de un protocolo de seguridad en desuso {0}
fr: Utilisation codée en dur du protocole de sécurité déprécié {0}
it: Uso hardcoded del protocollo di sicurezza deprecato {0}
ja: 非推奨のセキュリティ プロトコル {0} のハードコーディングされた使用
ko: 사용되지 않는 보안 프로토콜 {0}의 하드 코드된 사용
pl: Zakodowane korzystanie z przestarzałego protokołu zabezpieczeń {0}
pt_br: Uso do protocolo de segurança preterido {0} embutido em código
ru: Жестко заданное использование нерекомендуемого протокола безопасности {0}
tr: Kullanım dışı {0} güvenlik protokolünün sabit kodlanmış kullanımı
zh_hans: 以硬编码方式使用弃用的安全协议 {0}
zh_hant: 硬式編碼使用了已淘汰的安全性通訊協定 {0}

# DoNotUseMD5
source: Do not use insecure cryptographic algorithm MD5.
cs: Nepoužívejte nezabezpečený kryptografický algoritmus MD5
de: Verwenden Sie nicht den unsicheren kryptografischen Algorithmus MD5.
es: No use el algoritmo criptográfico no seguro MD5.
fr: N'utilisez pas d'algorithme de chiffrement MD5 non sécurisé.
it: Non usare l'algoritmo di crittografia non sicuro MD5.
ja: 安全でない暗号アルゴリズム MD5 を使用しない。
ko: 안전하지 않은 암호화 알고리즘 MD5를 사용하지 마세요.
pl: Nie używaj niezabezpieczonego algorytmu kryptograficznego MD5.
pt_br: Não use o algoritmo de criptografia não seguro MD5.
ru: Не используйте небезопасный алгоритм шифрования MD5.
tr: Güvenli olmayan MD5 kriptografik algoritmasını kullanmayın.
zh_hans: 不要使用不安全的加密算法 MD5。
zh_hant: 請勿使用不安全的密碼編譯演算法 MD5。

# DoNotUseMD5Description
source: This type implements MD5, a cryptographically insecure hashing function. Hash collisions are computationally feasible for the MD5 and HMACMD5 algorithms. Replace this usage with a SHA-2 family hash algorithm (SHA512, SHA384, SHA256).
cs: Tento typ implementuje MD5, což je kryptograficky nezabezpečená hashovací funkce. Kolize hashovací funkce jsou výpočetně schůdné u algoritmů MD5 a HMACMD5. Nahraďte toto použití hashovacím algoritmem z řady SHA-2 (SHA512, SHA384, SHA256).
de: Dieser Typ implementiert MD5, eine kryptografisch unsichere Hashfunktion. Hashkollisionen sind für die Algorithmen MD5 und HMACMD5 rechnerisch möglich. Ersetzen Sie diese Verwendung durch einen Hashalgorithmus der SHA-2-Familie (SHA512, SHA384, SHA256).
es: Este tipo implementa MD5, una función hash no segura criptográficamente. Las colisiones de hash son computacionalmente factibles para los algoritmos MD5 y HMACMD5. Reemplace este uso por un algoritmo de hash de la familia SHA-2 (SHA512, SHA384, SHA256).
fr: Ce type implémente MD5, une fonction de hachage par chiffrement non sécurisée. Les collisions de hachage peuvent être calculées pour les algorithmes MD5 et HMACMD5. Remplacez cette utilisation par un algorithme de hachage de la famille SHA-2 (SHA512, SHA384, SHA256).
it: Questo tipo implementa MD5, una funzione hash crittograficamente non sicura. Da un punto di vista computazionale, le collisioni di hash sono possibili per gli algoritmi MD5 e HMACMD5. Sostituire questo algoritmo con uno hash della famiglia SHA-2 (SHA512, SHA384, SHA256).
ja: この型は、暗号として安全でないハッシュ関数である MD5 を実装しています。MD5 と HMACMD5 アルゴリズムでは、計算上、ハッシュの競合が起こる可能性があります。この使用を SHA-2 ファミリのハッシュ アルゴリズム (SHA512、SHA384、SHA256) に置き換えてください。
ko: 이 형식은 안전하지 않게 암호화된 해시 알고리즘인 MD5를 구현합니다. MD5 및 HMACMD5 알고리즘에서 계산상 해시 충돌이 발생할 수 있습니다. 이 사용법을 SHA-2 패밀리 해시 알고리즘(SHA512, SHA384, SHA256)으로 바꾸세요.
pl: Ten typ implementuje niezabezpieczoną kryptograficznie funkcję skrótu MD5. Istnieje możliwość wystąpienia kolizji skrótów w przypadku algorytmów MD5 i HMACMD5. Zastąp to użycie algorytmem wartości skrótu z rodziny SHA-2 (SHA512, SHA384, SHA256).
pt_br: Esse tipo implementa MD5, uma função de hash criptograficamente não segura. As colisões de hash são computacionalmente viáveis para os algoritmos MD5 e HMACMD5. Substitua esse uso por um algoritmo hash da família SHA-2 (SHA512, SHA384, SHA256).
ru: Этот тип реализует криптографически небезопасную хэш-функцию MD5. С точки зрения вычислений для алгоритмов MD5 и HMACMD5 возможны хэш-конфликты. Замените на хэш-алгоритм из семейства SHA-2 (SHA512, SHA384, SHA256).
tr: Bu tür, kriptografik olarak güvenli olmayan bir karma işlevi olan MD5 uygular. MD5 ve HMACMD5 algoritmaları için karma çakışmaları işlemsel olarak uygundur. Bu kullanımı bir SHA-2 aile karma algoritmasıyla (SHA512, SHA384, SHA256) değiştirin.
zh_hans: 此类型实现 MD5，它是一种不安全的加密哈希函数。在计算方面，MD5 和 HMACMD5 算法可能出现哈希冲突。请将此使用项替换为 SHA-2 系列哈希算法(SHA512、SHA384、SHA256)。
zh_hant: 此類型會實作 MD5，此雜湊函數在密碼編譯方面有安全性疑慮。MD5 與 HMACMD5 演算法在運算方面可能會發生雜湊衝突。請以 SHA-2 系列雜湊演算法 (SHA512、SHA384、SHA256) 取代此用法。

# DoNotUseObsoleteKDFAlgorithm
source: Do not use obsolete key derivation function
cs: Nepoužívat zastaralou funkci pro odvození klíče
de: Keine veraltete Schlüsselableitungsfunktion verwenden
es: No utilizar la función de derivación de claves obsoleta
fr: Ne pas utiliser de fonction de dérivation de clés obsolète
it: Non usare la funzione di derivazione di chiave obsoleta
ja: 非推奨のキー派生関数を使用しないでください
ko: 사용되지 않는 키 파생 함수 사용 안 함
pl: Nie używaj przestarzałej funkcji wyprowadzenia klucza
pt_br: Não use a função de derivação de chave obsoleta
ru: Не используйте устаревшую функцию формирования ключа.
tr: Artık kullanılmayan anahtar türetme işlevini kullanma
zh_hans: 请勿使用已过时的密钥派生功能
zh_hant: 請勿使用已淘汰的金鑰衍生函數

# DoNotUseObsoleteKDFAlgorithmDescription
source: Password-based key derivation should use PBKDF2 with SHA-2. Avoid using PasswordDeriveBytes since it generates a PBKDF1 key. Avoid using Rfc2898DeriveBytes.CryptDeriveKey since it doesn't use the iteration count or salt.
cs: Odvození klíče na bázi hesla by mělo používat PBKDF2 s SHA-2. Nepoužívejte PasswordDeriveBytes, protože generuje klíč PBKDF1. Nepoužívejte Rfc2898DeriveBytes.CryptDeriveKey, protože nepoužívá počet iterací nebo řetězec salt.
de: Die kennwortbasierte Schlüsselableitung sollte PBKDF2 mit SHA-2 verwenden. Verwenden Sie nicht PasswordDeriveBytes, da hierbei ein PBKDF1-Schlüssel generiert wird. Verwenden Sie nicht Rfc2898DeriveBytes.CryptDeriveKey, da hierbei weder Iterationszählung noch Salt verwendet werden.
es: La derivación de claves basada en contraseña debe utilizar PBKDF2 con SHA-2. Evite usar PasswordDeriveBytes ya que genera una clave PBKDF1. Evite usar Rfc2898DeriveBytes.CryptDeriveKey puesto que no utiliza el recuento de iteración o salt.
fr: La dérivation de clés basée sur un mot de passe doit utiliser PBKDF2 avec SHA-2. Évitez d'utiliser PasswordDeriveBytes puisqu'il génère une clé PBKDF1. Évitez d'utiliser Rfc2898DeriveBytes.CryptDeriveKey car il n'utilise ni le nombre d'itérations ni de valeur salt.
it: La derivazione di chiave basata su password deve usare PBKDF2 con SHA-2. Evitare di usare PasswordDeriveBytes perché genera una chiave PBKDF1. Evitare di usare Rfc2898DeriveBytes.CryptDeriveKey perché non usa il salting o il conteggio delle iterazioni.
ja: パスワードベースのキーの派生では、PBKDF2 を SHA-2 と一緒に使用してください。PBKDF1 キーが生成されてしまうため、PasswordDeriveBytes を使用しないでください。反復カウントまたは salt を使用していないため、Rfc2898DeriveBytes.CryptDeriveKey を使用しないでください。
ko: 암호 기반 키 파생은 PBKDF2와 SHA-2를 사용해야 합니다. PasswordDeriveBytes는 PBKDF1 키를 생성하므로 사용하지 마세요. Rfc2898DeriveBytes.CryptDeriveKey는 반복 횟수 또는 솔트를 사용하지 않으므로 사용하지 마세요.
pl: Wyprowadzenie klucza oparte na haśle powinno używać funkcji PBKDF2 z algorytmem SHA-2. Unikaj używania klasy PasswordDeriveBytes, ponieważ generuje ona klucz PBKDF1. Unikaj używania klasy Rfc2898DeriveBytes.CryptDeriveKey, ponieważ nie używa ona liczby iteracji ani wartości zaburzającej.
pt_br: A derivação de chave com base em senha deve usar PBKDF2 com SHA-2. Evite usar PasswordDeriveBytes, pois ele gera uma chave PBKDF1. Evite usar Rfc2898DeriveBytes.CryptDeriveKey, pois ele não usa contagem de iteração nem salt.
ru: При формировании ключа на основе пароля должен использоваться стандарт PBKDF2 с SHA-2. Не используйте метод PasswordDeriveBytes, так как он формирует ключ PBKDF1. Также не используйте метод Rfc2898DeriveBytes.CryptDeriveKey, так как он не использует счетчик итераций и соль.
tr: Parola tabanlı anahtar türetme SHA-2 ile PBKDF2 kullanmalıdır. Bir PBKDF1 anahtarı ürettiğinden PasswordDeriveBytes kullanmaktan kaçının. Yineleme sayısı veya güvenlik dizisi kullanmadığından Rfc2898DeriveBytes.CryptDeriveKey kullanmaktan kaçının.
zh_hans: 基于密码的密钥派生应结合使用 PBKDF2 和 SHA-2。请避免使用 PasswordDeriveBytes，因为它会生成 PBKDF1 密钥。还需避免使用 Rfc2898DeriveBytes.CryptDeriveKey，因为它不使用迭代计数或加盐。
zh_hant: 以密碼為基礎的金鑰衍生應搭配 SHA-2 使用 PBKDF2。請避免使用 PasswordDeriveBytes，因為這會產生 PBKDF1 金鑰。請避免使用 Rfc2898DeriveBytes.CryptDeriveKey，因為其未使用反覆運算次數或 Salt。

# DoNotUseObsoleteKDFAlgorithmMessage
source: Call to obsolete key derivation function {0}.{1}
cs: Volání zastaralé funkce pro odvození klíče {0}.{1}
de: Aufruf der veralteten Schlüsselableitungsfunktion {0}.{1}
es: Llamada a la función de derivación de claves obsoleta {0}.{1}
fr: Appel à la fonction de dérivation de clés obsolète {0}.{1}
it: Chiamata alla funzione di derivazione di chiave obsoleta {0}.{1}
ja: 非推奨のキー派生関数 {0}.{1} への呼び出し
ko: 사용되지 않는 키 파생 함수 {0}.{1}에 대한 호출
pl: Wywołanie przestarzałej funkcji wyprowadzania klucza {0}.{1}
pt_br: Chamar a função de derivação de chave obsoleta {0}.{1}
ru: Вызов устаревшей функции формирования ключа {0}.{1}
tr: Artık kullanılmayan {0}.{1} anahtar türetme işlevine çağrı
zh_hans: 调用已过时的密钥派生功能 {0}。{1}
zh_hant: 呼叫已淘汰的金鑰衍生函數 {0}.{1}

# DoNotUseSHA1
source: Do not use insecure cryptographic algorithm SHA1.
cs: Nepoužívejte nezabezpečený kryptografický algoritmus SHA1
de: Verwenden Sie nicht den unsicheren kryptografischen SHA1-Algorithmus.
es: No use el algoritmo criptográfico no seguro SHA1.
fr: N'utilisez pas d'algorithme de chiffrement SHA1 non sécurisé.
it: Non usare l'algoritmo di crittografia non sicuro SHA1.
ja: 安全でない暗号アルゴリズム SHA1 を使用しない。
ko: 안전하지 않은 암호화 알고리즘 SHA1을 사용하지 마세요.
pl: Nie używaj niezabezpieczonego algorytmu kryptograficznego SHA1.
pt_br: Não use o algoritmo de criptografia não seguro SHA1.
ru: Не используйте небезопасный алгоритм шифрования SHA1.
tr: Güvenli olmayan SHA1 kriptografik algoritmasını kullanmayın.
zh_hans: 不要使用不安全的加密算法 SHA1。
zh_hant: 請勿使用不安全的密碼編譯演算法 SHA1。

# DoNotUseSHA1Description
source: This type implements SHA1, a cryptographically insecure hashing function. Hash collisions are computationally feasible for the SHA-1 and SHA-0 algorithms. Replace this usage with a SHA-2 family hash algorithm (SHA512, SHA384, SHA256).
cs: Tento typ implementuje SHA1, což je kryptograficky nezabezpečená hashovací funkce. Kolize hashovací funkce jsou výpočetně schůdné u algoritmů SHA-1 a SHA-0. Nahraďte toto použití hashovacím algoritmem z řady SHA-2 (SHA512, SHA384, SHA256).
de: Dieser Typ implementiert SHA1, eine kryptografisch unsichere Hashfunktion. Hashkollisionen sind für die Algorithmen SHA-1 und SHA-0 rechnerisch möglich. Ersetzen Sie diese Verwendung durch einen Hashalgorithmus der SHA-2-Familie (SHA512, SHA384, SHA256).
es: Este tipo implementa SHA1, una función hash no segura criptográficamente. Las colisiones de hash son computacionalmente factibles para los algoritmos SHA-1 y SHA-0. Reemplace este uso por un algoritmo de hash de la familia SHA-2 (SHA512, SHA384, SHA256).
fr: Ce type implémente SHA1, une fonction de hachage par chiffrement non sécurisée. Les collisions de hachage peuvent être calculées pour les algorithmes SHA-1 et SHA-0. Remplacez cette utilisation par un algorithme de hachage de la famille SHA-2 (SHA512, SHA384, SHA256).
it: Questo tipo implementa SHA1, una funzione hash crittograficamente non sicura. Da un punto di vista computazionale, le collisioni di hash sono possibili per gli algoritmi SHA-1 e SHA-0. Sostituire questo algoritmo con uno hash della famiglia SHA-2 (SHA512, SHA384, SHA256).
ja: この型は、暗号として安全でないハッシュ関数である SHA1 を実装しています。SHA-1 と SHA-0 アルゴリズムでは、計算上、ハッシュの競合が起こる可能性があります。この使用を SHA-2 ファミリのハッシュ アルゴリズム (SHA512、SHA384、SHA256) に置き換えてください。
ko: 이 형식은 안전하지 않게 암호화된 해시 알고리즘인 SHA1을 구현합니다. SHA-1 및 SHA-0 알고리즘에서 계산상 해시 충돌이 발생할 수 있습니다. 이 사용법을 SHA-2 패밀리 해시 알고리즘(SHA512, SHA384, SHA256)으로 바꾸세요.
pl: Ten typ implementuje niezabezpieczoną kryptograficznie funkcję skrótu SHA1. Istnieje możliwość wystąpienia kolizji skrótów w przypadku algorytmów SHA-1 i SHA-0. Zastąp to użycie algorytmem wartości skrótu z rodziny SHA-2 (SHA512, SHA384, SHA256).
pt_br: Esse tipo implementa SHA1, uma função de hash criptograficamente não segura. As colisões de hash são computacionalmente viáveis para os algoritmos SHA-1 e SHA-0. Substitua esse uso por um algoritmo hash da família SHA-2 (SHA512, SHA384, SHA256).
ru: Этот тип реализует криптографически небезопасную хэш-функцию SHA1. С точки зрения вычислений для алгоритмов SHA-1 и SHA-0 возможны хэш-конфликты. Замените на хэш-алгоритм из семейства SHA-2 (SHA512, SHA384, SHA256).
tr: Bu tür, kriptografik olarak güvenli olmayan bir karma işlevi olan SHA1 uygular. SHA-1 ve SHA-0 algoritmaları için karma çakışmaları işlemsel olarak uygundur. Bu kullanımı bir SHA-2 aile karma algoritmasıyla (SHA512, SHA384, SHA256) değiştirin.
zh_hans: 此类型实现 SHA1，它是一种不安全的加密哈希函数。在计算方面，SHA-1 和 SHA-0 算法可能出现哈希冲突。请将此使用项替换为 SHA-2 系列哈希算法(SHA512、SHA384、SHA256)。
zh_hant: 此類型會實作 SHA1，此雜湊函數在密碼編譯方面有安全性疑慮。SHA-1 與 SHA-0 演算法在運算方面可能會發生雜湊衝突。請以 SHA-2 系列雜湊演算法 (SHA512、SHA384、SHA256) 取代此用法。

source: Do Not Use Weak Cryptographic Algorithms
cs: Nepoužívejte slabé kryptografické algoritmy
de: Keine schwachen kryptografischen Algorithmen verwenden
es: No usar algoritmos criptográficos poco seguros
fr: Ne pas utiliser d'algorithmes de chiffrement faibles
it: Non usare algoritmi di crittografia vulnerabili
ja: 脆弱な暗号アルゴリズムを使用しない
ko: 취약한 암호화 알고리즘을 사용하지 마세요.
pl: Nie używaj słabych algorytmów kryptograficznych
pt_br: Não usar algoritmos de criptografia fracos
ru: Не используйте слабые алгоритмы шифрования
tr: Zayıf Kriptografik Algoritmalar Kullanma
zh_hans: 不要使用弱加密算法
zh_hant: 請勿使用弱式密碼編譯演算法
