Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.NetCore.Analyzers/Core/Security/xlf/SystemSecurityCryptographyResources.*.xlf
Languages: cs, de, es, fr, it, ja, ko, pl, pt_br, ru, tr, zh_hans, zh_hant

# MaybeUseSecureCookiesASPNetCoreMessage
source: Ensure that CookieOptions.Secure = true when setting a cookie
cs: Při nastavování souboru cookie nezapomeňte nastavit CookieOptions.Secure = true.
de: Stellen Sie sicher, dass beim Festlegen eines Cookies "CookieOptions.Secure = true" festgelegt wird.
es: Asegurarse de que CookieOptions.Secure es true al establecer una cookie
fr: Vérifier que CookieOptions.Secure = true au moment de définir un cookie
it: Assicurarsi che CookieOptions.Secure = true durante l'impostazione di un cookie
ja: Cookie を設定する場合は、CookieOptions.Secure = true になっていることを確認してください
ko: 쿠키를 설정할 때 CookieOptions.Secure = true인지 확인합니다.
pl: Upewnij się, że podczas ustawiania pliku cookie wartość CookieOptions.Secure = true
pt_br: Verifique se CookieOptions.Secure = true ao configurar um cookie
ru: Убедитесь, что для параметра CookieOptions.Secure установлено значение true при настройке файла cookie.
tr: Tanımlama bilgisi ayarlanırken CookieOptions.Secure = true olduğundan emin olun
zh_hans: 请确保设置 Cookie 时 CookieOptions.Secure = true
zh_hant: 請確認設定 Cookie 時，CookieOptions.Secure = true

# MaybeUseWeakKDFInsufficientIterationCount
source: Ensure Sufficient Iteration Count When Using Weak Key Derivation Function
de: Bei Verwendung einer schwachen Schlüsselableitungsfunktion ausreichende Iterationsanzahl sicherstellen
it: Assicurare un numero di iterazioni sufficiente quando si usa la funzione di derivazione di chiave vulnerabile
ja: 弱いキー派生関数を使用する場合は十分な反復回数を確保してください
ko: 취약한 키 파생 함수를 사용할 때 충분한 반복 횟수가 필요함
pt_br: Assegure uma Contagem de Iteração Suficiente ao Usar a Função de Derivação de Chaves Fraca
zh_hans: 使用弱密钥派生功能时，请确保迭代计数足够大
zh_hant: 使用弱式金鑰衍生函數 (Key Derivation Function) 時，請確保反覆項目計量足夠

# MaybeUseWeakKDFInsufficientIterationCountMessage
source: Ensure that the iteration count is at least {0} when deriving a cryptographic key from a password. By default, Rfc2898DeriveByte's IterationCount is only 1000
de: Stellen Sie eine Iterationsanzahl von mindestens {0} sicher, wenn Sie einen kryptografischen Schlüssel aus einem Kennwort ableiten. Standardmäßig beträgt IterationCount von Rfc2898DeriveByte nur 1000.
it: Assicurarsi che il numero delle iterazioni sia almeno {0} durante la derivazione di una chiave crittografica da una password. Per impostazione predefinita, il valore di IterationCount per Rfc2898DeriveByte è solo 1000
ja: パスワードから暗号化キーを派生させる場合は、反復回数が少なくとも {0} 回であることを確認してください。既定では、Rfc2898DeriveByte の IterationCount は 1000 のみです
ko: 암호에서 암호화 키를 파생할 때 {0} 이상의 반복 횟수를 사용하세요. 기본적으로 Rfc2898DeriveByte의 IterationCount는 1,000뿐입니다.
pt_br: Verifique se a contagem de iteração é de pelo menos {0} ao derivar uma chave de criptografia de uma senha. Por padrão, a IterationCount de Rfc2898DeriveByte é de apenas 1000
zh_hans: 基于密码派生加密密钥时，请确保迭代计数至少为 {0}。默认情况下，Rfc2898DeriveByte 的 IterationCount 仅为 1000
zh_hant: 當從密碼衍生密碼編譯金鑰時，請確保反覆項目計數至少為 {0}。根據預設，Rfc2898DeriveByte 的 IterationCount 只有 1000

# SetViewStateUserKey
source: Set ViewStateUserKey For Classes Derived From Page
cs: Pro třídy odvozené z Page nastavte ViewStateUserKey.
de: Legen Sie ViewStateUserKey für von der Seite abgeleitete Klassen fest.
es: Establecer ViewStateUserKey para clases derivadas de página
fr: Définir ViewStateUserKey pour les classes dérivées de Page
it: Impostare ViewStateUserKey per classi derivate da Page
ja: ページから派生したクラスに ViewStateUserKey を設定する
ko: Page에서 파생된 클래스의 ViewStateUserKey 설정
pl: Ustaw właściwość ViewStateUserKey dla klas pochodzących od klasy Page
pt_br: Defina ViewStateUserKey Para As Classes Derivadas De Página
ru: Задайте ViewStateUserKey для классов, производных от Page
tr: Sayfadan Türetilen Sınıflar için ViewStateUserKey Ayarlayın
zh_hans: 针对派生自 Page 的类设置 ViewStateUserKey
zh_hant: 設定頁面衍生類別的 ViewStateUserKey

# SetViewStateUserKeyDescription
source: Setting the ViewStateUserKey property can help you prevent attacks on your application by allowing you to assign an identifier to the view-state variable for individual users so that they cannot use the variable to generate an attack. Otherwise, there will be cross-site request forgery vulnerabilities.
cs: Nastavení vlastnosti ViewStateUserKey může pomoct zabránit útokům na aplikaci tak, že vám umožní přiřadit identifikátor k proměnné stavu zobrazení pro jednotlivé uživatele. Díky tomu nebude možné proměnnou použít k útoku. Jinak bude zabezpečení aplikace ohrožené útokem CSRF.
de: Durch Festlegen der ViewStateUserKey-Eigenschaft können Sie Angriffe auf Ihre Anwendung verhindern, indem Sie der view-state-Variablen für einzelne Benutzer einen Bezeichner zuweisen können, damit diese die Variable nicht zum Generieren eines Angriffs verwenden können. Andernfalls besteht das Sicherheitsrisiko der websiteübergreifenden Anforderungsfälschung.
es: Establecer la propiedad ViewStateUserKey puede ayudarle a evitar ataques en la aplicación, ya que le permite asignar un identificador a la variable de estado de vista para los usuarios individuales, de forma que no puedan usar la variable para generar un ataque. De lo contrario, habrá vulnerabilidades de falsificación de solicitud entre sitios.
fr: La définition de la propriété ViewStateUserKey peut vous aider à éviter des attaques sur votre application en vous permettant d'affecter un identificateur à la variable d'état d'affichage pour des utilisateurs individuels afin qu'ils ne puissent pas utiliser cette variable pour générer une attaque. Sinon, il existe des vulnérabilités liées à la falsification de requête intersites.
it: La proprietà ViewStateUserKey permette di evitare attacchi all'applicazione grazie all'assegnazione di un identificatore alla variabile dello stato di visualizzazione per singoli utenti per impedire che usino la variabile per generare un attacco. In caso contrario, potrebbero riscontrarsi vulnerabilità di tipo richiesta intersito falsa.
ja: ViewStateUserKey プロパティを設定すると、識別子を個別のユーザーの view-state 変数に割り当てて、ユーザーが変数を使用した攻撃を実行できないようにすることで、アプリケーションに対する攻撃を防ぐことができます。そうしない場合、クロスサイト リクエスト フォージェリの脆弱性の危険性があります。
ko: ViewStateUserKey 속성을 설정하면 공격을 생성하는 데 변수를 사용할 수 없도록 개별 사용자의 뷰 상태 변수에 식별자를 할당할 수 있어 애플리케이션에 대한 공격을 방지할 수 있습니다. 그렇지 않으면 교차 사이트 요청 위조 취약성이 발생합니다.
pl: Ustawienie właściwości ViewStateUserKey może pomóc zapobiec atakom na aplikację, umożliwiając przypisanie identyfikatora do zmiennej view-state dla poszczególnych użytkowników, aby nie mogli użyć zmiennej do wygenerowania ataku. W przeciwnym razie będą istniały luki w zabezpieczeniach przed fałszowaniem żądań międzywitrynowych.
pt_br: A definição da propriedade ViewStateUserKey pode ajudar a impedir ataques ao aplicativo permitindo que você atribua um identificador à variável view-state de usuários individuais, impedindo-os de usar a variável para gerar um ataque. Caso contrário, haverá vulnerabilidades de falsificação de solicitação entre sites.
ru: Задание свойства ViewStateUserKey может помочь предотвратить атаки на приложение, позволяя назначить идентификатор переменной состояния просмотра для отдельных пользователей, чтобы они не могли использовать переменную для атаки. В противном случае будут иметь место уязвимости к подделке межсайтовых запросов.
tr: ViewStateUserKey özelliğini ayarlamak, görüntüleme durumu değişkenine tanımlayıcı atayarak kullanıcıların bu değişkeni uygulamanıza saldırı oluşturmak üzere kullanmasını önlemeye yardımcı olabilir. Aksi halde siteler arası istek sahteciliği güvenlik açıkları meydana gelir.
zh_hans: 设置 ViewStateUserKey 属性可帮助防止对应用程序的攻击，方法是允许为单个用户的视图状态变量分配标识符，使他们不能使用该变量来生成攻击。否则，会出现跨站点请求伪造漏洞。
zh_hant: 設定 ViewStateUserKey 屬性可藉由讓您能為各個使用者的檢視狀態變數，指派識別碼，使其無法使用變數來產生攻擊，因而有助於避免應用程式受到攻擊。否則，將會出現跨網站偽造要求弱點。

# SetViewStateUserKeyMessage
source: The class {0} derived from System.Web.UI.Page does not set the ViewStateUserKey property in the OnInit method or Page_Init method
cs: Podtřída {0} třídy Page nenastavuje v metodě OnInit vlastnost ViewStateUserKey.
de: Die von System.Web.UI.Page abgeleitete Klasse "{0}" legt nicht die ViewStateUserKey-Eigenschaft in der OnInit-Methode oder der Page_Init-Methode fest.
es: La subclase {0} de página no establece la propiedad ViewStateUserKey en el método OnInit.
fr: La sous-classe {0} de Page ne définit pas la propriété ViewStateUserKey dans la méthode OnInit
it: La classe {0}, derivata da System.Web.UI.Page, non imposta la proprietà ViewStateUserKey nel metodo OnInit o Page_Init
ja: System.Web.UI.Page から派生したクラス {0} は、OnInit メソッドまたは Page_Init メソッドで ViewStateUserKey プロパティを設定しません
ko: System.Web.UI.Page에서 파생된 {0} 클래스가 OnInit 메서드 또는 Page_Init 메서드에서 ViewStateUserKey 속성을 설정하지 않습니다.
pl: Podklasa {0} klasy Page nie ustawia właściwości ViewStateUserKey w metodzie OnInit
pt_br: A classe {0} derivada de System.Web.UI.Page não define a propriedade ViewStateUserKey no método OnInit ou Page_Init
ru: Подкласс {0} класса Page не задает свойство ViewStateUserKey в методе OnInit
tr: Sayfanın {0} alt sınıfı OnInit metodunda ViewStateUserKey özelliğini ayarlamıyor
zh_hans: 从 ViewStateUserKey 派生的 {0} 类不能在 OnInit 方法或 Page_Init 方法中设置属性
zh_hant: 衍生自 System.Web.UI.Page 的 {0} 類別未在 OnInit 方法或 Page_Init 方法中設定 ViewStateUserKey 屬性

source: Use Container Level Access Policy
cs: Použít zásady přístupu na úrovni kontejneru
de: Zugriffsrichtlinie auf Containerebene verwenden
es: Usar una directiva de acceso de nivel de contenedor
fr: Utiliser une stratégie d'accès au niveau du conteneur
it: Usa criteri di accesso a livello di contenitore
ja: コンテナー レベルのアクセス ポリシーを使用する
ko: 컨테이너 수준 액세스 정책 사용
pl: Użyj zasad dostępu na poziomie kontenera
pt_br: Usar Política de Acesso no Nível de Contêiner
ru: Использовать политику доступа на уровне контейнера
tr: Kapsayıcı Düzeyinde Erişim İlkesi Kullan
zh_hans: 使用容器级别访问策略
zh_hant: 使用容器層級存取原則

# UseContainerLevelAccessPolicyDescription
source: No access policy identifier is specified, making tokens non-revocable.
cs: Není zadaný žádný identifikátor zásad přístupu, a tokeny jsou proto neodvolatelné.
de: Es ist kein Zugriffsrichtlinienbezeichner angegeben, dadurch können Token nicht widerrufen werden.
es: No se ha especificado ningún identificador de directiva de acceso, por lo que los tokens no son revocables.
fr: Aucun identificateur de stratégie d'accès n'est spécifié, ce qui rend les jetons non révocables.
it: Non è specificato alcun identificatore di criterio di accesso, di conseguenza i token sono non revocabili.
ja: アクセス ポリシー識別子が指定されていません。トークンが取消可能ではなくなります。
ko: 액세스 정책 식별자가 지정되지 않아 토큰을 해지 불가능으로 만듭니다.
pl: Nie określono identyfikatora zasad dostępu, co powoduje, że tokeny są nieodwoływalne.
pt_br: Não foi especificado um identificador de política de acesso, o que torna os tokens não revogáveis.
ru: Идентификатор политики доступа не указан. Невозможно отозвать токены.
tr: Erişim ilkesi tanımlayıcısı belirtilmediğinden belirteçler iptal edilemez.
zh_hans: 未指定访问策略标识符，这使得令牌不可撤消。
zh_hant: 因為未指定任何存取原則識別碼，所以使權杖無法撤銷。

# UseContainerLevelAccessPolicyMessage
source: Consider using Azure's role-based access control instead of a Shared Access Signature (SAS) if possible. If you still need to use a SAS, use a container-level access policy when creating a SAS
cs: Pokud je to možné, zvažte použití řízení přístupu Azure na základě role namísto sdíleného přístupového podpisu (SAS). Pokud i přesto potřebujete používat sdílený přístupový podpis, použijte při jeho vytváření zásady přístupu na úrovni kontejneru.
de: Erwägen Sie (sofern möglich) die Verwendung der rollenbasierten Zugriffssteuerung von Azure anstelle einer Shared Access Signature (SAS). Wenn Sie weiterhin eine SAS benötigen, verwenden Sie beim Erstellen einer SAS eine Zugriffsrichtlinie auf Containerebene.
es: Considere la posibilidad de usar el control de acceso basado en rol de Azure en lugar de una firma de acceso compartido (SAS), si es posible. Si tiene que usar una firma de acceso compartido, utilice una directiva de acceso de nivel de contenedor al crear la firma.
fr: Si possible, utilisez la fonctionnalité RBAC (contrôle d'accès en fonction du rôle) d'Azure à la place d'une SAP (signature d'accès partagé). Si vous devez quand même utiliser une SAP, utilisez une stratégie d'accès au niveau du conteneur quand vous créez la SAP
it: Se possibile, provare a usare il controllo degli accessi in base al ruolo di Azure, invece della firma di accesso condiviso. Se è necessaria una firma di accesso condiviso, usare un criterio di accesso a livello di contenitore quando si crea la firma
ja: 可能な場合は、Shared Access Signature (SAS) の代わりに、Azure のロールベースのアクセス制御を使用することを検討してください。依然として SAS を使用する必要がある場合は、SAS の作成時にコンテナーレベルのアクセス ポリシーを使用します
ko: 가능한 경우 SAS(공유 액세스 서명) 대신 Azure의 역할 기반 액세스 제어를 사용하세요. 계속 SAS를 사용해야 할 경우 SAS를 만들 때 컨테이너 수준 액세스 정책을 사용하세요.
pl: Jeśli to możliwe, rozważ użycie kontroli dostępu opartej na rolach platformy Azure zamiast sygnatury dostępu współdzielonego (SAS). Jeśli nadal chcesz używać sygnatury SAS, podczas jej tworzenia użyj zasad dostępu na poziomie kontenera
pt_br: Se possível, considere usar o controle de acesso baseado em função do Azure em vez de uma SAS (Assinatura de Acesso Compartilhado). Se você ainda precisar usar uma SAS, use uma política de acesso de nível de contêiner ao criar uma SAS
ru: Если возможно, попробуйте использовать управление доступом на основе ролей Azure, а не подписанный URL-адрес (SAS). Если все-таки требуется использовать SAS, при его создании примените политику доступа на уровне контейнера.
tr: Mümkünse Paylaşılan Erişim İmzası (SAS) yerine Azure'un rol tabanlı erişim denetimini kullanmayı düşünün. Yine de SAS kullanmanız gerekiyorsa, SAS oluştururken kapsayıcı düzeyinde bir erişim ilkesi kullanın
zh_hans: 如果可能，请考虑使用 Azure 基于角色的访问控制，而不是共享访问签名(SAS)。如果仍需使用 SAS，请在创建 SAS 时使用容器级别访问策略
zh_hant: 如果可行的話，請考慮從共用存取簽章 (SAS) 改為使用 Azure 的角色型存取控制。如果您仍需要使用 SAS，請於建立 SAS 時使用容器層級存取原則

# UseRSAWithSufficientKeySize
source: Use Rivest–Shamir–Adleman (RSA) Algorithm With Sufficient Key Size
cs: Použijte algoritmus RSA (Rivest-Shamir-Adleman) s dostatečnou velikostí klíče
de: Verwenden Sie den RSA-Algorithmus (Rivest – Shamir – Adleman) mit einer ausreichenden Schlüsselgröße.
es: Usar un algoritmo de Rivest-Shamir-Adleman (RSA) con un tamaño de clave suficiente
fr: Utiliser l'algorithme RSA (Rivest-Shamir-Adleman) avec une taille de clé suffisante
it: Usa l'algoritmo RSA (Rivest-Shamir-Adleman) con dimensione di chiave sufficiente
ja: 十分なキー サイズの Rivest–Shamir–Adleman (RSA) アルゴリズムを使用します
ko: 충분한 키 크기로 RSA(Rivest–Shamir–Adleman) 알고리즘 사용
pl: Użyj algorytmu Rivest-Shamir-Adleman (RSA) z wystarczającym rozmiarem klucza
pt_br: Usar o Algoritmo RSA (Rivest-Shamir-Adleman) com um Tamanho de Chave Suficiente
ru: Использовать алгоритм шифрования RSA с достаточным размером ключа
tr: Yeterli Anahtar Boyutuna Sahip Rivest–Shamir–Adleman (RSA) Algoritmasını Kullan
zh_hans: 设置具有足够密钥大小的 Rivest–Shamir–Adleman (RSA)算法
zh_hant: 使用有足夠金鑰大小的 Rivest–Shamir–Adleman (RSA) 加密演算法

# UseRSAWithSufficientKeySizeDescription
source: Encryption algorithms are vulnerable to brute force attacks when too small a key size is used.
cs: Šifrovací algoritmy jsou zranitelné vůči útokům hrubou silou, pokud se použije příliš malá velikost klíče.
de: Verschlüsselungsalgorithmen sind anfällig für Brute-Force-Angriffe, wenn eine zu geringe Schlüsselgröße verwendet wird.
es: Los algoritmos de cifrado son vulnerables a los ataques por fuerza bruta cuando se usa un tamaño de clave demasiado pequeño.
fr: Les algorithmes de chiffrement sont vulnérables aux attaques par force brute quand une clé trop petite est utilisée.
it: Gli algoritmi di crittografia sono vulnerabili agli attacchi di forza bruta quando si usa una dimensione di chiave troppo piccola.
ja: 暗号化アルゴリズムは、小さすぎるキー サイズが使用されていると、ブルート フォース攻撃に対して脆弱になります。
ko: 사용되는 키 크기가 너무 작으면 암호화 알고리즘이 무차별 암호 대입 공격에 취약할 수 있습니다.
pl: Algorytmy szyfrowania z kluczem o zbyt małym rozmiarze są podatne na ataki siłowe.
pt_br: Os algoritmos de criptografia são vulneráveis a ataques de força bruta quando um tamanho de chave muito pequeno é usado.
ru: Алгоритмы шифрования уязвимы для атак методом подбора, если размер используемого ключа слишком мал.
tr: Çok küçük boyutlu bir anahtar kullanıldığında şifreleme algoritmaları deneme yanılma saldırılarına karşı savunmasız durumda kalır.
zh_hans: 在使用的密钥大小太小时，加密算法容易遭到暴力破解攻击。
zh_hant: 當使用的金鑰大小太小時，加密演算法易面臨暴力密碼破解攻擊。

# UseRSAWithSufficientKeySizeMessage
source: Asymmetric encryption algorithm {0}'s key size is less than 2048. Switch to an RSA with at least 2048 key size, ECDH or ECDSA algorithm instead.
cs: Velikost klíče algoritmu asymetrického šifrování {0} je menší než 2048. Použijte radši algoritmus RSA s velikostí klíče alespoň 2048, ECDH nebo ECDSA.
de: Die Schlüsselgröße des asymmetrischen Verschlüsselungsalgorithmus "{0}" beträgt weniger als 2048. Wechseln Sie stattdessen zu einer RSA-Verschlüsselung mit ECDH- oder ECDSA-Algorithmus mit einer Schlüsselgröße von mindestens 2048.
es: El tamaño de clave del algoritmo de cifrado asimétrico {0} es inferior a 2048. Cambie a un algoritmo de ECDSA o ECDH con RSA que tenga un tamaño de clave mínimo de 2048.
fr: La taille de clé de l'algorithme de chiffrement asymétrique {0} est inférieure à 2 048 bits. Passez plutôt à un algorithme RSA avec une taille de clé d'au moins 2 048 bits, à un algorithme ECDH ou à un algorithme ECDSA.
it: La dimensione di chiave dell'algoritmo di crittografia asimmetrica {0} è minore di 2048. Passare a un algoritmo RSA con dimensione di chiave minima pari a 2048 oppure a un algoritmo ECDH o ECDSA.
ja: 非対称暗号化アルゴリズム {0} のキー サイズが 2048 未満です。キー サイズが少なくとも 2048 の RSA、ECDH、または ECDSA アルゴリズムに切り替えてください。
ko: 비대칭 암호화 알고리즘 {0}의 키 크기가 2048보다 작습니다. 최소 2048 키 크기, ECDH 또는 ECDSA 알고리즘이 포함된 RSA로 전환하세요.
pl: Rozmiar klucza algorytmu szyfrowania asymetrycznego {0} jest mniejszy niż 2048. Przełącz się na algorytm RSA z kluczem o rozmiarze co najmniej 2048, algorytm ECDH lub algorytm ECDSA.
pt_br: O tamanho de chave do algoritmo de criptografia assimétrica {0} é menor que 2048. Alterne para um RSA com um tamanho de chave de pelo menos 2048 ou para um algoritmo ECDH ou ECDSA.
ru: Размер ключа для алгоритма асимметричного шифрования {0} меньше 2048 бит. Перейдите на алгоритм RSA с размером ключа не менее 2048 бит или на алгоритмы ECDH или ECDSA.
tr: Asimetrik şifreleme algoritması {0} anahtar boyutu 2048'den az. Bunun yerine en az 2048 anahtar boyutuna, ECDH veya ECDSA algoritmasına sahip bir RSA'ya geçiş yapın.
zh_hans: 非对称加密算法 {0} 的密钥大小小于 2048 位。请转而切换到至少具有 2048 位密钥大小的 RSA、ECDH 或者 ECDSA 算法。
zh_hant: 非對稱式加密演算法 {0} 的金鑰大小小於 2048。請改為切換成至少有 2048 金鑰大小的 RSA、ECDH 或 ECDSA 演算法。

# UseSecureCookiesASPNetCoreDescription
source: Applications available over HTTPS must use secure cookies.
cs: Aplikace, které jsou k dispozici přes HTTPS, musí používat zabezpečené soubory cookie.
de: Anwendungen, die über HTTPS verfügbar sind, müssen sichere Cookies verwenden.
es: Las aplicaciones disponibles a través de HTTPS deben usar cookies seguras.
fr: Les applications disponibles via HTTPS doivent utiliser des cookies sécurisés.
it: Le applicazioni disponibili tramite HTTPS devono usare cookie protetti.
ja: HTTPS 経由で使用できるアプリケーションは、セキュリティで保護された Cookie を使用する必要があります。
ko: HTTPS를 통해 사용할 수 있는 애플리케이션은 보안 쿠키를 사용해야 합니다.
pl: Aplikacje dostępne za pośrednictwem protokołu HTTPS muszą korzystać z bezpiecznych plików cookie.
pt_br: Os aplicativos disponíveis via HTTPS devem usar cookies seguros.
ru: Приложения, доступные через HTTPS, должны использовать защищенные файлы cookie.
tr: HTTPS üzerinden kullanılabilen uygulamalar güvenli tanımlama bilgileri kullanmalıdır.
zh_hans: 通过 HTTPS 提供的应用程序必须使用安全 Cookie。
zh_hant: 透過 HTTPS 使用的應用程式必須使用安全 Cookie。

source: Use SharedAccessProtocol HttpsOnly
cs: Použít SharedAccessProtocol HttpsOnly
de: SharedAccessProtocol.HttpsOnly verwenden
es: Usar HttpsOnly con SharedAccessProtocol
fr: Utiliser SharedAccessProtocol HttpsOnly
it: Usa SharedAccessProtocol.HttpsOnly
ja: SharedAccessProtocol HttpsOnly を使用する
ko: SharedAccessProtocol HttpsOnly 사용
pl: Użyj właściwości SharedAccessProtocol HttpsOnly
pt_br: Usar SharedAccessProtocol HttpsOnly
ru: Использовать SharedAccessProtocol HttpsOnly
tr: SharedAccessProtocol HttpsOnly Kullan
zh_hans: 使用 SharedAccessProtocol HttpsOnly
zh_hant: 使用 SharedAccessProtocol HttpsOnly

# UseSharedAccessProtocolHttpsOnlyDescription
source: HTTPS encrypts network traffic. Use HttpsOnly, rather than HttpOrHttps, to ensure network traffic is always encrypted to help prevent disclosure of sensitive data.
cs: Protokol HTTPS šifruje síťový provoz. Pokud chcete zajistit, aby byl síťový přenos vždy zašifrovaný, aby se zabránilo odhalení citlivých dat, použijte HttpsOnly, ne HttpOrHttps.
de: HTTPS verschlüsselt den Netzwerkdatenverkehr. Verwenden Sie HttpsOnly anstelle von HttpOrHttps, um sicherzustellen, dass der Netzwerkdatenverkehr immer verschlüsselt ist. So können Sie die Offenlegung vertraulicher Daten verhindern.
es: HTTPS cifra el tráfico de red. Use HttpsOnly, en lugar de HttpOrHttps, para asegurarse de que el tráfico de red se cifra siempre y ayudar a evitar la divulgación de información confidencial.
fr: Le protocole HTTPS chiffre le trafic réseau. Utilisez HttpsOnly, à la place de HttpOrHttps, pour garantir le chiffrement permanent du trafic réseau et éviter la divulgation de données sensibles.
it: HTTPS crittografa il traffico di rete. Usare HttpsOnly, invece di HttpOrHttps, per garantire che il traffico di rete sia sempre crittografato ed evitare la divulgazione di dati sensibili.
ja: HTTPS はネットワークトラフィックを暗号化します。ネットワークトラフィックが常に暗号化されるようにするには、HttpsOnly を HttpOrHttps ではなくを使用します。
ko: HTTPS는 네트워크 트래픽을 암호화합니다. 중요한 데이터가 공개되지 않도록 하려면 HttpOrHttps 대신 HttpsOnly를 사용하여 네트워크 트래픽을 상시 암호화하도록 합니다.
pl: Protokół HTTPS szyfruje ruch sieciowy. Użyj właściwości HttpsOnly, a nie HttpOrHttps, aby ruch sieciowy był zawsze szyfrowany i aby zapobiec ujawnieniu poufnych danych.
pt_br: O HTTPS criptografa o tráfego de rede. Use HttpsOnly, em vez de HttpOrHttps, para garantir que o tráfego de rede sempre seja criptografado para ajudar a impedir a divulgação de dados confidenciais.
ru: При использовании HTTPS сетевой трафик шифруется. Чтобы гарантировать, что сетевой трафик всегда будет зашифрован, а конфиденциальные данные не будут раскрыты, используйте HttpsOnly, а не HttpOrHttps.
tr: HTTPS ağ trafiğini şifreler. Hassas verilerin açıklanmasını önlemeye yardımcı olmak için, ağ trafiğinin her zaman şifrelenmesini sağlamak amacıyla HttpOrHttps yerine HttpsOnly kullanın.
zh_hans: HTTPS 对网络流量加密。请使用 HttpsOnly (而不是 HttpOrHttps)确保网络流量始终加密，从而帮助防止敏感数据泄露。
zh_hant: HTTPS 會加密網路流量。請使用 HttpsOnly 而非 HttpOrHttps，以確保網路流量一律會經過加密來避免敏感性資料洩漏。
