Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.NetCore.Analyzers/Core/Runtime/xlf/SystemRuntimeAnalyzersResources.*.xlf
Languages: cs, de, it, pt_br, ru, zh_hans, zh_hant

# UseOrdinalStringComparisonDescription
source: A string comparison operation that is nonlinguistic does not set the StringComparison parameter to either Ordinal or OrdinalIgnoreCase. By explicitly setting the parameter to either StringComparison.Ordinal or StringComparison.OrdinalIgnoreCase, your code often gains speed, becomes more correct, and becomes more reliable.
cs: Operace porovnání řetězců, která není jazyková, nenastavuje parametr StringComparison na hodnotu Ordinal nebo OrdinalIgnoreCase. Explicitním nastavením parametru na hodnotu StringComparison.Ordinal nebo StringComparison.OrdinalIgnoreCase se kód často urychlí a bývá správnější a spolehlivější.
de: Bei einem nicht linguistischen Vorgang zum Zeichenfolgenvergleich wird der StringComparison-Parameter nicht auf "Ordinal" oder "OrdinalIgnoreCase" festgelegt. Indem der Parameter explizit auf "StringComparison.Ordinal" oder "StringComparison.OrdinalIgnoreCase" festgelegt wird, gewinnt Ihr Code häufig an Geschwindigkeit und ist zudem korrekter und zuverlässiger.
it: In un'operazione di confronto tra stringhe di tipo non linguistico il parametro StringComparison non viene impostato su Ordinal o OrdinalIgnoreCase. L'impostazione esplicita del parametro su StringComparison.Ordinal o StringComparison.OrdinalIgnoreCase consente spesso di rendere il codice più veloce, corretto e affidabile.
pt_br: Uma comparação de cadeia de caracteres não linguística não define o parâmetro StringComparison como Ordinal ou OrdinalIgnoreCase. Ao definir explicitamente o parâmetro como StringComparison.Ordinal ou StringComparison.OrdinalIgnoreCase, seu código geralmente ganha velocidade, torna-se mais correto e mais confiável.
ru: Нелингвистическая операция сравнения строк не задает для параметра StringComparison значение Ordinal или OrdinalIgnoreCase. Задав явным образом значение StringComparison.Ordinal или StringComparison.OrdinalIgnoreCase для параметра, можно сделать код более быстродействующим, корректным и надежным.
zh_hans: 非语义的字符串比较运算没有将 StringComparison 参数设置为 Ordinal 或 OrdinalIgnoreCase。通过将参数显式设置为 StringComparison.Ordinal 或 StringComparison.OrdinalIgnoreCase，通常可提高代码的速度、准确率和可靠性。
zh_hant: 非語言的字串比較作業不會將 StringComparison 參數設為 Ordinal 或 OrdinalIgnoreCase。將參數明確設定為 StringComparison.Ordinal 或 StringComparison.OrdinalIgnoreCase 時，程式碼通常會更快速、精確且更可靠。

# UseOrdinalStringComparisonMessageStringComparison
source: {0} passes '{1}' as the 'StringComparison' parameter to {2}. To perform a non-linguistic comparison, specify 'StringComparison.Ordinal' or 'StringComparison.OrdinalIgnoreCase' instead.
cs: {0} předává {1} jako parametr StringComparison do {2}. Pokud chcete provést jiné než jazykové porovnání, zadejte místo toho StringComparison.Ordinal StringComparison.OrdinalIgnoreCase.
de: "{0}" übergibt "{1}" als StringComparison-Parameter an "{2}". Um einen nicht linguistischen Vergleich durchzuführen, geben Sie stattdessen "StringComparison.Ordinal" oder "StringComparison.OrdinalIgnoreCase" an.
it: {0} passa '{1}' come parametro 'StringComparison' a {2}. Per eseguire un confronto di tipo non linguistico, specificare 'StringComparison.Ordinal' o 'StringComparison.OrdinalIgnoreCase'.
pt_br: {0} passa '{1}' como o parâmetro 'StringComparison' para {2}. Em vez disso, para realizar uma comparação não linguística, especifique 'StringComparison.Ordinal' ou 'StringComparison.OrdinalIgnoreCase'.
ru: {0} передает "{1}" в {2} в качестве параметра "StringComparison". Чтобы выполнить нелингвистическое сравнение, укажите "StringComparison.Ordinal" или "StringComparison.OrdinalIgnoreCase".
zh_hans: {0} 将“{1}”作为 "StringComparison" 参数传递给 {2}。若要执行非语义比较，请改为指定 "StringComparison.Ordinal" 或 "StringComparison.OrdinalIgnoreCase"。
zh_hant: {0} 會以 'StringComparison' 參數形式將 '{1}' 傳遞給 {2}。若要執行非語言比較，請改為指定 'StringComparison.Ordinal' 或 'StringComparison.OrdinalIgnoreCase'。

# UseOrdinalStringComparisonMessageStringComparer
source: {0} passes '{1}' as the 'StringComparer' parameter to {2}. To perform a non-linguistic comparison, specify 'StringComparer.Ordinal' or 'StringComparer.OrdinalIgnoreCase' instead.
cs: {0} předává {1} jako parametr StringComparer do {2}. Pokud chcete provést jiné než jazykové porovnání, zadejte místo toho StringComparer.Ordinal StringComparer.OrdinalIgnoreCase.
de: "{0}" übergibt "{1}" als StringComparer-Parameter an "{2}". Um einen nicht linguistischen Vergleich durchzuführen, geben Sie stattdessen "StringComparer.Ordinal" oder "StringComparer.OrdinalIgnoreCase" an.
it: {0} passa '{1}' come parametro 'StringComparer' a {2}. Per eseguire un confronto di tipo non linguistico, specificare 'StringComparer.Ordinal' o 'StringComparer.OrdinalIgnoreCase'.
pt_br: {0} passa '{1}' como o parâmetro 'StringComparer' para {2}. Em vez disso, para realizar uma comparação não linguística, especifique 'StringComparer.Ordinal' ou 'StringComparer.OrdinalIgnoreCase'.
ru: {0} передает "{1}" в {2} в качестве параметра "StringComparer". Чтобы выполнить нелингвистическое сравнение, укажите "StringComparer.Ordinal" или "StringComparer.OrdinalIgnoreCase".
zh_hans: {0} 将“{1}”作为 "StringComparer" 参数传递给 {2}。若要执行非语义比较，请改为指定 "StringComparer.Ordinal" 或 "StringComparer.OrdinalIgnoreCase"。
zh_hant: {0} 會以 'StringComparison' 參數形式將 '{1}' 傳遞給 {2}。若要執行非語言比較，請改為指定 'StringComparer.Ordinal' 或 'StringComparer.OrdinalIgnoreCase'。

# DoNotUseTimersThatPreventPowerStateChangesTitle
source: Do not use timers that prevent power state changes
cs: Nepoužívejte časovače, které znemožňují změnit stav napájení
de: Keine Timer verwenden, die Änderungen am Energiezustand verhindern
it: Non usare timer che impediscono le modifiche allo stato di potenza
pt_br: Não usar temporizadores que evitam alterações no estado de energia
ru: Не используйте таймеры, препятствующие изменению состояния электропитания
zh_hans: 不要使用阻止电源状态更改的计时器
zh_hant: 請勿使用會讓電源狀態無法變更的計時器

# DoNotUseTimersThatPreventPowerStateChangesDescription
source: Higher-frequency periodic activity will keep the CPU busy and interfere with power-saving idle timers that turn off the display and hard disks.
cs: Častější pravidelná aktivita bude zatěžovat procesor a ovlivňovat časovače neaktivity, které šetří energii a vypínají displej a pevné disky.
de: Regelmäßige Aktivitäten mit einer höheren Frequenz belasten die CPU und beeinflussen energiesparende Leerlauftimer, mit denen die Anzeige sowie die Festplatten ausgeschaltet werden.
it: Un'attività periodica più frequente tiene occupata la CPU e interferisce con i timer di inattività per il risparmio di energia che disattivano lo schermo e i dischi rigidi.
pt_br: Atividade periódica de alta frequência manterá a CPU ocupada e interferirá nos medidores de tempo ocioso para economia de energia que desligam o visor e os discos rígidos.
ru: Периодическая активность с более высокой частотой заставит ЦП переключаться в активный режим и помешает работе энергосберегающих таймеров простоя, которые отключают дисплей и жесткие диски.
zh_hans: 频率较高的定期活动会使 CPU 处于繁忙状态并且干扰具有节能功能(关闭显示器和硬盘)的空闲计时器。
zh_hant: 更高頻率的週期性活動，會讓 CPU 一直處於忙碌狀態，且會干擾關閉顯示器與硬碟的省電閒置計時器。

# DoNotUseTimersThatPreventPowerStateChangesMessage
source: Do not use timers that prevent power state changes
cs: Nepoužívejte časovače, které znemožňují změnit stav napájení
de: Keine Timer verwenden, die Änderungen am Energiezustand verhindern
it: Non usare timer che impediscono le modifiche allo stato di potenza
pt_br: Não usar temporizadores que evitam alterações no estado de energia
ru: Не используйте таймеры, препятствующие изменению состояния электропитания
zh_hans: 不要使用阻止电源状态更改的计时器
zh_hant: 請勿使用會讓電源狀態無法變更的計時器

# AvoidUnsealedAttributesTitle
source: Avoid unsealed attributes
cs: Vyhněte se nezapečetěným atributům
de: Nicht versiegelte Attribute vermeiden
it: Evitare attributi unsealed
pt_br: Evitar atributos não selados
ru: Избегайте незапечатанных атрибутов
zh_hans: 避免使用非密封特性
zh_hant: 避免非密封屬性

# AvoidUnsealedAttributesDescription
source: The .NET Framework class library provides methods for retrieving custom attributes. By default, these methods search the attribute inheritance hierarchy. Sealing the attribute eliminates the search through the inheritance hierarchy and can improve performance.
cs: Knihovna tříd .NET Framework poskytuje metody pro načítání vlastních atributů. Ve výchozím nastavení tyto metody prohledávají hierarchii dědičnosti atributů. Zapečetění atributu eliminuje prohledávání hierarchie dědičnosti a může zvýšit výkon.
de: Die .NET Framework-Klassenbibliothek stellt Methoden zum Abrufen benutzerdefinierter Attribute bereit. Standardmäßig durchsuchen diese Methoden die Attributvererbungshierarchie. Durch das Versiegeln des Attributs entfällt das Durchsuchen der Vererbungshierarchie, und die Leistung kann gesteigert werden.
it: La libreria di classi .NET Framework fornisce i metodi per recuperare gli attributi personalizzati. Per impostazione predefinita, questi metodi eseguono ricerche nella gerarchia di ereditarietà degli attributi. L'uso di attributi sealed consente di evitare ricerche nella gerarchia di ereditarietà e può migliorare le prestazioni.
pt_br: A biblioteca de classes .NET Framework oferece métodos para recuperar atributos personalizados. Por padrão, esses métodos pesquisam a hierarquia de herança de atributos. Selar o atributo elimina a pesquisa por meio da hierarquia de herança e pode melhorar o desempenho.
ru: Эта библиотека классов платформы .NET Framework предоставляет методы для извлечения настраиваемых атрибутов. По умолчанию эти методы выполняют поиск по иерархии наследования атрибутов. Запечатывание атрибута устраняет поиск по иерархии наследования и позволяет повысить производительность.
zh_hans: .NET Framework 类库提供用于检索自定义特性的方法。默认情况下，这些方法搜索特性继承层次结构。通过密封特性，将无需搜索继承层次结构并可提高性能。
zh_hant: .NET Framework 類別庫可提供擷取自訂屬性的方法。根據預設，這些方法會搜尋屬性繼承階層。使用密封屬性可免於搜尋整個繼承階層，因而能提升效能。

# AvoidUnsealedAttributesMessage
source: Avoid unsealed attributes
cs: Vyhněte se nezapečetěným atributům
de: Nicht versiegelte Attribute vermeiden
it: Evitare attributi unsealed
pt_br: Evitar atributos não selados
ru: Избегайте незапечатанных атрибутов
zh_hans: 避免使用非密封特性
zh_hant: 避免非密封屬性

# TestForEmptyStringsUsingStringLengthTitle
source: Test for empty strings using string length
cs: Prázdné řetězce testujte pomocí jejich délky
de: Anhand der Zeichenfolgenlänge auf leere Zeichenfolgen prüfen
it: Testare le stringhe vuote con la lunghezza di stringa
pt_br: Testar se há cadeias de caracteres vazias usando tamanho da cadeia
ru: Проверяйте наличие пустых строк, используя длину строки
zh_hans: 使用字符串长度测试是否有空字符串
zh_hant: 使用字串長度測試空白字串

# TestForEmptyStringsUsingStringLengthDescription
source: Comparing strings by using the String.Length property or the String.IsNullOrEmpty method is significantly faster than using Equals.
cs: Porovnávání řetězců pomocí vlastnosti String.Length nebo metody String.IsNullOrEmpty je výrazně rychlejší než pomocí Equals.
de: Der Zeichenfolgenvergleich mithilfe der String.Length-Eigenschaft oder der String.IsNullOrEmpty-Methode ist erheblich schneller als der Vergleich über "Equals".
it: Il confronto di stringhe è notevolmente più rapido se si usa la proprietà String.Length o il metodo String.IsNullOrEmpty invece di Equals.
pt_br: Comparar cadeias de caracteres usando a propriedade String.Length ou o método String.IsNullOrEmpty é significativamente mais rápido do que usar Equals.
ru: Сравнение строк с помощью свойства String.Length или метода String.IsNullOrEmpty выполняется значительно быстрее, чем при использовании Equals.
zh_hans: 相比于使用 Equals，使用 String.Length 属性或 String.IsNullOrEmpty 方法比较字符串的速度要快得多。
zh_hant: 使用 String.Length 屬性或 String.IsNullOrEmpty 方法來比較字串的速度，大幅快過於使用 Equals。

# TestForEmptyStringsUsingStringLengthMessage
source: Test for empty strings using 'string.Length' property or 'string.IsNullOrEmpty' method instead of an Equality check.
cs: Ke kontrole, jestli jsou řetězce prázdné, použijte namísto kontroly rovnosti vlastnost string.Length nebo metodu string.IsNullOrEmpty.
de: Führen Sie den Test auf leere Zeichenfolgen über die string.Length-Eigenschaft oder die string.IsNullOrEmpty-Methode anstelle der Gleichheitsprüfung durch.
it: Testare le stringhe vuote con la proprietà 'string.Length' o il metodo 'string.IsNullOrEmpty' invece di una verifica di uguaglianza.
pt_br: Teste se há cadeias de caracteres vazias usando a propriedade 'string.Length' ou o método 'string.IsNullOrEmpty' em vez de uma verificação de igualdade.
ru: Проверяйте наличие пустых строк, используя свойство "string.Length" или метод "string.IsNullOrEmpty" вместо проверки равенства.
zh_hans: 使用 "string.Length" 属性或 "string.IsNullOrEmpty" 方法而不是 Equality 检查来测试是否有空字符串。
zh_hant: 請使用 'string.Length' 屬性或 'string.IsNullOrEmpty' 方法測試空白字串，而非使用相等檢查。

# DoNotLockOnObjectsWithWeakIdentityTitle
source: Do not lock on objects with weak identity
cs: Nepoužívejte zámky na objekty se slabou identitou
de: Auf Objekten mit schwacher Identität nicht sperren
it: Non bloccare oggetti con identità debole
pt_br: Não bloquear objetos com identidade fraca
ru: Не блокируйте слабо идентифицируемые объекты
zh_hans: 不要锁定具有弱标识的对象
zh_hant: 請勿鎖定弱式識別的物件

# DoNotLockOnObjectsWithWeakIdentityDescription
source: An object is said to have a weak identity when it can be directly accessed across application domain boundaries. A thread that tries to acquire a lock on an object that has a weak identity can be blocked by a second thread in a different application domain that has a lock on the same object.
cs: Objekt má slabou identitu, když se k němu dá přistoupit přímo přes hranice domény aplikace. Vlákno, které se pokusí získat zámek na objekt se slabou identitou, může být zablokováno jiným vláknem v jiné doméně aplikace, které má zámek na stejný objekt.
de: Ein Objekt besitzt eine schwache Identität, wenn es direkt über Anwendungsdomänengrenzen hinweg zugänglich ist. Ein Thread, der versucht, eine Sperre für ein Objekt mit einer schwachen Identität abzurufen, kann von einem zweiten Thread in einer anderen Anwendungsdomäne blockiert werden, der eine Sperre für dasselbe Objekt besitzt.
it: Un oggetto presenta un'identità debole quando è possibile accedervi direttamente attraverso i confini del dominio dell'applicazione. Un thread che prova ad acquisire un blocco su un oggetto con identità debole può essere bloccato da un secondo thread in un altro dominio dell'applicazione che include un blocco sullo stesso oggetto.
pt_br: Diz-se que um objeto tem uma identidade fraca quando ele pode ser acessado diretamente entre os limites de domínio de aplicativo. Um thread que tenta adquirir um bloqueio em um objeto que tem uma identidade fraca pode ser bloqueado por um segundo thread em um domínio de aplicativo diferente que tenha um bloqueio no mesmo objeto.
ru: Слабо идентифицируемым называется объект, к которому можно обратиться напрямую через границы домена приложения. Поток, пытающийся получить блокировку для слабо идентифицируемого объекта, может быть заблокирован вторым потоком в другом домене приложения, получившим блокировку того же объекта.
zh_hans: 当可以跨应用程序域边界直接访问对象时，则认为该对象具有弱标识。如果某线程尝试获取具有弱标识的对象上的锁，则该线程可能会被其他应用程序域中持有同一对象的锁的另一线程阻止。
zh_hant: 若可以跨應用程式定義域界限直接存取某個物件，該物件即為弱式識別。嘗試取得弱式識別物件的鎖定之執行緒，有可能會被具有相同物件鎖定之不同應用程式定義域中的第二個執行緒封鎖。

# DoNotLockOnObjectsWithWeakIdentityMessage
source: Do not lock on objects with weak identity
cs: Nepoužívejte zámky na objekty se slabou identitou
de: Auf Objekten mit schwacher Identität nicht sperren
it: Non bloccare oggetti con identità debole
pt_br: Não bloquear objetos com identidade fraca
ru: Не блокируйте слабо идентифицируемые объекты
zh_hans: 不要锁定具有弱标识的对象
zh_hant: 請勿鎖定弱式識別的物件

# DoNotCatchCorruptedStateExceptionsInGeneralHandlersTitle
source: Do not catch corrupted state exceptions in general handlers.
cs: Nezachytávejte v obecných obslužných rutinách výjimky poškozující stav procesu.
de: Fangen Sie in allgemeinen Handlern keine Corrupted State Exceptions ab.
it: Non rilevare eccezioni di stato danneggiato in gestori generali.
pt_br: Não capture exceções de estado corrompido em manipuladores gerais.
ru: Не перехватывайте исключения поврежденного состояния в общих обработчиках.
zh_hans: 不要在常规处理程序中捕获损坏状态异常。
zh_hant: 請勿在一般處理常式中擷取損毀狀態例外狀況。

# DoNotCatchCorruptedStateExceptionsInGeneralHandlersDescription
source: Do not author general catch handlers in code that receives corrupted state exceptions.
cs: Nevytvářejte v kódu obecné zachytávací bloky, které přijímají výjimky poškozující stav procesu.
de: Erstellen Sie keine allgemeinen catch-Handler in Code, der Corrupted State Exceptions erhält.
it: Non creare gestori catch generali in codice che riceve le eccezioni di stato danneggiato.
pt_br: Não crie manipuladores catch gerais no código que recebe exceções de estado corrompido.
ru: Не создавайте общие обработчики catch в коде, получающем исключения поврежденного состояния.
zh_hans: 不要在接收到损坏状态异常的代码中编写常规捕获处理程序。
zh_hant: 請勿在接收損毀狀態例外狀況的程式碼中，撰寫一般的 catch 處理常式。

# DoNotCatchCorruptedStateExceptionsInGeneralHandlersMessage
source: Do not catch corrupted state exceptions in general handlers.
cs: Nezachytávejte v obecných obslužných rutinách výjimky poškozující stav procesu.
de: Fangen Sie in allgemeinen Handlern keine Corrupted State Exceptions ab.
it: Non rilevare eccezioni di stato danneggiato in gestori generali.
pt_br: Não capture exceções de estado corrompido em manipuladores gerais.
ru: Не перехватывайте исключения поврежденного состояния в общих обработчиках.
zh_hans: 不要在常规处理程序中捕获损坏状态异常。
zh_hant: 請勿在一般處理常式中擷取損毀狀態例外狀況。

# RethrowToPreserveStackDetailsTitle
source: Rethrow to preserve stack details
cs: Vyvolat znovu, aby se zachovaly podrobnosti zásobníku
de: Erneut ausführen, um Stapeldetails beizubehalten
it: Eseguire il rethrow per conservare i dettagli dello stack
pt_br: Gerar novamente para preservar detalhes da pilha
ru: Повторно порождайте исключения для сохранения сведений стека
zh_hans: 再次引发以保留堆栈详细信息
zh_hant: 重新擲回以保存堆疊詳細資料

# RethrowToPreserveStackDetailsDescription
source: An exception is rethrown and the exception is explicitly specified in the throw statement. If an exception is rethrown by specifying the exception in the throw statement, the list of method calls between the original method that threw the exception and the current method is lost.
cs: Výjimka se vyvolá znovu s tím, že se explicitně určí ve výrazu throw. Pokud se výjimka znovu vyvolá tak, že se určí ve výrazu throw, ztratí se seznam volání metod mezi původní metodou, která výjimku vyvolala, a aktuální metodou.
de: Eine Ausnahme wird erneut ausgelöst, und die Ausnahme wird in der throw-Anweisung explizit angegeben. Wenn eine Ausnahme durch Angabe in der throw-Anweisung erneut ausgelöst wird, geht die Liste von Methodenaufrufen zwischen der ursprünglichen Methode, die die Ausnahme ausgelöst hat, und der aktuellen Methode verloren.
it: Viene generata di nuovo un'eccezione, specificata in modo esplicito nell'istruzione throw. Se viene generata di nuovo un'eccezione specificandola nell'istruzione throw, l'elenco di chiamate del metodo tra il metodo originale che ha generato l'eccezione e il metodo corrente viene perso.
pt_br: Uma exceção é gerada novamente e a exceção é especificada explicitamente na instrução throw. Se uma exceção for gerada novamente especificando a exceção na instrução throw, a lista de métodos será chamada entre o método original que gerou a exceção e o método atual será perdido.
ru: Исключение выдается повторно и явно указывается в операторе throw. Если исключение порождается повторно путем его указания в операторе throw, список вызовов метода между исходным методом, породившим исключение, и текущим методом теряется.
zh_hans: 异常被再次引发并在 throw 语句中显式指定。如果通过在 throw 语句中指定异常来重新引发异常，则引发该异常的原始方法与当前方法之间的方法调用列表将丢失。
zh_hant: 會再次擲回例外狀況，並在 throw 陳述式中明確指定該例外狀況。如果在 throw 陳述式中指定例外狀況，而再次擲回了例外狀況，則方法清單會呼叫之前擲回例外狀況的原始方法，而目前的方法則會遺失。

# RethrowToPreserveStackDetailsMessage
source: Rethrow to preserve stack details
cs: Vyvolat znovu, aby se zachovaly podrobnosti zásobníku
de: Erneut ausführen, um Stapeldetails beizubehalten
it: Eseguire il rethrow per conservare i dettagli dello stack
pt_br: Gerar novamente para preservar detalhes da pilha
ru: Повторно порождайте исключения для сохранения сведений стека
zh_hans: 再次引发以保留堆栈详细信息
zh_hant: 重新擲回以保存堆疊詳細資料

# DoNotRaiseReservedExceptionTypesTitle
source: Do not raise reserved exception types
cs: Nevyvolávejte rezervované typy výjimek
de: Keine reservierten Ausnahmetypen auslösen
it: Non generare tipi di eccezione riservati
pt_br: Não gerar tipos de exceção reservados
ru: Не порождайте исключения зарезервированных типов
zh_hans: 不要引发保留的异常类型
zh_hant: 請勿引發保留的例外狀況類型

# DoNotRaiseReservedExceptionTypesDescription
source: An exception of type that is not sufficiently specific or reserved by the runtime should never be raised by user code. This makes the original error difficult to detect and debug. If this exception instance might be thrown, use a different exception type.
cs: Uživatelský kód by nikdy neměl vyvolat výjimku typu, který není dostatečně konkrétní nebo je rezervovaný modulem runtime. V takovém případě je totiž obtížné zjistit a ladit původní chybu. Pokud může dojít k vyvolání této instance výjimky, použijte jiný typ výjimky.
de: Eine Ausnahme eines Typs, der nicht ausreichend spezifisch ist oder durch die Runtime reserviert wurde, sollte niemals von Benutzercode ausgelöst werden. Dadurch ist der ursprüngliche Fehler schwierig zu erkennen und zu debuggen. Wenn diese Ausnahmeinstanz ausgelöst werden könnte, verwenden Sie einen anderen Ausnahmetyp.
it: Il codice utente non dovrebbe mai generare un'eccezione di un tipo non sufficiente specifico o riservato dal runtime. Il rilevamento e il debug dell'errore originale diventano quindi più difficili. Se potrebbe essere generata questa istanza di eccezione, usare un tipo di eccezione diverso.
pt_br: Uma exceção de tipo que não é suficientemente especificada nem reservada pelo tempo de execução nunca deve ser gerada pelo código do usuário. Isso torna o erro original difícil de ser detectado e depurado. Se esta instância de exceção puder ser gerada, use um tipo de exceção diferente.
ru: Пользовательский код никогда не должен порождать исключение типа, который является недостаточно определенным либо зарезервирован средой выполнения. Это затрудняет обнаружение и отладку исходной ошибки. Если экземпляр этого исключения может быть порожден, используйте другой тип исключения.
zh_hans: 用户代码永不会引发不够具体或运行时保留的异常类型。这样会使原来的错误难以检测和调试。如有可能引发此异常实例，请使用其他异常类型。
zh_hant: 明確度不足或由執行階段所保留的例外狀況類型，一律不應由使用者程式碼引發。這會讓原始錯誤的偵測與偵錯更加困難。如果可能會擲回此例外狀況執行個體，請使用其他例外狀況類型。

# DoNotRaiseReservedExceptionTypesMessageTooGeneric
source: Exception type {0} is not sufficiently specific.
cs: Výjimka typu {0} není dost konkrétní.
de: Der Ausnahmetyp "{0}" ist nicht ausreichend spezifisch.
it: Il tipo di eccezione {0} non è sufficientemente specifico.
pt_br: O tipo de exceção {0} não é específico o suficiente.
ru: Тип исключения {0} является недостаточно определенным.
zh_hans: 异常类型 {0} 不够具体。
zh_hant: 例外狀況類型 {0} 不夠明確。

# DoNotRaiseReservedExceptionTypesMessageReserved
source: Exception type {0} is reserved by the runtime.
cs: Výjimka typu {0} je rezervovaná modulem runtime.
de: Der Ausnahmetyp "{0}" wurde durch die Runtime reserviert.
it: Il tipo di eccezione {0} è riservato dal runtime.
pt_br: O tipo de exceção {0} está reservado pelo tempo de execução.
ru: Тип исключения {0} зарезервирован средой выполнения.
zh_hans: 异常类型 {0} 是运行时保留的。
zh_hant: 例外狀況類型 {0} 由執行階段所保留。
