Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.NetCore.Analyzers/Core/Runtime/xlf/SystemRuntimeAnalyzersResources.*.xlf
Languages: cs, de, it, pt_br, ru, zh_hans, zh_hant

# InitializeValueTypeStaticFieldsInlineTitle
source: Initialize value type static fields inline
cs: Inicializujte statická pole typu hodnot jako vložená
de: Statische Felder für Werttyp inline initialisieren
it: Inizializzare inline i campi statici di tipo valore
pt_br: Inicializar campos estáticos de tipo de valor embutido
ru: Используйте встроенную инициализацию статических полей типов значений
zh_hans: 以内联方式初始化值类型的静态字段
zh_hant: 初始化實值型別靜態欄位內嵌

# InitializeReferenceTypeStaticFieldsInlineTitle
source: Initialize reference type static fields inline
cs: Inicializujte statická pole typu odkazů jako vložená
de: Statische Felder für Referenztyp inline initialisieren
it: Inizializzare inline i campi statici di tipo riferimento
pt_br: Inicializar campos estáticos de tipo de referência embutida
ru: Используйте встроенную инициализацию статических полей ссылочных типов
zh_hans: 以内联方式初始化引用类型的静态字段
zh_hant: 初始化參考型別靜態欄位內嵌

# InitializeValueTypeStaticFieldsInlineDescription
source: A value type declares an explicit static constructor. To fix a violation of this rule, initialize all static data when it is declared and remove the static constructor.
cs: Typ hodnoty deklaruje explicitní statický konstruktor. Pokud chcete napravit porušení tohoto pravidla, inicializujte všechna statická data při jejich deklaraci a odeberte statický konstruktor.
de: Ein Werttyp deklariert einen expliziten statischen Konstruktor. Um eine Verletzung dieser Regel zu korrigieren, initialisieren Sie alle statischen Daten, wenn sie deklariert wurden, und entfernen Sie den statischen Konstruktor.
it: Un tipo valore dichiara un costruttore statico esplicito. Per correggere una violazione di questa regola, inizializzare tutti i dati static quando vengono dichiarati e rimuovere il costruttore statico.
pt_br: Um tipo de valor declara um construtor estático explícito. Para corrigir uma violação dessa regra, inicialize todos os dados estáticos quando estiverem declarados e remova o construtor estático.
ru: Тип значения объявляет явный статический конструктор. Чтобы устранить нарушение этого правила, инициализируйте все статические данные при объявлении конструктора и удалите его.
zh_hans: 某值类型声明了显式静态构造函数。要修复与该规则的冲突，请在声明它时初始化所有静态数据，并删除静态构造函数。
zh_hant: 實值型別會宣告明確的靜態建構函式。若要修正此規則的違規，請於宣告所有靜態資料時將其初始化，並移除靜態建構函式。

# InitializeReferenceTypeStaticFieldsInlineDescription
source: A reference type declares an explicit static constructor. To fix a violation of this rule, initialize all static data when it is declared and remove the static constructor.
cs: Typ odkazu deklaruje explicitní statický konstruktor. Pokud chcete napravit porušení tohoto pravidla, inicializujte všechna statická data při jejich deklaraci a odeberte statický konstruktor.
de: Ein Referenztyp deklariert einen expliziten statischen Konstruktor. Um eine Verletzung dieser Regel zu korrigieren, initialisieren Sie alle statischen Daten, wenn sie deklariert wurden, und entfernen Sie den statischen Konstruktor.
it: Un tipo riferimento dichiara un costruttore statico esplicito. Per correggere una violazione di questa regola, inizializzare tutti i dati static quando vengono dichiarati e rimuovere il costruttore statico.
pt_br: Um tipo de referência declara um construtor estático explícito. Para corrigir uma violação dessa regra, inicialize todos os dados estáticos quando estiverem declarados e remova o construtor estático.
ru: Ссылочный тип объявляет явный статический конструктор. Чтобы устранить нарушение этого правила, инициализируйте все статические данные при объявлении конструктора и удалите его.
zh_hans: 某引用类型声明了显式静态构造函数。要修复与该规则的冲突，请在声明它时初始化所有静态数据，并删除静态构造函数。
zh_hant: 參考型別會宣告明確的靜態建構函式。若要修正此規則的違規，請於宣告所有靜態資料時將其初始化，並移除靜態建構函式。

# InitializeStaticFieldsInlineMessage
source: Initialize all static fields in '{0}' when those fields are declared and remove the explicit static constructor
cs: Inicializujte všechna statická pole v {0} ve chvíli, kdy se tato pole deklarují, a odeberte explicitní statický konstruktor.
de: Initialisieren Sie alle statischen Felder in "{0}", wenn diese Felder deklariert wurden, und entfernen Sie den expliziten statischen Konstruktor.
it: Inizializzare tutti i campi statici in '{0}' quando questi campi sono dichiarati e rimuovere il costruttore statico esplicito
pt_br: Inicializar todos os campos estáticos em '{0}' quando esses campos forem declarados e remover o construtor estático explícito
ru: Инициализируйте все статические поля в "{0}" при их объявлении и удалите явный статический конструктор.
zh_hans: 在声明这些字段时初始化“{0}”中的所有静态字段，并删除静态构造函数
zh_hant: 在宣告 {0} 中的所有靜態欄位時，將其初始化，並移除明確的靜態建構函式。

# DisposableFieldsShouldBeDisposedTitle
source: Disposable fields should be disposed
cs: Pole, která se dají uvolnit, by se měla uvolňovat
de: Verwerfbare Felder verwerfen
it: I campi eliminabili devono essere eliminati
pt_br: Campos descartáveis devem ser descartados
ru: Следует высвобождать высвобождаемые поля
zh_hans: 应释放可释放的字段
zh_hant: 可處置的欄位應受到處置

# DisposableFieldsShouldBeDisposedDescription
source: A type that implements System.IDisposable declares fields that are of types that also implement IDisposable. The Dispose method of the field is not called by the Dispose method of the declaring type. To fix a violation of this rule, call Dispose on fields that are of types that implement IDisposable if you are responsible for allocating and releasing the unmanaged resources held by the field.
cs: Typ, který implementuje System.IDisposable, deklaruje pole, která mají typ, který IDisposable implementuje taky. Metoda Dispose deklarujícího typu nevolá metodu Dispose daného pole. Pokud chcete porušení tohoto pravidla opravit a je vaší odpovědností přidělovat a uvolňovat nespravované prostředky, které pole uchovává, zavolejte Dispose pro pole s typy, které implementují IDisposable.
de: Ein Typ, der System.IDisposable implementiert, deklariert Felder, die Typen aufweisen, die ebenfalls IDisposable implementieren. Die Dispose-Methode des Felds wird nicht von der Dispose-Methode des deklarierenden Typs aufgerufen. Wenn Sie für das Zuordnen und Freigeben nicht verwalteter Ressourcen zuständig sind, die von diesem Feld belegt werden, rufen Sie zum Beheben eines Verstoßes gegen diese Regel Dispose für Felder auf, die Typen aufweisen, welche IDisposable implementieren.
it: Un tipo che implementa System.IDisposable dichiara i campi di tipi che implementano anch'essi IDisposable. Il metodo Dispose del campo non viene chiamato dal metodo Dispose del tipo dichiarante. Per correggere una violazione di questa regola, chiamare Dispose su campi di tipi che implementano IDisposable se si è responsabile dell'allocazione e del rilascio delle risorse non gestite utilizzate dal campo.
pt_br: Um tipo que implementa System.IDisposable declara campos dos tipos que também implementam IDisposable. O método Dispose do campo não é chamado pelo método Dispose do tipo declarativo. Se você for responsável por alocar e liberar os recursos não gerenciados mantidos pelo campo, chame Dispose nos campos de tipos que implementam IDisposable para corrigir uma violação dessa regra.
ru: Тип, который реализует System.IDisposable, объявляет поля, относящиеся к типам, которые также реализуют IDisposable. Метод Dispose поля не вызывается методом Dispose объявляющего типа. Чтобы устранить нарушение этого правила, вызовите Dispose для полей, относящихся к типам, которые реализуют IDisposable, если вы отвечаете за выделение и освобождение неуправляемых ресурсов, хранящихся в поле.
zh_hans: 实现 System.IDisposable 的类型将声明一些字段，这些字段所属的类型还实现 IDisposable。字段的 Dispose 方法不由声明类型的 Dispose 方法调用。若要修复此规则的违规行为，如果你负责分配和释放该字段持有的非托管资源，请在其所属类型实现 IDisposable 的字段上调用 Dispose。
zh_hant: 實作 System.IDisposable 的類型，宣告的欄位會是也實作 IDisposable 的類型。該欄位的 Dispose 方法，並非由宣告類型的 Dispose 方法呼叫。若要修正此規則違規，如果由您負責配置及釋放由該欄位所保留的非受控資源，則請在會實作 IDisposable 的欄位類型欄位上，呼叫 Dispose。

# DisposableFieldsShouldBeDisposedMessage
source: '{0}' contains field '{1}' that is of IDisposable type '{2}', but it is never disposed. Change the Dispose method on '{0}' to call Close or Dispose on this field.
cs: {0} obsahuje pole {1}, které má typ IDisposable {2}, ale nikdy se nevyřazuje. Změňte metodu Dispose v {0} tak, aby pro toto pole volala Close nebo Dispose.
de: "{0}" enthält das Feld "{1}", das den IDisposable-Typ "{2}" aufweist, aber nie verworfen wird. Ändern Sie die Dispose-Methode in "{0}", um "Close" oder "Dispose" für dieses Feld aufzurufen.
it: '{0}' contiene il campo '{1}' che è di tipo IDisposable '{2}', ma non viene mai eliminato. Modificare il metodo Dispose su '{0}' in modo che chiami Close o Dispose su questo campo.
pt_br: '{0}' contém o campo '{1}' que é do tipo IDisposable '{2}', mas nunca é descartado. Altere o método Dispose em '{0}' para chamar Close ou Dispose neste campo.
ru: "{0}" содержит поле "{1}", которое имеет тип IDisposable "{2}", но никогда не удаляется. Измените метод Dispose для "{0}" на вызов Close или Dispose для этого поля.
zh_hans: “{0}”包含 IDisposable 类型“{2}”的字段“{1}”，但从未进行释放。请更改“{0}”上的 Dispose 方法以对此字段调用 Close 或 Dispose。
zh_hant: '{0}' 包含 IDisposable 類型 '{2}' 的欄位 '{1}'，但從未處置過該欄位。請變更 '{0}' 上的 Dispose 方法，在此欄位上呼叫 Close 或 Dispose。

# DoNotCallOverridableMethodsInConstructorsTitle
source: Do not call overridable methods in constructors
cs: Nevolejte přepsatelné metody v konstruktorech
de: Überschreibbare Methoden in Konstruktoren nicht aufrufen
it: Non chiamare metodi sottoponibili a override nei costruttori
pt_br: Não chamar métodos substituíveis em construtores
ru: Не вызывайте переопределяемые методы в конструкторах
zh_hans: 不要在构造函数中调用可重写的方法
zh_hant: 請勿呼叫建構函式中的可覆寫方法

# DoNotCallOverridableMethodsInConstructorsDescription
source: When a constructor calls a virtual method, the constructor for the instance that invokes the method may not have executed.
cs: Když konstruktor zavolá virtuální metodu, konstruktor dané instance, která metodu vyvolala, se nemusí spustit.
de: Wenn ein Konstruktor eine virtuelle Methode aufruft, wurde der Konstruktor für die Instanz, die die Methode aufruft, möglicherweise nicht ausgeführt.
it: Quando un costruttore chiama un metodo virtuale, è possibile che il costruttore per l'istanza che richiama il metodo non sia stato eseguito.
pt_br: Quando um construtor chama um método virtual, o construtor para a instância que invoca o método pode não ter sido executado.
ru: Когда конструктор вызывает виртуальный метод, конструктор может не выполняться для экземпляра, вызывающего этот метод.
zh_hans: 构造函数调用虚方法时，可能尚未执行调用该方法的实例的构造函数。
zh_hant: 當建構函式呼叫虛擬方法時，可能尚未執行叫用方法之執行個體的建構函式。

# DoNotCallOverridableMethodsInConstructorsMessage
source: Do not call overridable methods in constructors
cs: Nevolejte přepsatelné metody v konstruktorech
de: Überschreibbare Methoden in Konstruktoren nicht aufrufen
it: Non chiamare metodi sottoponibili a override nei costruttori
pt_br: Não chamar métodos substituíveis em construtores
ru: Не вызывайте переопределяемые методы в конструкторах
zh_hans: 不要在构造函数中调用可重写的方法
zh_hant: 請勿呼叫建構函式中的可覆寫方法

# DisposeMethodsShouldCallBaseClassDisposeTitle
source: Dispose methods should call base class dispose
cs: Metody Dispose by měly volat uvolnění základní třídy
de: Dispose-Methoden müssen die Dispose-Funktion der Basisklasse aufrufen.
it: I metodi Dispose devono chiamare Dispose della classe di base
pt_br: Os métodos Dispose devem chamar o descarte da classe base
ru: Метод Dispose должен вызывать базовый класс Dispose
zh_hans: Dispose 方法应调用基类释放
zh_hant: Dispose 方法應該呼叫基底類別處置

# DisposeMethodsShouldCallBaseClassDisposeDescription
source: A type that implements System.IDisposable inherits from a type that also implements IDisposable. The Dispose method of the inheriting type does not call the Dispose method of the parent type. To fix a violation of this rule, call base.Dispose in your Dispose method.
cs: Typ, který implementuje System.IDisposable, dědí z typu, který IDisposable implementuje taky. Metoda Dispose dědícího typu nevolá metodu Dispose nadřazeného typu. Pokud chcete porušení tohoto pravidla opravit, zavolejte ve své metodě Dispose metodu base.Dispose.
de: Ein Typ, der System.IDisposable implementiert, erbt von einem Typ, der auch IDisposable implementiert. Die Dispose-Methode des erbenden Typs ruft nicht die Dispose-Methode des übergeordneten Typs auf. Um einen Verstoß gegen diese Regel zu beheben, rufen Sie base.Dispose in Ihrer Dispose-Methode auf.
it: Un tipo che implementa System.IDisposable eredita da un tipo che implementa anch'esso IDisposable. Il metodo Dispose del tipo che eredita non chiama il metodo Dispose del tipo padre. Per correggere una violazione di questa regola, chiamare base.Dispose nel metodo Dispose.
pt_br: Um tipo que implementa System.IDisposable é herdado de um tipo que também implementa IDisposable. O método Dispose do tipo herdado não chama o método Dispose do tipo pai. Para corrigir uma violação dessa regra, chame base.Dispose no método Dispose.
ru: Тип, который реализует System.IDisposable, наследует от типа, который также реализует IDisposable. Метод Dispose наследующего типа не вызывает метод Dispose родительского типа. Чтобы устранить нарушение этого правила, вызовите base.Dispose в методе Dispose.
zh_hans: 实现 System.IDisposable 的类型继承自实现 IDisposable 的类型。继承类型的 Dispose 方法不调用父类型的 Dispose 方法。若要修复此规则的违规行为，请在 Dispose 方法中调用 base.Dispose。
zh_hant: 實作 System.IDisposable 的類型，會繼承自也實作 IDisposable 的類型。但繼承類型的 Dispose 方法，並未呼叫父類型的 Dispose 方法。若要修正此規則違規，請在 Dispose 方法中呼叫 base.Dispose。

# DisposeMethodsShouldCallBaseClassDisposeMessage
source: Ensure that method '{0}' calls '{1}' in all possible control flow paths.
cs: Zajistěte, aby metoda {0} volala {1} na všech možných cestách toku řízení.
de: Stellen Sie sicher, dass die {0}-Methode "{1}" in allen möglichen Ablaufsteuerungspfaden aufruft.
it: Assicurarsi che il metodo '{0}' chiami '{1}' in tutti i percorsi del flusso di controllo possibili.
pt_br: Verifique se o método '{0}' chama '{1}' em todos os caminhos de fluxo de controle possíveis.
ru: Убедитесь, что метод "{0}" вызывает "{1}" во всех возможных путях потока управления.
zh_hans: 请确保方法“{0}”在所有可能的控制流路径中都调用“{1}”。
zh_hant: 確認方法 '{0}' 呼叫了所有可能的控制流程路徑中的 '{1}'。

# DisposableTypesShouldDeclareFinalizerTitle
source: Disposable types should declare finalizer
cs: Uvolnitelné typy by měly deklarovat finalizační metodu
de: Verwerfbare Typen sollten einen Finalizer deklarieren
it: I tipi eliminabili devono dichiarare il finalizzatore
pt_br: Tipos descartáveis devem declarar finalizador
ru: Высвобождаемые типы должны объявлять методы завершения
zh_hans: 可释放类型应声明终结器
zh_hant: 可處置的類型應宣告完成項

# DisposableTypesShouldDeclareFinalizerDescription
source: A type that implements System.IDisposable and has fields that suggest the use of unmanaged resources does not implement a finalizer, as described by Object.Finalize.
cs: Typ, který implementuje System.IDisposable a má pole, která naznačují, že se používají nespravované prostředky, neimplementuje finalizační metodu, jak se popisuje v Object.Finalize.
de: Ein Typ, der "System.IDisposable" implementiert und Felder aufweist, die auf die Verwendung nicht verwalteter Ressourcen hinweisen, implementiert keinen Finalizer wie durch "Object.Finalize" beschrieben.
it: Un tipo che implementa System.IDisposable e include campi che suggeriscono l'uso di risorse non gestite non implementa un finalizzatore, come descritto da Object.Finalize.
pt_br: Um tipo que implementa System.IDisposable e tem campos que sugerem o uso de recursos não gerenciados não implementa um finalizador, conforme descrito por Object.Finalize.
ru: Тип, который реализует System.IDisposable и имеет поля, предполагающие использование неуправляемых ресурсов, не реализует метод завершения, как описано Object.Finalize.
zh_hans: 如果某类型实现了 System.IDisposable 且包含建议使用非托管资源的字段，则该类型不会实现 Object.Finalize 所述的终结器。
zh_hant: 實作 System.IDisposable 且有欄位會建議使用非受控資源的類型，不會實作完成項 (如 Object.Finalize 所述)。

# DisposableTypesShouldDeclareFinalizerMessage
source: Disposable types should declare finalizer
cs: Uvolnitelné typy by měly deklarovat finalizační metodu
de: Verwerfbare Typen sollten einen Finalizer deklarieren
it: I tipi eliminabili devono dichiarare il finalizzatore
pt_br: Tipos descartáveis devem declarar finalizador
ru: Высвобождаемые типы должны объявлять методы завершения
zh_hans: 可释放类型应声明终结器
zh_hant: 可處置的類型應宣告完成項

# FinalizersShouldCallBaseClassFinalizerTitle
source: Finalizers should call base class finalizer
cs: Finalizační metody by měly volat finalizační metodu základní třídy
de: Finalizer sollten Basisklassen-Finalizer aufrufen
it: I finalizzatori devono chiamare il finalizzatore della classe di base
pt_br: Os finalizadores devem chamar o finalizador da classe base
ru: Методы завершения должны вызывать метод завершения базового класса
zh_hans: 终结器应调用基类的终结器
zh_hant: 完成項應呼叫基底類別完成項

# FinalizersShouldCallBaseClassFinalizerDescription
source: Finalization must be propagated through the inheritance hierarchy. To guarantee this, types must call their base class Finalize method in their own Finalize method.
cs: Finalizace se musí rozšířit v hierarchii dědičnosti. Aby k tomu došlo, typy musí ve svých vlastních metodách Finalize volat metodu Finalize základní třídy.
de: Die Finalisierung muss über die Vererbungshierarchie verteilt werden. Um dies zu gewährleisten, müssen Typen in ihrer eigenen Finalize-Methode die Finalize-Methode ihrer Basisklasse aufrufen.
it: La finalizzazione deve essere propagata tramite la gerarchia di ereditarietà. A tale scopo, i tipi devono chiamare il metodo Finalize della classe di base nel proprio metodo Finalize.
pt_br: A finalização deve ser propagada por meio da hierarquia de herança. Para garantir isso, os tipos devem chamar seu método Finalize de classe base em seu próprio método Finalize.
ru: Завершение должно распространяться через иерархию наследования. Для этого типы должны вызывать метод Finalize своего базового класса в своем собственном методе Finalize.
zh_hans: 终止必须通过继承层次结构传播。要确保这一点，类型必须从其自身的 Finalize 方法调用它们的基类 Finalize 方法。
zh_hant: 完成項必須傳播到整個繼承階層。為確保上述作業，類型必須呼叫其本身 Finalize 方法中的基底類別 Finalize 方法。

# FinalizersShouldCallBaseClassFinalizerMessage
source: Finalizers should call base class finalizer
cs: Finalizační metody by měly volat finalizační metodu základní třídy
de: Finalizer sollten Basisklassen-Finalizer aufrufen
it: I finalizzatori devono chiamare il finalizzatore della classe di base
pt_br: Os finalizadores devem chamar o finalizador da classe base
ru: Методы завершения должны вызывать метод завершения базового класса
zh_hans: 终结器应调用基类的终结器
zh_hant: 完成項應呼叫基底類別完成項

# ProvideCorrectArgumentsToFormattingMethodsTitle
source: Provide correct arguments to formatting methods
cs: Poskytněte metodám formátování správné argumenty
de: Geeignete Argumente für Formatierungsmethoden angeben
it: Fornire gli argomenti corretti ai metodi di formattazione
pt_br: Fornecer os argumentos corretos para métodos de formatação
ru: Задайте правильные аргументы для методов форматирования
zh_hans: 为格式化方法提供正确的参数
zh_hant: 為格式化方法提供正確的引數

# ProvideCorrectArgumentsToFormattingMethodsDescription
source: The format argument that is passed to System.String.Format does not contain a format item that corresponds to each object argument, or vice versa.
cs: Argument formátu, který se předává do System.String.Format, neobsahuje položku formátování, která odpovídá jednotlivým argumentům objektů, nebo naopak.
de: Das an "System.String.Format" übergebene Formatargument enthält kein Formatelement, das den einzelnen Objektargumenten entspricht bzw. umgekehrt.
it: L'argomento format passato a System.String.Format non contiene un elemento di formato corrispondente a ogni argomento dell'oggetto o viceversa.
pt_br: O argumento de formato passado para System.String.Format não contém um item de formato correspondente a cada argumento de objeto ou vice-versa.
ru: Передаваемый в System.String.Format аргумент формата не содержит элемент формата, соответствующий каждому из аргументов объекта, или наоборот.
zh_hans: 传递到 System.String.Format 的 format 参数不包含与各对象参数相对应的格式项，反之亦然。
zh_hant: 傳遞給 System.String.Format 的格式化引數，並未包含與每個物件引數相對應的格式項目，反之亦然。

# ProvideCorrectArgumentsToFormattingMethodsMessage
source: Provide correct arguments to formatting methods
cs: Poskytněte metodám formátování správné argumenty
de: Geeignete Argumente für Formatierungsmethoden angeben
it: Fornire gli argomenti corretti ai metodi di formattazione
pt_br: Fornecer os argumentos corretos para métodos de formatação
ru: Задайте правильные аргументы для методов форматирования
zh_hans: 为格式化方法提供正确的参数
zh_hant: 為格式化方法提供正確的引數

# TestForNaNCorrectlyTitle
source: Test for NaN correctly
cs: Testujte správně hodnotu NaN
de: Ordnungsgemäß auf NaN testen
it: Testare i valori NaN in modo corretto
pt_br: Testar para NaN corretamente
ru: Правильно выполняйте проверку NaN
zh_hans: 正确测试 NaN
zh_hant: 正確地測試 NaN

# TestForNaNCorrectlyDescription
source: This expression tests a value against Single.Nan or Double.Nan. Use Single.IsNan(Single) or Double.IsNan(Double) to test the value.
cs: Tento výraz otestuje, jestli hodnota není Single.Nan nebo Double.Nan. Otestujte hodnotu pomocí Single.IsNan(Single) nebo Double.IsNan(Double).
de: Dieser Ausdruck testet einen Wert anhand von "Single.Nan" oder "Double.Nan". Verwenden Sie "Single.IsNan(Single)" oder "Double.IsNan(Double)", um den Wert zu testen.
it: Questa espressione consente di testare un valore rispetto a Single.Nan o Double.Nan. Per testare il valore, usare Single.IsNan(Single) o Double.IsNan(Double).
pt_br: Esta expressão testa um valor em Single.Nan ou Double.Nan. Use Single.IsNan(Single) ou Double.IsNan(Double) para testar o valor.
ru: Это выражение проверяет значение на соответствие Single.Nan или Double.Nan. Используйте Single.IsNan(Single) или Double.IsNan(Double) для проверки значения.
zh_hans: 此表达式针对 Single.Nan 或 Double.Nan 测试某个值。使用 Single.IsNan(Single) 或 Double.IsNan(Double) 来测试值。
zh_hant: 此運算式會對 Single.Nan 或 Double.Nan 測試值。使用 Single.IsNan(Single) 或 Double.IsNan(Double) 來測試該值。

# TestForNaNCorrectlyMessage
source: Test for NaN correctly
cs: Testujte správně hodnotu NaN
de: Ordnungsgemäß auf NaN testen
it: Testare i valori NaN in modo corretto
pt_br: Testar para NaN corretamente
ru: Правильно выполняйте проверку NaN
zh_hans: 正确测试 NaN
zh_hant: 正確地測試 NaN

# AttributeStringLiteralsShouldParseCorrectlyTitle
source: Attribute string literals should parse correctly
cs: Literály řetězců atributů by se měly správně parsovat
de: Attributzeichenfolgenliterale müssen richtig analysiert werden
it: I valori letterali stringa dell'attributo devono essere analizzati correttamente
pt_br: Literais de cadeias de caracteres de atributos devem ser analisados corretamente
ru: Синтаксический анализ строковых литералов атрибута должен осуществляться правильно
zh_hans: 特性字符串文本应正确分析
zh_hant: 屬性字串常值應正確剖析

# AttributeStringLiteralsShouldParseCorrectlyDescription
source: The string literal parameter of an attribute does not parse correctly for a URL, a GUID, or a version.
cs: Pro adresu URL, identifikátor GUID nebo verzi se nesprávně parsuje parametr literálu řetězce nějakého atributu.
de: Der Zeichenfolgenliteralparameter eines Attributs wird für eine URL, eine GUID oder eine Version nicht richtig analysiert.
it: Il parametro del valore letterale stringa di un attributo non viene analizzato correttamente per un URL, un GUID o una versione.
pt_br: O parâmetro literal de cadeia de caracteres de um atributo não é analisado corretamente para uma URL, um GUID ou uma versão.
ru: Параметр строкового литерала атрибута анализируется неправильно для URL-адреса, GUID или версии.
zh_hans: 特性的字符串文本参数未正确解析 URL、GUID 或版本。
zh_hant: 屬性的字串常值參數並未正確剖析 URL、GUID 或版本。
