Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.NetCore.Analyzers/Core/Runtime/xlf/SystemRuntimeAnalyzersResources.*.xlf
Languages: cs, de, it, pt_br, ru, zh_hans, zh_hant

# ImplementSerializationConstructorsDescription
source: To fix a violation of this rule, implement the serialization constructor. For a sealed class, make the constructor private; otherwise, make it protected.
cs: Pokud chcete porušení tohoto pravidla opravit, naimplementujte serializační konstruktor. Pro zapečetěné třídy nastavte konstruktor jako private, jinak jako protected.
de: Um einen Verstoß gegen diese Regel zu beheben, implementieren Sie den Serialisierungskonstruktor. Definieren Sie den Konstruktor bei einer versiegelten Klasse als privat und in anderen Fällen als geschützt.
it: Per correggere una violazione di questa regola, implementare il costruttore di serializzazione. Per una classe sealed impostare il costruttore come private; in caso contrario impostarlo come protected.
pt_br: Para corrigir uma violação desta regra, implemente o construtor de serialização. Para uma classe selada, faça com que o Construtor seja privado, para outros casos, faça com que ele seja protegido.
ru: Чтобы устранить нарушение этого правила, реализуйте конструктор сериализации. Для запечатанного класса сделайте конструктор закрытым; в противном случае сделайте его защищенным.
zh_hans: 若要修复此规则的违规行为，请实现序列化构造函数。对于密封类，请将构造函数设为专用；否则，使它处于受保护状态。
zh_hant: 若要修正此規則違規，請實作序列化建構函式。若是密封類別，請將其設定為私人建構函式; 否則，請將其設定為受保護。

# ImplementSerializationConstructorsMessageCreateMagicConstructor
source: Add a constructor to {0} with the following signature: 'protected {0}(SerializationInfo info, StreamingContext context)'.
cs: Přidejte konstruktor k {0} s následující signaturou: 'protected {0}(SerializationInfo info, StreamingContext context)'.
de: Fügen Sie {0} einen Konstruktor mit der folgenden Signatur hinzu: "protected {0}(SerializationInfo info, StreamingContext context)".
it: Aggiungere un costruttore a {0} con la seguente firma: 'protected {0}(SerializationInfo info, StreamingContext context)'.
pt_br: Adicione um construtor a {0} com a seguinte assinatura: 'protected {0}(SerializationInfo info, StreamingContext context)'.
ru: Добавьте конструктор к {0} со следующей сигнатурой: "protected {0}(SerializationInfo info, StreamingContext context)".
zh_hans: 使用以下签名向 {0} 添加构造函数: “protected {0} (SerializationInfo info, StreamingContext context)”。
zh_hant: 使用下列簽章將建構函式加入 {0}: 'protected {0}(SerializationInfo info, StreamingContext context)'。

# ImplementSerializationConstructorsMessageMakeSealedMagicConstructorPrivate
source: Declare the serialization constructor of {0}, a sealed type, as private.
cs: Deklarujte serializační konstruktor {0}, zapečetěný typ, jako soukromý.
de: Deklarieren Sie den Serialisierungskonstruktor von {0} (versiegelter Typ) als privat.
it: Dichiarare il costruttore di serializzazione di {0}, tipo sealed, come privato.
pt_br: Declare o construtor de serialização de {0}, um tipo selado, como privado.
ru: Объявите конструктор сериализации {0} запечатанного типа как частный.
zh_hans: 将密封类型 {0} 的序列化构造函数声明为 private。
zh_hant: 將 {0} 的序列化建構函式 (sealed 類型) 宣告為 private。

# ImplementSerializationConstructorsMessageMakeUnsealedMagicConstructorFamily
source: Declare the serialization constructor of {0}, an unsealed type, as protected.
cs: Deklarujte serializační konstruktor {0}, zapečetěný typ, jako chráněný.
de: Deklarieren Sie den Serialisierungskonstruktor von {0} (nicht versiegelter Typ) als geschützt.
it: Dichiarare come protected il costruttore di serializzazione di {0}, un tipo unsealed.
pt_br: Declare o construtor de serialização de {0}, um tipo não selado, como protegido.
ru: Объявите конструктор сериализации {0} незапечатанного типа как защищенный.
zh_hans: 将非密封类型 {0} 的序列化构造函数声明为 protected。
zh_hant: 將 {0} 的序列化建構函式 (unsealed 類型) 宣告為 protected。

# ImplementSerializationConstructorsTitle
source: Implement serialization constructors
cs: Implementovat serializační konstruktory
de: Serialisierungskonstruktoren implementieren
it: Implementare costruttori di serializzazione
pt_br: Implementar construtores de serialização
ru: Реализуйте конструкторы сериализации
zh_hans: 实现序列化构造函数
zh_hant: 必須實作序列化建構函式

# ImplementSerializationMethodsCorrectlyDescription
source: A method that handles a serialization event does not have the correct signature, return type, or visibility.
cs: Metoda, která zpracovává událost serializace, nemá správnou signaturu, návratový typ nebo viditelnost.
de: Eine Methode, die ein Serialisierungsereignis behandelt, besitzt nicht die richtige Signatur, den richtigen Rückgabetyp oder die richtige Sichtbarkeit.
it: Un metodo che gestisce un evento di serializzazione non include valori corretti per visibilità, tipo restituito o firma.
pt_br: Um método que manipula um evento de serialização não tem a assinatura, o tipo de retorno ou a visibilidade correta.
ru: У метода, обрабатывающего событие сериализации, нет правильной сигнатуры, типа возвращаемого значения или видимости.
zh_hans: 处理序列化事件的方法没有正确的签名、返回类型或可见性。
zh_hant: 處理序列化事件的方法，沒有正確的簽章、傳回型別或可見度。

# ImplementSerializationMethodsCorrectlyMessageGeneric
source: Because {0} is marked with OnSerializing, OnSerialized, OnDeserializing, or OnDeserialized, change its signature so that it is no longer generic.
cs: Protože {0} je označená pomocí OnSerializing, OnSerialized, OnDeserializing nebo OnDeserialized, změňte její signaturu tak, že již není nadále obecná.
de: Da {0} mit OnSerializing, OnSerialized, OnDeserializing oder OnDeserialized markiert ist, ändern Sie die zugehörige Signatur so, dass sie nicht mehr generisch ist.
it: Poiché {0} è contrassegnato con OnSerializing, OnSerialized, OnDeserializing o OnDeserialized, modificare la firma in modo che non sia più generica.
pt_br: Como {0} está marcado com OnSerializing, OnSerialized, OnDeserializing ou OnDeserialized, altere sua assinatura para que não seja mais genérica.
ru: Так как {0} помечен как OnSerializing, OnSerialized, OnDeserializing или OnDeserialized, измените его сигнатуру так, чтобы он более не был универсальным.
zh_hans: 由于 {0} 标记有 OnSerializing、OnSerialized、OnDeserializing 或 OnDeserialized，因此请更改它的签名，使它不再是泛型的。
zh_hant: 因為 {0} 標記著 OnSerializing、OnSerialized、OnDeserializing 或 OnDeserialized，請將它的簽章變更，使其不再是泛型。

# ImplementSerializationMethodsCorrectlyMessageParameters
source: Because {0} is marked with OnSerializing, OnSerialized, OnDeserializing, or OnDeserialized, change its signature so that it takes a single parameter of type 'System.Runtime.Serialization.StreamingContext'.
cs: Protože {0} je označená pomocí OnSerializing, OnSerialized, OnDeserializing nebo OnDeserialized, změňte její signaturu tak, že vyžaduje jeden parametr typu 'System.Runtime.Serialization.StreamingContext'.
de: Da {0} mit OnSerializing, OnSerialized, OnDeserializing oder OnDeserialized markiert ist, ändern Sie die zugehörige Signatur so, dass ein einzelner Parameter vom Typ System.Runtime.Serialization.StreamingContext angenommen wird.
it: Poiché {0} è contrassegnato con OnSerializing, OnSerialized, OnDeserializing o OnDeserialized, modificare la firma in modo che accetti un solo parametro di tipo 'System.Runtime.Serialization.StreamingContext'.
pt_br: Como {0} está marcado com OnSerializing, OnSerialized, OnDeserializing ou OnDeserialized, altere sua assinatura para que ele receba um parâmetro único do tipo 'System.Runtime.Serialization.StreamingContext'.
ru: Так как {0} помечен как OnSerializing, OnSerialized, OnDeserializing или OnDeserialized, измените его сигнатуру так, чтобы он принимал единственный параметр типа "System.Runtime.Serialization.StreamingContext".
zh_hans: 由于 {0} 标记有 OnSerializing、OnSerialized、OnDeserializing 或 OnDeserialized，因此请更改它的签名，使它采用类型为“System.Runtime.Serialization.StreamingContext”的单个参数。
zh_hant: 因為 {0} 標記著 OnSerializing、OnSerialized、OnDeserializing 或 OnDeserialized，請將它的簽章變更，使其接受 'System.Runtime.Serialization.StreamingContext' 類型的單一參數。

# ImplementSerializationMethodsCorrectlyMessageReturnType
source: Because {0} is marked with OnSerializing, OnSerialized, OnDeserializing, or OnDeserialized, change its return type from {1} to void (Sub in Visual Basic).
cs: Protože {0} je označená pomocí OnSerializing, OnSerialized, OnDeserializing nebo OnDeserialized, změňte její návratový typ z {1} na void (Sub v jazyce Visual Basic).
de: Da {0} mit OnSerializing, OnSerialized, OnDeserializing oder OnDeserialized markiert ist, ändern Sie dessen Rückgabetyp von {1} in void (Sub in Visual Basic).
it: Poiché {0} è contrassegnato con OnSerializing, OnSerialized, OnDeserializing o OnDeserialized, modificare il tipo restituito da {1} in void (Sub in Visual Basic).
pt_br: Como {0} está marcado com OnSerializing, OnSerialized, OnDeserializing ou OnDeserialized, altere seu tipo de retorno de {1} para void (Sub no Visual Basic).
ru: Так как {0} помечен как OnSerializing, OnSerialized, OnDeserializing или OnDeserialized, замените тип его возвращаемого значения с {1} на void (Sub в Visual Basic).
zh_hans: 由于 {0} 标记有 OnSerializing、OnSerialized、OnDeserializing 或 OnDeserialized，因此请将它的返回类型从 {1} 改为 void (Visual Basic 中为 Sub)。
zh_hant: 因為 {0} 標記著 OnSerializing、OnSerialized、OnDeserializing 或 OnDeserialized，請將它的傳回類型從 {1} 變更成 void (Visual Basic 中為 Sub)。

# ImplementSerializationMethodsCorrectlyMessageStatic
source: Because {0} is marked with OnSerializing, OnSerialized, OnDeserializing, or OnDeserialized, change it from static (Shared in Visual Basic) to an instance method.
cs: Protože {0} je označená pomocí OnSerializing, OnSerialized, OnDeserializing nebo OnDeserialized, změňte ji ze statické (sdílené v jazyce Visual Basic) na instanční metodu.
de: Da {0} mit OnSerializing, OnSerialized, OnDeserializing oder OnDeserialized markiert ist, nehmen Sie eine Änderung von static (Shared in Visual Basic) in eine Instanzenmethode vor.
it: Poiché {0} è contrassegnato con OnSerializing, OnSerialized, OnDeserializing o OnDeserialized, modificarlo da statico (Shared in Visual Basic) in un metodo di istanza.
pt_br: Como {0} está marcado com OnSerializing, OnSerialized, OnDeserializing ou OnDeserialized, altere-o de static (Shared no Visual Basic) para um método de instância.
ru: Так как {0} помечен как OnSerializing, OnSerialized, OnDeserializing или OnDeserialized, сделайте его не статическим методом (Shared в Visual Basic), а методом экземпляра.
zh_hans: 由于 {0} 标记有 OnSerializing、OnSerialized、OnDeserializing 或 OnDeserialized，因此请将它从 static (Visual Basic 中为 Shared)改为实例方法。
zh_hant: 因為 {0} 標記著 OnSerializing、OnSerialized、OnDeserializing 或 OnDeserialized，請將它從 static (Visual Basic 中為 Shared) 變更成執行個體方法。

# ImplementSerializationMethodsCorrectlyMessageVisibility
source: Because {0} is marked with OnSerializing, OnSerialized, OnDeserializing, or OnDeserialized, change its accessibility to private.
cs: Protože {0} je označená pomocí OnSerializing, OnSerialized, OnDeserializing nebo OnDeserialized, změňte její přístupnost na soukromou.
de: Da "{0}" mit OnSerializing, OnSerialized, OnDeserializing oder OnDeserialized markiert ist, ändern Sie den Zugriff in privat.
it: Poiché {0} è contrassegnato con OnSerializing, OnSerialized, OnDeserializing o OnDeserialized, modificarne l'accessibilità in private.
pt_br: Como {0} está marcado com OnSerializing, OnSerialized, OnDeserializing ou OnDeserialized, altere sua acessibilidade para privado.
ru: Так как {0} помечен как OnSerializing, OnSerialized, OnDeserializing или OnDeserialized, замените его доступность частной.
zh_hans: 由于 {0} 标记有 OnSerializing、OnSerialized、OnDeserializing 或 OnDeserialized，因此请将它的可访问性改为 private。
zh_hant: 因為 {0} 標記著 OnSerializing、OnSerialized、OnDeserializing 或 OnDeserialized，請將它的存取範圍變更成 private。

# ImplementSerializationMethodsCorrectlyTitle
source: Implement serialization methods correctly
cs: Implementujte správně metody serializace
de: Serialisierungsmethoden korrekt implementieren
it: Implementare correttamente i metodi di serializzazione
pt_br: Implementar métodos de serialização corretamente
ru: Правильно реализуйте методы сериализации
zh_hans: 正确实现序列化方法
zh_hant: 必須正確實作序列化方法

# MarkAllNonSerializableFieldsDescription
source: An instance field of a type that is not serializable is declared in a type that is serializable.
cs: Pole instance typu, který se nedá serializovat, je deklarované v typu, který se serializovat dá.
de: Ein Instanzfeld eines Typs, der nicht serialisierbar ist, wurde in einem Typ deklariert, der serialisierbar ist.
it: Un campo di istanza di un tipo non serializzabile viene dichiarato in un tipo serializzabile.
pt_br: Um campo de instância de um tipo que não é serializável é declarado em um tipo que é serializável.
ru: Поле экземпляра типа, который не может быть сериализован, объявлено в типе, который может быть сериализован.
zh_hans: 不可序列化类型的实例字段在可序列化类型中声明。
zh_hant: 非可序列化類型的執行個體欄位，被宣告為可序列化的類型。

# MarkAllNonSerializableFieldsMessage
source: Field {0} is a member of type {1} which is serializable but is of type {2} which is not serializable
cs: Pole {0} je členem typu {1}, který je serializovatelný, ale je typu {2}, který serializovatelný není.
de: Das Feld "{0}" ist ein Member des Typs "{1}", der serialisierbar ist. Das Feld selbst weist jedoch Typ "{2}" auf, der nicht serialisierbar ist.
it: Il campo {0} è un membro di tipo {1}, che è serializzabile, ma è di tipo {2}, che non è serializzabile
pt_br: O campo {0} é membro do tipo {1}, que é serializável, mas é do tipo {2}, que não é serializável
ru: Поле {0} является членом сериализуемого типа {1}, но имеет несериализуемый тип {2}.
zh_hans: 字段 {0} 是可序列化类型 {1} 的成员，但该字段是不可序列化的类型 {2}。
zh_hant: 欄位 {0} 是可序列化類型 {1} 的成員，但其所屬類型 {2} 則不可序列化

# MarkAllNonSerializableFieldsTitle
source: Mark all non-serializable fields
cs: Označte všechny neserializovatelná pole
de: Alle nicht serialisierbaren Felder markieren
it: Contrassegnare tutti i campi non serializzabili
pt_br: Marcar todos os campos não serializáveis
ru: Пометьте все несериализуемые поля
zh_hans: 标记所有不可序列化的字段
zh_hant: 必須標記所有不可序列化的欄位

# MarkISerializableTypesWithSerializableDescription
source: To be recognized by the common language runtime as serializable, types must be marked by using the SerializableAttribute attribute even when the type uses a custom serialization routine through implementation of the ISerializable interface.
cs: Aby modul CLR (Common Language Runtime) mohl typy rozpoznat jako serializovatelné, musí se tyto typy označit atributem SerializableAttribute, a to i v případě, že typ používá vlastní serializační rutinu prostřednictvím implementace rozhraní ISerializable.
de: Um von der Common Language Runtime als serialisierbar erkannt zu werden, müssen Typen auch dann mit dem SerializableAttribute-Attribut markiert werden, wenn der Typ eine Routine zur benutzerdefinierten Serialisierung durch Implementierung der ISerializable-Schnittstelle verwendet.
it: Per essere riconosciuti come serializzabili in Common Language Runtime, i tipi devono essere contrassegnati usando l'attributo SerializableAttribute anche quando usano una routine di serializzazione personalizzata tramite l'implementazione dell'interfaccia ISerializable.
pt_br: Para que sejam reconhecidos pelo Common Language Runtime como serializáveis, os tipos precisam ser marcados usando o atributo SerializableAttribute, mesmo quando o tipo usa uma rotina de serialização personalizada por meio da implementação da interface ISerializable.
ru: Чтобы среда CLR распознавала типы как сериализуемые, они должны быть помечены с помощью атрибута SerializableAttribute, даже если тип использует настраиваемую процедуру сериализации посредством реализации интерфейса ISerializable.
zh_hans: 要被公共语言运行时识别为可序列化，必须使用 SerializableAttribute 特性标记类型，即使类型通过 ISerializable 接口的实现使用自定义序列化例程时也不例外。
zh_hant: 若要通用語言執行階段將其辨識為可序列化，即使類型透過實作 ISerializable 介面使用自訂序列化常式，也必須使用 SerializableAttribute 屬性來標示類型。

# MarkISerializableTypesWithSerializableMessage
source: Add [Serializable] to {0} as this type implements ISerializable
cs: Přidejte [Serializable] k {0}, protože tento typ implementuje ISerializable.
de: Fügen Sie "{0}" [Serializable] hinzu, da dieser Typ ISerializable implementiert.
it: Aggiungere [Serializable] a {0} perché questo tipo implementa ISerializable
pt_br: Adicione [Serializable] a {0}, pois este tipo implementa ISerializable
ru: Добавьте [Serializable] к {0}, так как этот тип реализует ISerializable
zh_hans: 将 [Serializable] 添加到 {0}，因为此类型实现 ISerializable
zh_hant: 將 [Serializable] 新增至 {0}，因為這個類型會實作 ISerializable

# MarkISerializableTypesWithSerializableTitle
source: Mark ISerializable types with serializable
cs: Označit typy ISerializable jako serializable
de: ISerializable-Typen mit "serializable" markieren
it: Contrassegnare i tipi ISerializable con serializable
pt_br: Marque os tipos ISerializable com serializable
ru: Пометить типы ISerializable атрибутом serializable
zh_hans: 将 ISerializable 类型标记为“可序列化”
zh_hant: 將 ISerializable 類型標示為可序列化

# ProvideDeserializationMethodsForOptionalFieldsDescription
source: A type has a field that is marked by using the System.Runtime.Serialization.OptionalFieldAttribute attribute, and the type does not provide deserialization event handling methods.
cs: Typ má pole, které je označené atributem System.Runtime.Serialization.OptionalFieldAttribute, ale tento typ neposkytuje metody pro zpracování události deserializace.
de: Ein Typ weist ein Feld auf, das mit dem System.Runtime.Serialization.OptionalFieldAttribute-Attribut gekennzeichnet ist, und der Typ stellt keine Behandlungsmethoden für Deserialisierungsereignisse bereit.
it: Un tipo include un campo contrassegnato usando l'attributo System.Runtime.Serialization.OptionalFieldAttribute e non fornisce metodi di gestione degli eventi di deserializzazione.
pt_br: Um tipo tem um campo que está marcado usando o atributo System.Runtime.Serialization.OptionalFieldAttribute, mas o tipo não fornece os métodos de manipulação de eventos de desserialização.
ru: Тип имеет поле, помеченное атрибутом System.Runtime.Serialization.OptionalFieldAttribute, и не предоставляет методы для обработки событий десериализации.
zh_hans: 类型具有使用 System.Runtime.Serialization.OptionalFieldAttribute 特性标记的字段，并且该类型不提供反序列化事件处理方法。
zh_hant: 類型的欄位已使用 System.Runtime.Serialization.OptionalFieldAttribute 屬性進行標記，但該類型不提供還原序列化事件處理方法。

# ProvideDeserializationMethodsForOptionalFieldsMessageOnDeserialized
source: Add a 'private void OnDeserialized(StreamingContext)' method to type {0} and attribute it with the System.Runtime.Serialization.OnDeserializedAttribute.
cs: Přidejte metodu 'private void OnDeserialized(StreamingContext)' k typu {0} a označte ji pomocí System.Runtime.Serialization.OnDeserializedAttribute.
de: Fügen Sie Typ {0} eine private void OnDeserialized(StreamingContext)-Methode hinzu, und weisen Sie ihm das System.Runtime.Serialization.OnDeserializedAttribute zu.
it: Aggiungere un metodo 'private void OnDeserialized(StreamingContext)' al tipo {0} e impostarvi l'attributo System.Runtime.Serialization.OnDeserializedAttribute.
pt_br: Adicionar um método 'private void OnDeserialized(StreamingContext)' ao tipo {0} e atribuí-lo com System.Runtime.Serialization.OnDeserializedAttribute.
ru: Добавьте метод "private void OnDeserialized(StreamingContext)" к типу {0} и присвойте ему атрибут System.Runtime.Serialization.OnDeserializedAttribute.
zh_hans: 向类型 {0} 中添加“private void OnDeserialized(StreamingContext)”方法并使其具有 System.Runtime.Serialization.OnDeserializedAttribute 特性。
zh_hant: 將 'private void OnDeserialized(StreamingContext)' 方法加入類型 {0}，並為它加上 System.Runtime.Serialization.OnDeserializedAttribute 屬性。

# ProvideDeserializationMethodsForOptionalFieldsMessageOnDeserializing
source: Add a 'private void OnDeserializing(StreamingContext)' method to type {0} and attribute it with the System.Runtime.Serialization.OnDeserializingAttribute.
cs: Přidejte metodu 'private void OnDeserializing(StreamingContext)' k typu {0} a označte ji pomocí System.Runtime.Serialization.OnDeserializingAttribute.
de: Fügen Sie Typ {0} eine private void OnDeserializing(StreamingContext)-Methode hinzu, und weisen Sie ihm das System.Runtime.Serialization.OnDeserializingAttribute zu.
it: Aggiungere un metodo 'private void OnDeserializing(StreamingContext)' al tipo {0} e impostarvi l'attributo System.Runtime.Serialization.OnDeserializingAttribute.
pt_br: Adicionar um método 'private void OnDeserializing(StreamingContext)' ao tipo {0} e atribuí-lo com System.Runtime.Serialization.OnDeserializingAttribute.
ru: Добавьте метод "private void OnDeserializing(StreamingContext)" к типу {0} и присвойте ему атрибут System.Runtime.Serialization.OnDeserializingAttribute.
zh_hans: 向类型 {0} 中添加“private void OnDeserializing(StreamingContext)”方法并使其具有 System.Runtime.Serialization.OnDeserializingAttribute 特性。
zh_hant: 將 'private void OnDeserializing(StreamingContext)' 方法加入類型 {0}，並為它加上 System.Runtime.Serialization.OnDeserializingAttribute 屬性。

# ProvideDeserializationMethodsForOptionalFieldsTitle
source: Provide deserialization methods for optional fields
cs: Poskytujte metody deserializace pro volitelné pole
de: Deserialisierungsmethoden für optionale Felder angeben
it: Fornire metodi di deserializzazione per i campi facoltativi
pt_br: Fornecer métodos de desserialização para campos opcionais
ru: Обеспечьте наличие методов десериализации в необязательных полях
zh_hans: 为可选字段提供反序列化方法
zh_hant: 必須為選擇性欄位提供還原序列化方法

source: Use indexer
cs: Použít indexer
de: Indexer verwenden
it: Usare l'indicizzatore
pt_br: Usar o indexador
ru: Использовать индексатор
zh_hans: 使用索引器
zh_hant: 使用索引子

# UseOrdinalStringComparisonTitle
source: Use ordinal stringcomparison
cs: Použijte StringComparison s hodnotou Ordinal
de: Ordinal-StringComparison verwenden
it: Usare StringComparison.Ordinal
pt_br: Usar comparação de cadeia de caracteres ordinal
ru: Используйте stringcomparison по порядковым номерам
zh_hans: 使用按顺序的 StringComparison
zh_hant: 使用循序的 StringComparison
