Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.CodeQuality.Analyzers/Core/QualityGuidelines/xlf/MicrosoftQualityGuidelinesAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, tr, zh_hans, zh_hant

# MarkMembersAsStaticDescription
source: Members that do not access instance data or call instance methods can be marked as static (Shared in Visual Basic). After you mark the methods as static, the compiler will emit nonvirtual call sites to these members. This can give you a measurable performance gain for performance-sensitive code.
cs: Členy, které nemají přístup k datům instance nebo volají metody instance, je možné označit jako statické (Shared ve Visual Basicu). Po označení metod jako statických bude kompilátor generovat nevirtuální lokality volání pro tyto členy. Tím získáte měřitelný nárůst výkonu u kódu citlivého na výkon.
de: Member, die nicht auf Instanzdaten zugreifen oder Instanzmethoden aufrufen, können als "static" markiert werden ("Shared" in Visual Basic). Nachdem Sie die Methoden als statisch markiert haben, gibt der Compiler nicht virtuelle Aufrufsites an diese Member aus. Dadurch kann sich für leistungsabhängigen Code eine spürbare Leistungssteigerung ergeben.
es: Los miembros que no tienen acceso a datos de instancia o que llaman a métodos de instancia se pueden marcar como static (Shared en Visual Basic). Después de marcar los métodos como static, el compilador emitirá los sitios de llamada no virtuales para estos miembros. Esto puede proporcionar una mejora apreciable del rendimiento del código en el que el rendimiento es fundamental.
fr: Les membres qui n'accèdent pas aux données d'instance ou qui n'appellent pas de méthodes d'instance peuvent être marqués comme étant static (Shared en Visual Basic). Une fois que vous avez marqué les méthodes comme étant static, le compilateur émet des sites d'appel non virtuels pour ces membres. Cela peut apporter un gain de performances mesurable pour le code qui en dépend.
it: I membri che non accedono ai dati di istanza o non chiamano metodi di istanza possono essere contrassegnati come static (Shared in Visual Basic). Dopo aver contrassegnato i metodi come static, il compilatore creerà siti di chiamata non virtual per questi membri. Si potrà così ottenere un sensibile miglioramento delle prestazioni per il codice sensibile alle prestazioni.
ko: 인스턴스 데이터에 액세스하지 않거나 인스턴스 메서드를 호출하지 않는 멤버는 static(Visual Basic의 경우 Shared)으로 표시할 수 있습니다. 메서드를 static으로 표시하면 컴파일러가 멤버에 대한 비가상 호출 사이트를 내보냅니다. 따라서 성능에 민감한 코드의 경우 이 방법으로 성능을 크게 향상시킬 수 있습니다.
pl: Elementy członkowskie, które nie uzyskują dostępu do danych wystąpienia lub metod wywołania wystąpienia można oznaczyć jako statyczne (Shared w języku Visual Basic). Po oznaczeniu metod jako statyczne kompilator będzie emitować niewirtualne miejsca wywołań do tych elementów członkowskich. Może to spowodować wymierną poprawę wydajności kodu wrażliwego na zmiany wydajności.
pt_br: Os membros que não acessam dados de instância ou chamam métodos de instância podem ser marcados como static (Shared no Visual Basic). Depois de marcar os métodos como estáticos, o compilador emitirá locais de chamada não virtuais para esses membros. Isso pode oferecer um ganho de desempenho mensurável para código sensível ao desempenho.
tr: Örnek verilerine erişmeyen veya örnek yöntemlerini çağırmayan üyeler statik (Visual Basic’te Shared) olarak işaretlenebilir. Yöntemleri statik olarak işaretledikten sonra, derleyici bu üyelere yönelik sanal olmayan çağrı konumlarını gösterir. Bu, performans açısından duyarlı kod için önemli ölçüde performans kazanımı sağlar.
zh_hans: 不访问实例数据或调用实例方法的成员可标记为 static (在 Visual Basic 中为 Shared)。将方法标记为 static 后，编译器将向这些成员发出非虚拟调用站点。这样可以使对性能比较敏感的代码获得显著的性能提升。
zh_hant: 不會存取執行個體資料或呼叫執行個體方法的成員，可標記為 Static (在 Visual Basic 中為 Shared)。當您將方法標記為靜態之後，編譯器會發出這些成員的非虛擬呼叫位置。如此即可讓重視效能的程式碼能獲得可觀的效能。

# MarkMembersAsStaticMessage
source: Member {0} does not access instance data and can be marked as static (Shared in VisualBasic)
cs: Člen {0} nemá přístup k datům instance a je možné ho označit jako statický (Shared ve Visual Basicu).
de: Der Member "{0}" greift nicht auf Instanzdaten zu und kann als "static" markiert werden ("Shared" in VisualBasic).
es: El miembro {0} no tiene acceso a los datos de la instancia y se puede marcar como static (Shared en Visual Basic).
fr: Le membre {0} n'accède pas aux données d'instance et peut être marqué comme étant static (Shared en Visual Basic)
it: Il membro {0} non accede ai dati di istanza e può essere contrassegnato come static (Shared in VisualBasic)
ko: {0} 멤버가 인스턴스 데이터에 액세스하지 않으며 static(Visual Basic의 경우 Shared)으로 표시될 수 있습니다.
pl: Element członkowski {0} nie uzyskuje dostępu do danych wystąpień i może zostać oznaczony jako statyczny (Shared w języku VisualBasic).
pt_br: O membro {0} não acessa dados de instância e pode ser marcado como estático (Shared no VisualBasic)
tr: {0} üyesi örnek verilerine erişmiyor ve statik (Visual Basic’te Shared) olarak işaretlenebilir
zh_hans: 成员 {0} 不访问实例数据，可标记为 static (在 Visual Basic 中为 Shared)
zh_hant: 成員 {0} 不會存取執行個體資料，且可標記為 Static (在 VisualBasic 中為 Shared)

# ReviewVisibleEventHandlersTitle
source: Review visible event handlers
cs: Kontrola viditelných obslužných rutin událostí
de: Sichtbare Ereignishandler überprüfen
es: Revisar los controladores de eventos visibles
fr: Passer en revue les gestionnaires d'événements visibles
it: Esaminare i gestori eventi visibili
ko: 표시되는 이벤트 처리기를 검토하세요.
pl: Przejrzyj widoczne procedury obsługi zdarzeń
pt_br: Examinar manipuladores de eventos visíveis
tr: Görünür olay işleyicilerini gözden geçirin
zh_hans: 检查可见的事件处理程序
zh_hant: 檢閱可見的事件處理常式

# ReviewVisibleEventHandlersDescription
source: A public or protected event-handling method was detected. Event-handling methods should not be exposed unless absolutely necessary.
cs: Zjistila se veřejná nebo chráněná metoda zpracování událostí. Metody zpracování událostí by neměly být vystaveny, pokud to není nezbytně nutné.
de: Es wurde eine öffentliche oder geschützte Methode zum Ereignishandling ermittelt. Methoden zum Ereignishandling dürfen nur verfügbar gemacht werden, wenn es absolut erforderlich ist.
es: Se detectó un método de control de eventos público o protegido. No se deberían exponer los métodos de control de eventos a menos que sea absolutamente necesario.
fr: Une méthode publique ou protégée de gestion des événements a été détectée. Les méthodes de gestion des événements ne doivent pas être exposées sauf en cas d'absolue nécessité.
it: È stato rilevato un metodo di gestione eventi public o protected. I metodi di gestione eventi devono essere esposti solo se assolutamente necessario.
ko: public 또는 protected 이벤트 처리 메서드가 검색되었습니다. 이벤트 처리 메서드는 필요한 경우에만 표시해야 합니다.
pl: Wykryto publiczną lub chronioną metodą obsługi zdarzeń. Nie należy ujawniać metod obsługi zdarzeń, o ile nie jest to absolutnie konieczne.
pt_br: Foi detectado um método de manipulação de eventos público ou protegido. Os métodos de manipulação de eventos não devem ser expostos, a menos que absolutamente necessário.
tr: Genel veya korumalı bir olay işleme yöntemi algılandı. Olay işleme yöntemleri kesinlikle gerekli olmadıkça kullanıma sunulmamalıdır.
zh_hans: 检测到公共或受保护的事件处理方法。除非绝对必要，否则不应公开事件处理方法。
zh_hant: 已偵測到公用或受保護的事件處理方法。除非絕對必要，否則不應公開事件處理方法。

# ReviewVisibleEventHandlersMessageSecurity
source: Consider making {0} not externally visible or ensure that it is benign code.
cs: Nastavte metodu {0} tak, aby nebyla externě viditelná, nebo se ujistěte, že se jedná o neškodný kód.
de: Ziehen Sie in Betracht, "{0}" nicht extern sichtbar zu machen, oder stellen Sie sicher, dass es sich um gutartigen Code handelt.
es: Considere hacer que {0} no sea externamente visible o asegúrese de que es código benigno.
fr: Rendez {0} non visible de manière externe, ou vérifiez qu'il s'agit d'un code bénin.
it: Provare a rendere {0} non visibile esternamente o controllare che il codice sia sicuro.
ko: {0}이(가) 외부에 표시되지 않도록 하거나 심각하지 않은 코드인지 확인하세요.
pl: Rozważ przekształcenie elementu {0} w zewnętrznie niewidoczny lub upewnij się, że zawiera niezłośliwy kod.
pt_br: Considere fazer {0} não visível externamente ou garantir que seja código benigno.
tr: {0} öğesini dışarıdan görünmez yapmayı deneyin veya zararsız kod olduğundan emin olun.
zh_hans: 请考虑将 {0} 设为对外部不可见或确保它是良性代码。
zh_hant: 請考慮不要讓 {0} 成為外部可見，或是確認其為良性程式碼。

# ReviewVisibleEventHandlersMessageDefault
source: Consider making {0} not externally visible.
cs: Nastavte metodu {0} tak, aby nebyla externě viditelná.
de: Ziehen Sie in Betracht, "{0}" nicht extern sichtbar zu machen.
es: Considere hacer que {0} no sea externamente visible.
fr: Rendez {0} non visible de manière externe.
it: Provare a rendere {0} non visibile esternamente.
ko: {0}이(가) 외부에 표시되지 않도록 하세요.
pl: Rozważ przekształcenie elementu {0} w zewnętrznie niewidoczny.
pt_br: Considere tornar {0} não visível externamente.
tr: {0} öğesini dışarıdan görünmez yapmayı deneyin.
zh_hans: 请考虑将 {0} 设为对外部不可见。
zh_hant: 請考慮讓 {0} 並非外部可見。

# SealMethodsThatSatisfyPrivateInterfacesTitle
source: Seal methods that satisfy private interfaces
cs: Zapečetění metod, které vyhovují privátním rozhraním
de: Methoden versiegeln, die die Bedingungen privater Schnittstellen erfüllen
es: Sellar los métodos que cumplan las interfaces privadas
fr: Sceller les méthodes qui satisfont les interfaces privées
it: Impostare come sealed i metodi che soddisfano interfacce private
ko: private 인터페이스를 만족하는 메서드를 봉인하세요.
pl: Pieczętuj metody, które spełniają wymagania interfejsów prywatnych
pt_br: Métodos de lacre que satisfazem interfaces privadas
tr: Özel arabirimleri karşılayan mühürleme yöntemleri
zh_hans: 密封满足私有接口的方法
zh_hant: 密封滿足私用介面的方法

# SealMethodsThatSatisfyPrivateInterfacesDescription
source: An inheritable public type provides an overridable method implementation of an internal (Friend in Visual Basic) interface. To fix a violation of this rule, prevent the method from being overridden outside the assembly.
cs: Dědičný veřejný typ poskytuje přepisovatelnou implementaci metody interního rozhraní (Friend ve Visual Basicu). Pokud chcete opravit porušení tohoto pravidla, zabraňte tomu, aby se metoda přepisovala mimo sestavení.
de: Ein vererbbarer öffentlicher Typ stellt eine überschreibbare Methodenimplementierung einer internal-Schnittstelle bereit ("Friend" in Visual Basic). Um einen Verstoß gegen diese Regel zu korrigieren, verhindern Sie ein Außerkraftsetzen der Methode außerhalb der Assembly.
es: Un tipo público heredable proporciona una implementación de método reemplazable de una interfaz internal (Friend en Visual Basic). Para corregir una infracción de esta regla, evite que el método se invalide fuera del ensamblado.
fr: Un type public héritable fournit une implémentation de méthode substituable d'une interface internal (Friend en Visual Basic). Pour corriger une violation de cette règle, empêchez le remplacement de la méthode en dehors de l'assembly.
it: Un tipo public ereditabile fornisce un'implementazione di metodo sottoponibile a override di un'interfaccia internal (Friend in Visual Basic). Per correggere una violazione di questa regola, impedire che l'override del metodo venga eseguito all'esterno dell'assembly.
ko: 상속 가능한 public 형식은 내부(Visual Basic의 경우 Friend) 인터페이스의 재정의 가능한 메서드 구현을 제공합니다. 이 규칙 위반 문제를 해결하려면 어셈블리 외부에서 메서드가 재정의되지 않도록 합니다.
pl: Typ publiczny podlegający dziedziczeniu zapewnia implementację metody z możliwością przesłonięcia interfejsu (Friend w języku Visual Basic). Aby naprawić naruszenie tej reguły, należy uniemożliwić przesłonięcie tej metody poza zespołem.
pt_br: Um tipo público herdável oferece uma implementação de método substituível de uma interface interna (Friend no Visual Basic). Para corrigir uma violação dessa regra, impeça o método de ser substituído fora do assembly.
tr: Devralınabilen bir genel tür, bir iç (Visual Basic’te Friend) arabirimin geçersiz kılınabilecek bir yöntem uygulamasını sağlar. Bu kuralın ihlal edildiği bir durumu düzeltmek için yöntemin bütünleştirilmiş kod dışında geçersiz kılınmasını engelleyin.
zh_hans: 可继承的公共类型提供内部(在 Visual Basic 中为 Friend)接口的可重写方法实现。若要修复与该规则的冲突，请阻止在程序集外部重写该方法。
zh_hant: 可繼承的公用型別提供內部 (在 Visual Basic 中為 Friend) 介面的可覆寫方法實作。若要修正此規則的違規，請讓方法無法於組件之外進行覆寫。

# SealMethodsThatSatisfyPrivateInterfacesMessage
source: Seal methods that satisfy private interfaces
cs: Zapečetění metod, které vyhovují privátním rozhraním
de: Methoden versiegeln, die die Bedingungen privater Schnittstellen erfüllen
es: Sellar los métodos que cumplan las interfaces privadas
fr: Sceller les méthodes qui satisfont les interfaces privées
it: Impostare come sealed i metodi che soddisfano interfacce private
ko: private 인터페이스를 만족하는 메서드를 봉인하세요.
pl: Pieczętuj metody, które spełniają wymagania interfejsów prywatnych
pt_br: Métodos de lacre que satisfazem interfaces privadas
tr: Özel arabirimleri karşılayan mühürleme yöntemleri
zh_hans: 密封满足私有接口的方法
zh_hant: 密封滿足私用介面的方法

source: Remove empty Finalizers
cs: Odebrání prázdných finalizačních metod
de: Leere Finalizer entfernen
es: Quitar los finalizadores vacíos
fr: Supprimer les finaliseurs vides
it: Rimuovere i finalizzatori vuoti
ko: 빈 종료자를 제거하세요.
pl: Usuwaj puste finalizatory
pt_br: Remover finalizadores vazios
tr: Boş Finalizer’ları kaldırın
zh_hans: 移除空终结器
zh_hant: 移除空的完成項

# RemoveEmptyFinalizersDescription
source: Finalizers should be avoided where possible, to avoid the additional performance overhead involved in tracking object lifetime.
cs: Pokud je to možné, neměli byste používat finalizační metody, abyste předešli dalším nárokům na výkon v rámci sledování doby života objektu.
de: Finalizer sollten nach Möglichkeit vermieden werden, um den zusätzlichen Leistungsaufwand zum Nachverfolgen der Objektlebensdauer zu vermeiden.
es: Siempre que pueda, evite los finalizadores debido a la sobrecarga de rendimiento adicional necesaria para el seguimiento de la duración del objeto.
fr: Si possible, évitez d'utiliser les finaliseurs. Vous éviterez ainsi la surcharge de performances qu'implique le suivi de la durée de vie des objets.
it: Quando possibile, è opportuno evitare i finalizzatori per non sovraccaricare ulteriormente le prestazioni durante il rilevamento della durata dell'oggetto.
ko: 개체 수명 추적과 관련된 추가적인 성능 오버헤드를 피하기 위해 가능하면 종료자를 사용하지 마세요.
pl: W miarę możliwości należy unikać finalizatorów, aby nie mnożyć czynników powodujących zmniejszenie wydajności związane ze śledzeniem czasu życia obiektów.
pt_br: Os finalizadores devem ser evitados sempre que possível, para evitar a sobrecarga adicional de desempenho envolvida no acompanhamento do tempo de vida do objeto.
tr: Nesne yaşam döngüsünün izlenmesi için gereken performans ek yükünden kaçınmak amacıyla sonlandırıclar mümkün olduğunca kullanılmamalıdır.
zh_hans: 应尽可能避免使用终结器，避免跟踪对象生存期时产生额外的性能开销。
zh_hant: 請盡量不要使用完成項，以避免在追蹤物件存留期時產生了額外的效能負荷。

source: Do not call overridable methods in constructors
cs: Nevolejte přepsatelné metody v konstruktorech
de: Überschreibbare Methoden in Konstruktoren nicht aufrufen
es: No llamar a métodos reemplazables en constructores
fr: N'appelez pas de méthodes substituables dans les constructeurs
it: Non chiamare metodi sottoponibili a override nei costruttori
ko: 생성자에서 재정의 가능한 메서드를 호출하지 마세요.
pl: Nie wywołuj w konstruktorach metod, które można przesłaniać
pt_br: Não chamar métodos substituíveis em construtores
tr: Oluşturucularda geçersiz kılınabilen yöntemleri çağırmayın
zh_hans: 不要在构造函数中调用可重写的方法
zh_hant: 請勿呼叫建構函式中的可覆寫方法

# DoNotCallOverridableMethodsInConstructorsDescription
source: Virtual methods defined on the class should not be called from constructors. If a derived class has overridden the method, the derived class version will be called (before the derived class constructor is called).
cs: Virtuální metody definované u třídy byste neměli volat z konstruktorů. Pokud odvozená třída přepsala metodu, bude se volat verze odvozené třídy (před voláním konstruktoru odvozené třídy).
de: Für die Klasse definierte virtuelle Methoden dürfen von Konstruktoren nicht aufgerufen werden. Wenn die Methode durch eine abgeleitete Klasse außer Kraft gesetzt wurde, wird die abgeleitete Klassenversion aufgerufen (bevor der Konstruktor der abgeleiteten Klasse aufgerufen wird).
es: Los métodos virtuales definidos en la clase no deben llamarse desde los constructores. Si una clase derivada ha reemplazado el método, se llamará a la versión de clase derivada (antes de que se llame al constructor de clase derivada).
fr: Les méthodes virtuelles définies sur la classe ne doivent pas être appelées à partir de constructeurs. Si une classe dérivée a remplacé la méthode, la version de la classe dérivée est appelée (avant que le constructeur de la classe dérivée ne soit appelé).
it: I metodi virtual definiti sulla classe non devono essere chiamati dai costruttori. Se una classe derivata ha eseguito l'override del metodo, la versione della classe derivata verrà chiamata prima del costruttore della classe derivata.
ko: 클래스에 정의된 가상 메서드는 생성자에서 호출하면 안 됩니다. 파생 클래스가 메서드를 재정의하면 파생 클래스 생성자가 호출되기 전에 파생 클래스 버전이 호출됩니다.
pl: Metody wirtualne zdefiniowane dla klasy nie powinny być wywoływane z konstruktorów. Jeśli klasa pochodna przesłoniła metodę, zostanie wywołana wersja klasy pochodnej (przed wywołaniem konstruktora klasy pochodnej).
pt_br: Os métodos virtuais definidos na classe não devem ser chamados de construtores. Se uma classe derivada tiver substituído o método, a versão da classe derivada será chamada (antes que o construtor da classe derivada seja chamado).
tr: Sınıfta tanımlanan sanal yöntemler oluşturuculardan çağrılmamalıdır. Türetilen bir sınıf yöntemi geçersiz kıldıysa, türetilen sınıf sürümü çağrılır (türetilen sınıf oluşturucusu çağrılmadan önce).
zh_hans: 不应通过构造函数调用类中定义的虚方法。如果某个派生类已重写该虚方法，则将在调用派生类的构造函数前，调用此派生类重写后的方法。
zh_hant: 不應從建構函式呼叫類別上定義的虛擬方法。若衍生的類別覆寫了此方法，就會 (在呼叫衍生類別建構函式之前) 呼叫此衍生類別版本。

# RethrowToPreserveStackDetailsMessage
source: Re-throwing caught exception changes stack information.
cs: Opakované vyvolání zachycené výjimky změní informace zásobníku.
de: Durch ein erneutes Auslösen einer abgefangenen Ausnahme werden die Stapelinformationen geändert.
es: Si inicia de nuevo la excepción detectada, se cambia la información de la pila.
fr: Quand une exception interceptée est levée à nouveau, cela entraîne un changement des informations de la pile.
it: Il rethrow dell'eccezione generata implica la modifica delle informazioni sullo stack.
ko: catch한 예외를 다시 throw하면 스택 정보가 변경됩니다.
pl: Ponowne zgłoszenie przechwyconego wyjątku powoduje zmianę informacji o stosie.
pt_br: Gerar novamente uma exceção detectada altera as informações de pilha.
tr: Yakalanan özel durumun yeniden oluşturulması, yığın bilgilerini değiştirir.
zh_hans: 再次引发捕获到的异常会更改堆栈信息。
zh_hant: 重新擲回攔截到的例外狀況變更堆疊資訊。

# RethrowToPreserveStackDetailsTitle
source: Rethrow to preserve stack details.
cs: Vyvolejte výjimku znovu, aby se zachovaly detaily zásobníku.
de: Erneut ausführen, um Stapeldetails beizubehalten
es: Iniciar de nuevo para preservar los detalles de la pila
fr: Levez à nouveau une exception pour conserver les détails de la pile.
it: Eseguire il rethrow per mantenere i dettagli dello stack.
ko: 스택 정보를 유지하려면 다시 throw하세요.
pl: Ponowie zgłoś wyjątek, aby zachować szczegóły stosu.
pt_br: Gere novamente para preservar os detalhes da pilha.
tr: Yığın ayrıntılarını korumak için yeniden oluşturun.
zh_hans: 再次引发以保留堆栈详细信息。
zh_hant: 重新擲回以保存堆疊詳細資料。

source: Make declaring type internal.
cs: Nastavte deklarační typ jako interní.
de: Legen Sie den deklarierenden Typ als intern fest.
es: Convierta el tipo de declaración en interno.
fr: Rendez le type déclarant interne.
it: Impostare il tipo dichiarante come internal.
ko: 선언 형식을 internal로 설정하세요.
pl: Ustaw typ deklarujący jako wewnętrzny.
pt_br: Torne o tipo declarativo interno.
tr: Bildirim türünü dahili yapın.
zh_hans: 使声明类型为 internal。
zh_hant: 將宣告類型設內部類型。

source: Make declaring type sealed.
cs: Nastavte deklarační typ jako zapečetěný.
de: Legen Sie den deklarierenden Typ als versiegelt fest.
es: Convierta el tipo de declaración en sellado.
fr: Rendez le type déclarant sealed.
it: Impostare il tipo dichiarante come sealed.
ko: 선언 형식을 sealed로 설정하세요.
pl: Ustaw typ deklarujący jako zapieczętowany.
pt_br: Torne o tipo declarativo selado.
tr: Bildirim türünü mühürlü yapın.
zh_hans: 使声明类型为密封。
zh_hant: 將宣告類型設為密封類型。

source: Make member not overridable.
cs: Nastavte člen jako nepřepisovatelný.
de: Legen Sie den Member als nicht überschreibbar fest.
es: Haga que el miembro no sea reemplazable.
fr: Rendez le membre non substituable.
it: Impostare il membro come non sottoponibile a override.
ko: 멤버를 not overridable로 설정하세요.
pl: Ustaw element członkowski jako niemożliwy do przesłonięcia.
pt_br: Torne o membro não substituível.
tr: Üyeyi geçersiz kılınamaz yapın.
zh_hans: 使成员不可重写。
zh_hant: 將成員設為不可覆寫。

# DoNotRaiseExceptionsInExceptionClausesDescription
source: When an exception is raised in a finally clause, the new exception hides the active exception. This makes the original error difficult to detect and debug.
cs: Při vyvolání výjimky v klauzuli finally nová výjimka skryje aktivní výjimku. V takovém případě je totiž obtížné zjistit a ladit původní chybu.
de: Wenn eine Ausnahme in einer finally-Klausel ausgelöst wird, wird die aktive Ausnahme durch die neue Ausnahme verborgen. Dadurch ist der ursprüngliche Fehler schwierig zu erkennen und zu debuggen.
es: Cuando se inicia una excepción en una cláusula finally, la nueva excepción oculta la excepción activa. Esto provoca que el error original sea difícil de detectar y depurar.
fr: Quand une exception est levée dans une clause finally, la nouvelle exception masque l'exception active. Cela rend l'erreur d'origine difficile à détecter et à corriger.
it: Quando viene generata un'eccezione in una clausola finally, la nuova eccezione nasconde quella attiva. Il rilevamento e il debug dell'errore originale diventano quindi più difficili.
ko: finally 절에서 예외가 발생하는 경우 새로운 예외가 활성 예외를 숨깁니다. 이로 인해 원래 오류를 감지하거나 디버그하기 어려워집니다.
pl: Wyjątek zgłoszony z klauzuli finally ukrywa aktywny wyjątek. Utrudnia to wykrycie i zdebugowanie pierwotnego błędu.
pt_br: Quando uma exceção é gerada em uma cláusula finally, a nova exceção oculta a exceção ativa. Isso torna o erro original difícil de ser detectado e depurado.
tr: Bir finally yan tümcesinde özel durum tetiklenirse yeni özel durum etkin özel durumu gizler. Bu, özgün hatanın algılanmasını ve ayıklanmasını zorlaştırır.
zh_hans: 在 finally 子句中引发异常时，新异常将隐藏活动异常。这样会使原来的错误难以检测和调试。
zh_hant: 當 Finally 子句中引發例外狀況時，新的例外狀況會隱藏作用中的例外狀況。這會讓原始錯誤的偵測與偵錯更加困難。

# DoNotRaiseExceptionsInExceptionClausesMessageFinally
source: Do not raise an exception from within a finally clause.
cs: Nevyvolávejte výjimku z klauzule finally.
de: Lösen Sie keine Ausnahme innerhalb einer finally-Klausel aus.
es: No emita una excepción desde una cláusula finally.
fr: Ne levez pas une exception à partir d'une clause finally.
it: Non generare un'eccezione dall'interno di una clausola finally.
ko: finally 절 내에서 예외를 발생시키지 마세요.
pl: Nie zgłaszaj wyjątku z klauzuli finally.
pt_br: Não gere uma exceção de dentro de uma cláusula finally.
tr: Bir finally yan tümcesinin içinden özel durum oluşturmayın.
zh_hans: 不要在 finally 子句中引发异常。
zh_hant: 請勿在 finally 子句中引發例外狀況。

# DoNotRaiseExceptionsInExceptionClausesTitle
source: Do not raise exceptions in finally clauses
cs: Nevyvolávejte výjimky v klauzulích finally
de: Keine Ausnahmen in finally-Klauseln auslösen
es: No emitir excepciones en cláusulas finally
fr: Ne pas lever d'exceptions dans les clauses finally
it: Non generare eccezioni in clausole finally
ko: finally 절에서 예외를 발생시키지 마세요.
pl: Nie zgłaszaj wyjątków w klauzulach finally
pt_br: Não gerar exceções em cláusulas finally
tr: Finally yan tümcelerinde özel durum oluşturmayın
zh_hans: 不要在 finally 子句中引发异常
zh_hant: 請勿在 finally 子句中引發例外狀況
