Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.CodeQuality.Analyzers/Core/QualityGuidelines/xlf/MicrosoftQualityGuidelinesAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, tr, zh_hans, zh_hant

# AvoidPropertySelfAssignmentMessage
source: The property {0} should not be assigned to itself.
cs: Vlastnost {0} nesmí být přiřazena sama k sobě.
de: Die Eigenschaft "{0}" darf nicht sich selbst zugewiesen werden.
es: La propiedad {0} no debe asignarse a sí misma.
it: La proprietà {0} non deve essere assegnata a se stessa.
ko: {0} 속성을 자체에 할당하면 안 됩니다.
pl: Właściwość {0} nie powinna być przypisana do samej siebie.
pt_br: A propriedade {0} não deve ser atribuída a si mesmo.
tr: {0} özelliği kendisine atanmamalıdır.
zh_hans: 不得将属性 {0} 分配给其自身。
zh_hant: 不應將屬性 {0} 指派給屬性自身。

# AvoidPropertySelfAssignmentTitle
source: Do not assign a property to itself.
cs: Nepřiřazujte vlastnost k ní samotné.
de: Weisen Sie eine Eigenschaft nicht sich selbst zu.
es: No asignar una propiedad a sí misma.
it: Non assegnare una proprietà a se stessa.
ko: 속성을 자체에 할당하면 안 됨
pl: Nie przypisuj właściwości do jej samej.
pt_br: Não atribua uma propriedade a si mesmo.
tr: Bir özelliği kendisine atamayın.
zh_hans: 请勿将属性分配给其自身。
zh_hant: 請勿將屬性子派給屬性自身。

# MarkMembersAsStaticCodeFix
source: Make static
cs: Nastavit jako statickou
de: Als statisch festlegen
es: Hacer estático
fr: Rendre statique
it: Imposta come statici
ko: 정적으로 만들기
pl: Ustaw jako statyczne
pt_br: Tornar estático
tr: Statik yap
zh_hans: 设为静态
zh_hant: 使其變成靜態

# MarkMembersAsStaticCodeFix_WarningAnnotation
source: Some references to '{0}' could not be fixed, they should be fixed manually.
cs: Některé odkazy na {0} nešlo opravit. Měly by se opravit ručně.
de: Einige Verweise auf "{0}" konnten nicht korrigiert werden. Korrigieren Sie sie manuell.
es: Algunas referencias a "{0}" podrían no corregirse, así que tendría que hacerlo manualmente.
fr: Des références à '{0}' n'ont pas pu être corrigées, elles doivent être corrigées manuellement.
it: Non è stato possibile correggere alcuni riferimenti a '{0}'. Correggerli manualmente.
ko: '{0}'에 대한 일부 참조를 수정할 수 없습니다. 수동으로 수정해야 합니다.
pl: Nie można naprawić niektórych odwołań do „{0}”. Należy je naprawić ręcznie.
pt_br: Algumas referências a '{0}' não puderam ser corrigidas, elas devem ser corrigidas manualmente.
tr: Bazı '{0}' başvuruları düzeltilemedi, bunları kendiniz düzeltmelisiniz.
zh_hans: 无法修复对“{0}”的部分引用，应手动修复它们。
zh_hant: 無法修正對 '{0}' 的某些參考，應予以手動修正。

# UseLiteralsWhereAppropriateTitle
source: Use literals where appropriate
cs: Tam, kde je to vhodné, použijte literály
de: Nach Möglichkeit Literale verwenden
es: Usar literales cuando resulte apropiado
fr: Utiliser des littéraux quand cela est approprié
it: Usa valori letterali dove appropriato
ko: 적합한 리터럴을 사용하세요.
pl: Używaj literałów w odpowiednich miejscach
pt_br: Usar literais sempre que apropriado
tr: Uygun durumlarda sabit değerler kullanın
zh_hans: 在合适的位置使用文本
zh_hant: 適當時機使用常值

# UseLiteralsWhereAppropriateDescription
source: A field is declared static and read-only (Shared and ReadOnly in Visual Basic), and is initialized by using a value that is computable at compile time. Because the value that is assigned to the targeted field is computable at compile time, change the declaration to a const (Const in Visual Basic) field so that the value is computed at compile time instead of at run?time.
cs: Pole je deklarováno jako statické a jen ke čtení (ve Visual Basicu jako Shared a ReadOnly) a je inicializováno pomocí hodnoty, kterou lze při kompilaci vypočítat. Vzhledem k tomu, že hodnotu přidruženou k cílovému poli je možné při kompilaci vypočítat, změňte deklaraci na pole const (Const ve Visual Basicu), aby se tato hodnota vypočítala při kompilaci, a nikoli za běhu.
de: Ein Feld wird als "static" und "read-only" ("Shared" und "ReadOnly" in Visual Basic) deklariert und anhand eines Werts initialisiert, der zur Kompilierzeit berechnet werden kann. Da der dem Zielfeld zugewiesene Wert zur Kompilierzeit berechnet werden kann, ändern Sie die Deklaration in ein const-Feld (Const in Visual Basic), sodass der Wert statt zur Laufzeit zur Kompilierzeit berechnet wird.
es: Se declara un campo static y readonly (Shared y ReadOnly en Visual Basic) y se inicializa con un valor que se puede calcular durante la compilación. Dado que el valor asignado al campo de destino se calcula en tiempo de compilación, cambie la declaración a un campo const (Const en Visual Basic) para que el valor se calcule en tiempo de compilación en lugar de en tiempo de ejecución.
fr: Un champ est déclaré comme étant static et en lecture seule (Shared et ReadOnly en Visual Basic), et est initialisé à l'aide d'une valeur calculable au moment de la compilation. Dans la mesure où la valeur assignée au champ ciblé est calculable au moment de la compilation, changez la déclaration en la remplaçant par un champ const (Const en Visual Basic) pour que la valeur soit calculée au moment de la compilation et non au moment de l'exécution.
it: Un campo viene dichiarato static e read-only (Shared e ReadOnly in Visual Basic) e viene inizializzato usando un valore calcolabile in fase di compilazione. Dal momento che il valore assegnato al campo di destinazione è calcolabile in fase di compilazione, modificare la dichiarazione in un campo const (Const in Visual Basic) in modo che il calcolo del valore venga effettuato in fase di compilazione e non in fase di esecuzione.
ko: 필드가 static 및 읽기 전용(Visual Basic의 경우 Shared 및 ReadOnly)으로 선언되었으며 컴파일 시간에 계산할 수 있는 값을 사용하여 초기화되었습니다. 대상 필드에 할당된 값을 컴파일 시간에 계산할 수 있으므로 이 값이 런타임 대신 컴파일 시간에 계산될 수 있도록 선언을 const(Visual Basic의 경우 Const)로 변경하세요.
pl: Pole zostało zadeklarowane jako statyczne i tylko do odczytu (Shared i ReadOnly w języku Visual Basic) i zainicjowane przy użyciu wartości obliczanych w czasie kompilacji. Ponieważ wartość przypisana do pola docelowego jest obliczana w czasie kompilacji, należy zmienić deklarację na pole wartości stałej (Const w języku Visual Basic), aby wartość była obliczana w czasie kompilacji, a nie w czasie wykonywania.
pt_br: Um campo é declarado como estático e somente leitura (Shared e ReadOnly no Visual Basic) e inicializado usando um valor que pode ser computado no tempo de compilação. Como o valor atribuído ao campo direcionado pode ser computado no tempo de compilação, altere a declaração para um campo const (Const no Visual Basic) para que o valor seja computado no tempo de compilação em vez de no tempo de execução.
tr: Alanlar statik ve salt okunur (Visual Basic’te Shared ve ReadOnly) olarak bildirilir ve derleme zamanında hesaplanabilen bir değer kullanılarak başlatılır. Hedeflenen alana atanmış değer derleme zamanında hesaplanabildiğinden, bir sabit (Visual Basic’te Const) alanına yönelik bildirimi, değerin çalışma zamanı yerine derleme zamanında hesaplanacağı şekilde değiştirin.
zh_hans: 字段声明为 static 和 read-only (在 Visual Basic 中为 Shared 和 ReadOnly)，并且使用编译时可计算的值进行初始化。由于分配给目标字段的值在编译时是可计算的，因此将声明更改为常量(在 Visual Basic 中为 Const)，以便在编译时而非运行时计算值。
zh_hant: 宣告為靜態及唯讀的欄位 (在 Visual Basic 中為 Shared 及 ReadOnly)，使用編譯時期可計算的值初始化。因為指派給目標欄位的值，可於編譯期間進行計算，將宣告變更為 Const (在 Visual Basic 中為 Const) 欄位，所以此值可於編譯期間計算，而非於執行階段計算。

# UseLiteralsWhereAppropriateMessageDefault
source: Field '{0}' is declared as 'static readonly' but is initialized with a constant value. Mark this field as 'const' instead.
cs: Pole {0} je deklarováno jako static readonly, ale je inicializováno pomocí konstantní hodnoty. Označte toto pole raději jako const.
de: Das Feld "{0}" wird als "static readonly" deklariert, wird jedoch mit einem konstanten Wert initialisiert. Markieren Sie dieses Feld stattdessen als "const".
es: El campo "{0}" se declara como "static readonly" pero se inicializa con un valor constante. Marque este campo como "const".
fr: Le champ '{0}' est déclaré comme étant 'static readonly' mais il est initialisé avec une valeur de constante. À la place, marquez ce champ comme étant un champ 'const'.
it: Il campo '{0}' è dichiarato come 'static readonly' ma viene inizializzato con un valore constant. Contrassegnare questo campo come 'const'.
ko: '{0}' 필드가 'static readonly'로 선언되었지만 상수 값으로 초기화되었습니다. 이 필드를 'const'로 표시하세요.
pl: Pole „{0}” zostało zadeklarowane jako statyczne pole tylko do odczytu, ale zainicjowano je za pomocą wartości stałej. Zamiast tego oznacz to pole jako pole wartości stałej.
pt_br: O campo '{0}' é declarado como 'static readonly', mas inicializado com um valor constante. Em vez disso, marque esse campo como 'const'.
tr: '{0}' alanı 'static readonly' olarak bildirilmiş ama sabit bir değerle başlatılıyor. Bunun yerine, bu alanı 'const' olarak işaretleyin.
zh_hans: 虽然字段“{0}”声明为 "static readonly"，但它是用常量值初始化的。请将此字段标记为 "const"。
zh_hant: 欄位 '{0}' 宣告為 'static readonly'，但卻使用了常數值進行初始化。將此欄位改標記為 'const'。

# UseLiteralsWhereAppropriateMessageEmptyString
source: Field '{0}' is declared as 'static readonly' but is initialized with an empty string (""). Mark this field as 'const' instead.
cs: Pole {0} je deklarováno jako static readonly, ale je inicializováno pomocí prázdného řetězce (""). Označte toto pole raději jako const.
de: Das Feld "{0}" wird als "static readonly" deklariert, wird jedoch mit einer leeren Zeichenfolge ("") initialisiert. Markieren Sie dieses Feld stattdessen als "const".
es: El campo "{0}" se declara como "static readonly" pero se inicializa con una cadena vacía (""). Marque este campo como "const".
fr: Le champ '{0}' est déclaré comme étant 'static readonly' mais il est initialisé avec une chaîne vide (""). À la place, marquez ce champ comme étant un champ 'const'.
it: Il campo '{0}' è dichiarato come 'static readonly' ma viene inizializzato con una stringa vuota (""). Contrassegnare questo campo come 'const'.
ko: '{0}' 필드가 'static readonly'로 선언되었지만 빈 문자열("")로 초기화되었습니다. 이 필드를 'const'로 표시하세요.
pl: Pole „{0}” zostało zadeklarowane jako statyczne pole tylko do odczytu, ale zainicjowano je za pomocą pustego ciągu (""). Zamiast tego oznacz to pole jako pole wartości stałej.
pt_br: O campo '{0}' é declarado como 'static readonly', mas inicializado com uma cadeia de caracteres vazia (""). Em vez disso, marque esse campo como 'const'.
tr: '{0}' alanı 'static readonly' olarak bildirilmiş ama boş bir dizeyle ("") başlatılıyor. Bunun yerine, bu alanı 'const' olarak işaretleyin.
zh_hans: 虽然字段“{0}”声明为 "static readonly"，但它是用空字符串 ("") 初始化的。请将此字段标记为 "const"。
zh_hant: 欄位 '{0}' 宣告為 'static readonly'，但卻使用了空字串 ("") 進行初始化。將此欄位改標記為 'const'。

# DoNotInitializeUnnecessarilyTitle
source: Do not initialize unnecessarily
cs: Nepoužívejte inicializaci zbytečně
de: Keine unnötige Initialisierung
es: No inicializar innecesariamente
fr: Ne pas effectuer d'initialisation inutilement
it: Non eseguire inutilmente l'inizializzazione
ko: 불필요한 초기화를 수행하지 마세요.
pl: Nie inicjuj niepotrzebnie
pt_br: Não inicializar desnecessariamente
tr: Gerekmediği durumlarda başlatmayın
zh_hans: 避免进行不必要的初始化
zh_hant: 請勿進行非必要的初始化

# DoNotInitializeUnnecessarilyDescription
source: The common language runtime initializes all fields to their default values before running the constructor. In most cases, initializing a field to its default value in a constructor is redundant, which degrades performance and adds to maintenance costs. One case where it is not redundant occurs when the constructor calls another constructor of the same class or a base class constructor and that constructor initializes the field to a non-default value. In this case, changing the value of the field back to its default value can be appropriate.
cs: Před spuštění konstruktoru modul CLR (Common Language Runtime) iniciuje u všech polí nastavení výchozích hodnot. Ve většině případů je nastavení pole na výchozí hodnotu v konstruktoru nadbytečné, snižuje výkon a navyšuje náklady na údržbu. Jediným případem, kdy nadbytečné není, je tehdy, když konstruktor volá jiný konstruktor stejné třídy nebo konstruktor základní třídy a ten u pole nastaví nevýchozí hodnotu. V této situaci je změna hodnoty pole zpět na výchozí hodnotu vhodná.
de: Die Common Language Runtime initialisiert alle Felder mit ihren Standardwerten, bevor der Konstruktor ausgeführt wird. In den meisten Fällen ist das Initialisieren eines Felds mit seinem Standardwert redundant und führt zu einer Leistungsminderung und zusätzlichen Wartungskosten. Ein Fall, in dem es nicht redundant ist, tritt ein, wenn der Konstruktor einen anderen Konstruktor derselben Klasse oder einen Basisklassenkonstruktor aufruft und wenn dieser Konstruktor das Feld mit einem anderen als dem Standardwert initialisiert. In diesem Fall kann das Ändern des Feldwerts auf den Standardwert sinnvoll sein.
es: El Common Language Runtime inicializa todos los campos en sus valores predeterminados antes de ejecutar el constructor. En la mayoría de los casos, inicializar un campo a su valor predeterminado en un constructor es redundante, lo que disminuye el rendimiento y agrega costos de mantenimiento. Un caso en el que no es redundante se produce cuando el constructor llama a otro constructor de la misma clase o a un constructor de clase base, y este inicializa el campo a un valor que no es el predeterminado. En este caso, volver a establecer el valor del campo en su valor predeterminado puede ser adecuado.
fr: Le Common Language Runtime initialise tous les champs en fonction de leurs valeurs par défaut avant d'exécuter le constructeur. Dans la plupart des cas, l'initialisation d'un champ en fonction de sa valeur par défaut dans un constructeur est redondante, ce qui entraîne une dégradation des performances et une augmentation des coûts de maintenance. Il n'existe pas de redondance quand le constructeur appelle un autre constructeur de même classe ou un constructeur de classe de base, et que le constructeur initialise le champ en fonction d'une autre valeur que la valeur par défaut. Dans ce cas, il peut s'avérer approprié de changer la valeur du champ en le remplaçant par sa valeur par défaut.
it: Common Language Runtime inizializza tutti i campi in base ai relativi valori predefiniti prima di eseguire il costruttore. Nella maggior parte dei casi l'inizializzazione di un campo in base al valore predefinito in un costruttore è un'operazione ridondante e implica un calo delle prestazioni oltre a un aumento dei costi di manutenzione. Questa operazione non è ridondante quando il costruttore chiama un altro costruttore della stessa classe o un costruttore della classe di base e tale costruttore inizializza il campo in base a un valore non predefinito. In questo caso può essere appropriato ripristinare il valore predefinito del campo.
ko: 공용 언어 런타임은 생성자를 실행하기 전에 모든 필드를 기본값으로 초기화합니다. 대부분의 경우 생성자에서 필드를 기본값으로 초기화하는 것은 중복되는 작업이며 이로 인해 성능이 저하되고 유지 관리 비용이 추가로 발생합니다. 생성자가 동일한 클래스의 다른 생성자 또는 기본 클래스 생성자를 호출하고 해당 생성자가 필드를 기본값이 아닌 값으로 초기화하는 경우는 중복되는 작업이 아닙니다. 이 경우 필드 값을 기본값으로 초기화하는 작업이 적합할 수 있습니다.
pl: Środowisko uruchomieniowe CLR inicjuje wszystkie pola do ich domyślnych wartości przed uruchomieniem konstruktora. W większości przypadków zainicjowanie pola do jego domyślnej wartości jest zbędne, ponieważ zmniejsza wydajność i zwiększa koszty utrzymania. Jedyny przypadek, gdy nie jest to zbędne, występuje, gdy konstruktor wywołuje inny konstruktor tej samej klasy lub konstruktor klasy podstawowej, a ten konstruktor inicjuje pole do wartości innej niż domyślna. W tym przypadku zmiana wartości pola z powrotem na wartość domyślną może być odpowiednia.
pt_br: O Common Language Runtime inicializa todos os campos para seus valores padrão antes de executar o construtor. Na maioria dos casos, inicializar um campo para seu valor padrão em um construtor é redundante, o que prejudica o desempenho e aumenta os custos de manutenção. Um caso em que isso não é redundante ocorre quando o construtor chama outro construtor da mesma classe ou um construtor de classe base e esse construtor inicializa o campo para um valor não padrão. Nesse caso, alterar o valor do campo de volta para seu valor padrão pode ser apropriado.
tr: Ortak dil çalışma zamanı, oluşturucuyu çalıştırmadan önce tüm alanları varsayılan değerlerinde başlatır. Çoğu durumda, oluşturucuda bir alanın varsayılan değerinde başlatılması gereksizdir ve performansı düşürmesinin yanı sıra ek bakım maliyetleri doğurur. Bunun gereksiz olmadığı bir durum, oluşturucunun aynı sınıftan başka bir oluşturucuyu veya temel sınıf oluşturucusunu çağırdığı ve bu oluşturucunun alanı varsayılan olmayan bir değerde başlattığı durumdur. Bu durumda, alanın değerinin varsayılan değerine döndürülmesi uygun olabilir.
zh_hans: 在运行构造函数前，公共语言运行时将所有字段都初始化为其默认值。在大多数情况下，在构造函数中将字段初始化为其默认值是多余的行为，这会降低性能并且增加维护成本。但在构造函数调用相同类的另一构造函数或基类构造函数(此构造函数将字段初始化为非默认值)时，不存在多余的情况。在这种情况下，将字段值更改回其默认值是恰当的行为。
zh_hant: Common Language Runtime 會先將所有欄位初始化成其預設值，然後再執行建構函式。在大多數的情況下，在建構函式中將欄位初始化成其預設值並非必要，如此會降低效能並增加維護成本。不至於畫蛇添足的一個情況是，當建構函式呼叫相同類別的另一個建構函式或基底類別建構函式時，該建構函式會將欄位初始化為非預設值。在此情況下，很適合將欄位值變更回其預設值。

# DoNotInitializeUnnecessarilyMessage
source: Do not initialize unnecessarily
cs: Nepoužívejte inicializaci zbytečně
de: Keine unnötige Initialisierung
es: No inicializar innecesariamente
fr: Ne pas effectuer d'initialisation inutilement
it: Non eseguire inutilmente l'inizializzazione
ko: 불필요한 초기화를 수행하지 마세요.
pl: Nie inicjuj niepotrzebnie
pt_br: Não inicializar desnecessariamente
tr: Gerekmediği durumlarda başlatmayın
zh_hans: 避免进行不必要的初始化
zh_hant: 請勿進行非必要的初始化

# PreferJaggedArraysOverMultidimensionalTitle
source: Prefer jagged arrays over multidimensional
cs: Upřednostnění vícenásobných polí před multidimenzionálními
de: Jagged Arrays mehrdimensionalen Arrays vorziehen
es: Preferir las matrices escalonadas antes que multidimensionales
fr: Préférer les tableaux en escalier aux tableaux multidimensionnels
it: Preferire matrici di matrici rispetto a matrici multidimensionali
ko: 다차원 배열보다 가변 배열을 사용하세요.
pl: Wybieraj tablice nieregularne zamiast wielowymiarowych
pt_br: Prefira matrizes denteadas a matrizes multidimensionais
tr: Çok boyutlu yerine düzensiz dizileri tercih edin
zh_hans: 与多维数组相比，首选使用交错数组
zh_hant: 多維度上建議使用不規則陣列

# PreferJaggedArraysOverMultidimensionalDescription
source: A jagged array is an array whose elements are arrays. The arrays that make up the elements can be of different sizes, leading to less wasted space for some sets of data.
cs: Vícenásobné pole je pole, jehož prvky jsou pole. Pole, která tvoří tyto prvky, mohou mít různou velikost, což u některých sad dat může vést k lépe využitému místu.
de: Ein Jagged Array ist ein Array, dessen Elemente ebenfalls Arrays sind. Diese Arrayelemente können verschiedene Größen aufweisen, sodass für einige Datenmengen weniger Platz vergeudet wird.
es: Una matriz escalonada es una matriz cuyos elementos son matrices. Las matrices que constituyen los elementos pueden ser de tamaños diferentes, reduciendo el espacio desaprovechado para algunos conjuntos de datos.
fr: Un tableau en escalier est un tableau dont les éléments sont des tableaux. Les tableaux qui composent les éléments peuvent être de tailles distinctes, ce qui réduit l'espace perdu pour certains jeux de données.
it: Una matrice di matrici è una matrice i cui elementi sono costituiti da matrici. Le matrici che costituiscono gli elementi possono essere di dimensioni diverse, di conseguenza la quantità di spazio inutilizzato sarà inferiore per alcuni set di dati.
ko: 요소가 배열인 배열이 가변 배열입니다. 요소를 구성하는 배열의 크기는 다양하기 때문에 일부 데이터 집합의 공간을 절약할 수 있습니다.
pl: Tablica nieregularna jest tablicą, której elementami są tablice. Tablice będące elementami mogą mieć różny rozmiar, co sprawia, że w przypadku niektórych zestawów danych marnowane jest mniej miejsca.
pt_br: Uma matriz denteada é uma matriz cujos elementos são matrizes. As matrizes que compõem os elementos podem ser de tamanhos diferentes, levando a menos espaço perdido para alguns conjuntos de dados.
tr: Düzensiz dizi, öğeleri diziler halinde olan bir dizidir. Öğeleri oluşturan diziler farklı boyutlarda olabileceğinden, bazı veri kümeleri için daha az alan israfı sağlar.
zh_hans: 交错数组的元素为数组。构成元素的数组可以大小不同，使某些数据集的浪费空间减少。
zh_hant: 不規則陣列是其元素為陣列的陣列。構成元素的這些陣列可能大小不一，讓某些資料集可以少浪費一些空間。

# PreferJaggedArraysOverMultidimensionalMessageDefault
source: {0} is a multidimensional array. Replace it with a jagged array if possible.
cs: {0} je multidimenzionální pole. Pokud je to možné, nahraďte ho vícenásobným polem.
de: "{0}" ist ein mehrdimensionales Array. Ersetzen Sie es nach Möglichkeit durch ein Jagged Array.
es: {0} es una matriz multidimensional. Sustitúyala por una matriz escalonada si fuera posible.
fr: {0} est un tableau multidimensionnel. Remplacez-le, si possible, par un tableau en escalier.
it: {0} è una matrice multidimensionale. Se possibile, sostituirla con una matrice di matrici.
ko: {0}은(는) 다차원 배열입니다. 가능한 경우 가변 배열로 바꾸세요.
pl: {0} jest tablicą wielowymiarową. Należy ją zastąpić tablicą nieregularną, jeśli to możliwe.
pt_br: {0} é uma matriz multidimensional. Se possível, substitua-a por uma matriz denteada.
tr: {0}, çok boyutlu bir dizi. Mümkünse bunu düzensiz bir diziyle değiştirin.
zh_hans: {0} 是多维数组。如有可能，请使用交错数组来替代它。
zh_hant: {0} 是多維度陣列。如果可能，請用不規則陣列取代它。

# PreferJaggedArraysOverMultidimensionalMessageReturn
source: {0} returns a multidimensional array of {1}. Replace it with a jagged array if possible.
cs: {0} vrací multidimenzionální pole {1}. Pokud je to možné, nahraďte ho vícenásobným polem.
de: "{0}" gibt ein mehrdimensionales Array von "{1}" zurück. Ersetzen Sie es nach Möglichkeit durch ein Jagged Array.
es: {0} devuelve una matriz multidimensional de {1}. Sustitúyala por una matriz escalonada si fuera posible.
fr: {0} retourne un tableau multidimensionnel de {1}. Remplacez-le, si possible, par un tableau en escalier.
it: {0} restituisce una matrice multidimensionale di {1}. Se possibile, sostituirla con una matrice di matrici.
ko: {0}이(가) {1}의 다차원 배열을 반환합니다. 가능한 경우 가변 배열로 바꾸세요.
pl: {0} zwraca tablicę wielowymiarową {1}. Należy ją zastąpić tablicą nieregularną, jeśli to możliwe.
pt_br: {0} retorna uma matriz multidimensional de {1}. Se possível, substitua-a por uma matriz denteada.
tr: {0}, çok boyutlu {1} dizisini döndürüyor. Mümkünse bunu düzensiz bir diziyle değiştirin.
zh_hans: {0} 返回多维数组 {1}。如有可能，请使用交错数组来替代它。
zh_hant: {0} 會傳回多維度陣列 {1}。如果可能，請用不規則陣列取代它。

# PreferJaggedArraysOverMultidimensionalMessageBody
source: {0} uses a multidimensional array of {1}. Replace it with a jagged array if possible.
cs: {0} používá multidimenzionální pole {1}. Pokud je to možné, nahraďte ho vícenásobným polem.
de: "{0}" verwendet ein mehrdimensionales Array von "{1}". Ersetzen Sie es nach Möglichkeit durch ein Jagged Array.
es: {0} utiliza una matriz multidimensional de {1}. Sustitúyala por una matriz escalonada si fuera posible.
fr: {0} utilise un tableau multidimensionnel de {1}. Remplacez-le, si possible, par un tableau en escalier.
it: {0} usa una matrice multidimensionale di {1}. Se possibile, sostituirla con una matrice di matrici.
ko: {0}이(가) {1}의 다차원 배열을 사용합니다. 가능한 경우 가변 배열로 바꾸세요.
pl: {0} powoduje użycie tablicy wielowymiarowej {1}. Należy ją zastąpić tablicą nieregularną, jeśli to możliwe.
pt_br: {0} usa uma matriz multidimensional de {1}. Se possível, substitua-a por uma matriz denteada.
tr: {0}, çok boyutlu {1} dizisini kullanıyor. Mümkünse bunu düzensiz bir diziyle değiştirin.
zh_hans: {0} 使用多维数组 {1}。如有可能，请使用交错数组来替代它。
zh_hant: {0} 使用多維度陣列 {1}。如果可能，請用不規則陣列取代它。

# MarkMembersAsStaticTitle
source: Mark members as static
cs: Označení členů jako statických
de: Member als statisch markieren
es: Marcar miembros como static
fr: Marquer les membres comme étant static
it: Contrassegnare i membri come static
ko: 멤버를 static으로 표시하세요.
pl: Oznaczaj elementy członkowskie jako statyczne
pt_br: Marcar membros como estáticos
tr: Üyeleri statik olarak işaretleyin
zh_hans: 将成员标记为 static
zh_hant: 將成員標記為靜態
