Repository: dotnet/roslyn-analyzers
Catalog: src/Microsoft.CodeQuality.Analyzers/Core/QualityGuidelines/xlf/MicrosoftQualityGuidelinesAnalyzersResources.*.xlf
Languages: cs, de, es, fr, it, ko, pl, pt_br, tr, zh_hans, zh_hant

# UseLiteralsWhereAppropriateCodeActionTitle
source: Change to constant
cs: Změna na konstantu
de: In Konstante ändern
es: Cambiar a constant
fr: Changer en constante
it: Cambiare in constant
ko: 상수로 변경하세요.
pl: Zmień na stałą
pt_br: Alterar para constante
tr: Sabit olarak değiştirin
zh_hans: 更改为常量
zh_hant: 變更為常數

# AvoidDuplicateElementInitializationDescription
source: Indexed elements in objects initializers must initialize unique elements. A duplicate index might overwrite a previous element initialization.
cs: Indexované prvky v inicializátorech objektů musí inicializovat jedinečné prvky. Duplicitní index může přepsat předchozí inicializaci prvku.
de: Indizierte Elemente in Objektinitialisierern müssen eindeutige Elemente initialisieren. Durch einen doppelten Index kann eine vorherige Elementinitialisierung überschrieben werden.
es: Los elementos indexados en inicializadores de objetos deben inicializar elementos únicos. Un índice duplicado podría sobrescribir una inicialización de elementos anterior.
fr: Les éléments indexés dans des initialiseurs d'objets doivent initialiser des éléments uniques. Un index dupliqué peut remplacer une précédente initialisation d'éléments.
it: Gli elementi indicizzati negli inizializzatori di oggetti devono inizializzare elementi univoci. Un indice duplicato potrebbe sovrascrivere un'inizializzazione di oggetti precedente.
ko: 개체 이니셜라이저의 인덱싱된 요소는 고유한 요소를 초기화해야 합니다. 중복된 인덱스는 이전 요소의 초기화를 덮어쓸 수 있습니다.
pl: Indeksowane elementy w inicjatorach obiektów muszą inicjować unikatowe elementy. Zduplikowany indeks może powodować zastąpienie wcześniejszego zainicjowania elementu.
pt_br: Os elementos indexados em inicializadores de objetos devem inicializar elementos únicos. Um índice duplicado pode substituir uma inicialização do elemento anterior.
tr: Nesne başlatıcılarındaki dizine eklenmiş öğeler, benzersiz öğeleri başlatmalıdır. Yinelenen dizin, önceki öğe başlatmasının üzerine yazabilir.
zh_hans: 对象初始值设定项中已索引的元素必须初始化唯一元素。重复索引可能覆盖先前的元素初始值设定项。
zh_hant: 物件初始設定式中的索引元素必須將唯一元素初始化。重複的索引可能會覆寫先前的元素初始化。

# AvoidDuplicateElementInitializationMessage
source: The element at index [{0}] has already been initialized. Previous initializations of this element may be overwritten.
cs: Prvek s indexem [{0}] už je inicializovaný. Předchozí inicializace tohoto prvku mohou být přepsány.
de: Das Element bei Index [{0}] wurde bereits initialisiert. Vorherige Initialisierungen dieses Elements werden möglicherweise überschrieben.
es: El elemento del índice [{0}] ya se ha inicializado. Es posible que las inicializaciones anteriores de este elemento se sobrescriban.
fr: L'élément à l'index [{0}] a déjà été initialisé. Les précédentes initialisations de cet élément peuvent être remplacées.
it: L'elemento alla posizione di indice [{0}] è già stato inizializzato. Le inizializzazioni precedenti di questo elemento potrebbero essere sovrascritte.
ko: 인덱스 [{0}]의 요소가 이미 초기화되었습니다. 이 요소의 이전 초기화는 덮어쓰일 수 있습니다.
pl: Element pod indeksem [{0}] został już zainicjowany. Wcześniejsze inicjowanie tego elementu może zostać zastąpione.
pt_br: O elemento no índice [{0}] já foi inicializado. As inicializações anteriores desse elemento podem ser substituídas.
tr: [{0}] dizinindeki öğe zaten başlatılmış. Bu öğenin önceki başlatmalarının üzerine yazılabilir.
zh_hans: 索引 [{0}] 处的元素已进行初始化。可能覆盖此元素先前的初始值设定项。
zh_hant: 已將位於索引 [{0}] 的元素初始化。可能會覆寫此元素先前的初始化。

# AvoidDuplicateElementInitializationTitle
source: Do not duplicate indexed element initializations
cs: Neduplikujte inicializace indexovaných prvků.
de: Keine Initialisierungen indizierter Elemente duplizieren
es: No duplicar inicializaciones de elementos indexados
fr: Ne pas dupliquer les initialisations d'éléments indexés
it: Non duplicare inizializzazioni di elementi indicizzati
ko: 인덱싱된 요소의 초기화는 복제하면 안 됩니다.
pl: Nie duplikuj inicjowania indeksowanych elementów
pt_br: Não duplicar inicializações de elementos indexados
tr: Dizine eklenmiş öğe başlatmalarını yineleme
zh_hans: 不要复制已索引的元素初始值设定项
zh_hant: 請勿複製索引元素初始化

# ValidateArgumentsOfPublicMethodsDescription
source: An externally visible method dereferences one of its reference arguments without verifying whether that argument is null (Nothing in Visual Basic). All reference arguments that are passed to externally visible methods should be checked against null. If appropriate, throw an ArgumentNullException when the argument is null or add a Code Contract precondition asserting non-null argument. If the method is designed to be called only by known assemblies, you should make the method internal.
cs: Externě viditelná metoda přistupuje přes ukazatel k datům jednoho ze svých atributů odkazů bez ověření, jestli argument není null (Nothing v jazyce Visual Basic). Ve všech argumentech odkazů, které se předávají externě viditelným metodám, by se měla kontrolovat hodnota null. V případě potřeby vyvolejte ArgumentNullException, když je argument null, nebo přidejte předběžnou podmínku Code Contract, která vyhodnocuje argument, který není null. Pokud je metoda navržená tak, že ji budou volat jen známá sestavení, měli byste ji převést na interní metodu.
de: Eine extern sichtbare Methode dereferenziert eines der zugehörigen Verweisargumente, ohne dass geprüft wird, ob das Argument NULL ist ("Nothing" in Visual Basic). Alle Verweisargumente, die an extern sichtbare Methoden übergeben werden, müssen auf NULL überprüft werden. Lösen Sie gegebenenfalls eine ArgumentNullException aus, wenn das Argument NULL ist, oder fügen Sie eine Codevertragsvorbedingung hinzu, die ein Nicht-NULL-Argument durchsetzt. Wenn die Methode darauf ausgelegt ist, nur von bekannten Assemblys aufgerufen zu werden, müssen Sie die Methode als intern festlegen.
es: Un método visible externamente desreferencia uno de sus argumentos de referencia sin comprobar si ese argumento es NULL (Nothing en Visual Basic). Todos los argumentos de referencia pasados a métodos visibles externamente deben comprobarse para ver si son NULL. Si procede, inicie una excepción ArgumentNullException cuando el argumento sea NULL o agregue una condición previa de contrato de código con aserción de un argumento no nulo. Si el método está diseñado para que solo lo llamen ensamblados conocidos, debería convertirlo en interno.
fr: Une méthode visible de manière externe déréférence un de ses arguments de référence sans vérifier si cet argument a une valeur null (Nothing en Visual Basic). Tous les arguments de référence passés à des méthodes visibles de manière externe doivent faire l'objet d'une vérification permettant de déterminer s'ils ont une valeur null. Le cas échéant, ArgumentNullException doit être levé quand l'argument a une valeur null, ou vous devez ajouter une condition préalable au contrat de code pour garantir que l'argument a une valeur non null. Si la méthode est conçue pour être appelée uniquement par des assemblys connus, rendez la méthode interne.
it: Un metodo visibile esternamente risolve i riferimenti a uno dei relativi argomenti di riferimento senza verificare se tale argomento è null (Nothing in Visual Basic). Tutti gli argomenti di riferimento passati a metodi visibili esternamente devono essere verificati in base a valori Null. Se appropriato, generare un'eccezione ArgumentNullException quando l'argomento è Null o aggiungere una precondizione del contratto di codice con asserzione dell'argomento non Null. Se il metodo è concepito per essere chiamato solo da assembly noti, è necessario impostare il metodo come interno.
ko: 외부에 표시되는 메서드는 인수가 null(Visual Basic의 Nothing)인지 확인하지 않고 참조 인수 중 하나를 역참조합니다. 외부에 표시되는 메서드에 전달되는 모든 참조 인수가 null인지 확인해야 합니다. 필요한 경우 인수가 null이면 ArgumentNullException을 throw하고, 그렇지 않으면 null이 아닌 인수를 어설션하는 코드 계약 사전 조건을 추가합니다. 메서드가 알려진 어셈블리에서만 호출되도록 설계되어 있으면 메서드를 internal로 설정해야 합니다.
pl: Zewnętrznie widoczna metoda umożliwia wyłuskanie jednego z jej argumentów odwołania bez weryfikowania, czy ten argument ma wartość null (wartość Nothing w języku Visual Basic). Wszystkie argumenty odwołania przekazywane do zewnętrznie widocznych metod powinny być sprawdzane pod kątem wartości null. Jeśli ma to uzasadnienie, należy zgłosić wyjątek ArgumentNullException, gdy argument ma wartość null, lub dodać warunek wstępny kontraktu kodu potwierdzający argument o wartości innej niż null. Jeśli metoda została zaprojektowana do wywoływania jedynie przez znane zestawy, powinna zostać ustawiona jako wewnętrzna.
pt_br: Um método visível externamente desreferencia um de seus argumentos de referência sem verificar se esse argumento é nulo (Nothing no Visual Basic). É necessário verificar se cada argumento de referência passado aos métodos visíveis externamente é nulo. Se necessário, gere uma exceção ArgumentNullException quando o argumento for nulo ou adicione uma pré-condição de Contrato de Código declarando o argumento como não nulo. Se o método for criado para ser chamado somente por assemblies conhecidos, faça com que ele seja interno.
tr: Dışarıdan görünen metot, bağımsız değişkenin null (Visual Basic’te Nothing) olup olmadığını doğrulamadan başvuru bağımsız değişkenlerinden birine başvurur. Dışarıdan görünen metotlara geçirilen tüm başvuru bağımsız değişkenlerinin null olup olmadığı denetlenmelidir. Uygunsa, bağımsız değişken null olduğunda bir ArgumentNullException oluşturun veya null olmayan bağımsız değişkenleri onaylayan bir Kod Sözleşmesi önkoşulu ekleyin. Metot yalnızca bilinen derlemeler tarafından çağrılacak şekilde tasarlanmışsa metodu içeriden görünen hale getirmeniz gerekir.
zh_hans: 外部可见方法在不验证该参数是否为 null (Visual Basic 中为 Nothing)的情况下取消引用其某个引用参数。应检查传递给外部可见方法的所有引用参数中是否有参数为 null。如果适用，在参数为 null 时引发 ArgumentNullException，或添加断言非 null 参数的代码协定前提条件。如果该方法应仅由已知程序集调用，则应将该方法设置为在内部。
zh_hant: 外部可見的方法，會解除參照其中一個它的參考引數，而會不確認該引數是否為 null (在 Visual Basic 中無)。但所有傳遞到外部可見方法的參考引數，都應檢查是否為 null。若可行的話，當引數為 null 時請擲回 ArgumentNullException，或是新增程式碼合約先決條件判斷提示非 null 引數。若該方法設計為只可由已知組件呼叫，則應將該方法設為內部方法。

# ValidateArgumentsOfPublicMethodsMessage
source: In externally visible method '{0}', validate parameter '{1}' is non-null before using it. If appropriate, throw an ArgumentNullException when the argument is null or add a Code Contract precondition asserting non-null argument.
cs: Dříve, než v externě viditelné metodě {0} použijete parametr {1}, ověřte, že tento parametr není null. V případě potřeby vyvolejte ArgumentNullException, když je argument null, nebo přidejte předběžnou podmínku Code Contract, která vyhodnocuje argument, který není null.
de: Überprüfen Sie in der extern sichtbaren Methode "{0}", dass der Parameter "{1}" ungleich NULL ist, bevor Sie ihn verwenden. Lösen Sie gegebenenfalls eine ArgumentNullException aus, wenn das Argument NULL ist, oder fügen Sie eine Codevertragsvorbedingung hinzu, die ein Nicht-NULL-Argument durchsetzt.
es: En el método "{0}" visible externamente, valide que el parámetro "{1}" no es NULL antes de usarlo. Si procede, inicie una excepción ArgumentNullException cuando el argumento es NULL o agregue una condición previa de contrato de código con aserción de un argumento no nulo.
fr: Dans la méthode '{0}' visible de manière externe, vérifiez que le paramètre '{1}' a une valeur non null avant de l'utiliser. Le cas échéant, ArgumentNullException doit être levé quand l'argument a une valeur null, ou vous devez ajouter une condition préalable au contrat de code pour garantir que l'argument a une valeur non null.
it: Nel metodo visibile esternamente '{0}' convalidare il parametro '{1}' in modo che non sia Null prima di usarlo. Se appropriato, generare un'eccezione ArgumentNullException quando l'argomento è Null o aggiungere una precondizione del contratto di codice con asserzione dell'argomento non Null.
ko: 외부에 표시되는 메서드 '{0}'에서 사용하기 전에 '{1}' 매개 변수가 null이 아닌지 유효성을 검사합니다. 필요한 경우 인수가 null이면 ArgumentNullException을 throw하고, 그렇지 않으면 null이 아닌 인수를 어설션하는 코드 계약 사전 조건을 추가합니다.
pl: W zewnętrznie widocznej metodzie „{0}” należy zweryfikować, czy parametr „{1}” ma wartość inną niż null przed jego użyciem. Jeśli ma to uzasadnienie, należy zgłosić wyjątek ArgumentNullException, gdy argument ma wartość null, lub dodać warunek wstępny kontraktu kodu potwierdzający argument o wartości innej niż null.
pt_br: No método visível externamente '{0}', valide se o parâmetro '{1}' não é nulo antes de usá-lo. Se necessário, gere uma exceção ArgumentNullException quando o argumento for nulo ou adicione uma pré-condição de Contrato de Código declarando o argumento como não nulo.
tr: Dışarıdan görünen '{0}' metodunda '{1}' parametresini kullanmadan önce parametrenin null olmadığını doğrulayın. Uygunsa, bağımsız değişken null olduğunda bir ArgumentNullException oluşturun veya null olmayan bağımsız değişkenleri onaylayan bir Kod Sözleşmesi önkoşulu ekleyin.
zh_hans: 在外部可见方法“{0}”中，先验证参数“{1}”为非 null，然后再使用。如果适用，在参数为 null 时引发 ArgumentNullException，或添加断言非 null 参数的代码协定前提条件。
zh_hant: 在外部可見方法 '{0}' 中，驗證參數 '{1}' 在使用前會是非 null。若可行的話，當引數為 null 時請擲回 ArgumentNullException，或是新增程式碼合約先決條件判斷提示非 null 引數。

# ValidateArgumentsOfPublicMethodsTitle
source: Validate arguments of public methods
cs: Ověřte argumenty veřejných metod
de: Argumente von öffentlichen Methoden validieren
es: Validar argumentos de métodos públicos
fr: Valider les arguments de méthodes publiques
it: Convalidare gli argomenti di metodi pubblici
ko: public 메서드의 인수에 대한 유효성을 검사하세요.
pl: Waliduj argumenty metod publicznych
pt_br: Validar argumentos de métodos públicos
tr: Genel yöntemlerin bağımsız değişkenlerini doğrulayın
zh_hans: 验证公共方法的参数
zh_hant: 必須驗證公用方法的引數
