Repository: dotnet/roslyn-analyzers
Catalog: src/Roslyn.Diagnostics.Analyzers/Core/xlf/RoslynDiagnosticsAnalyzersResources.*.xlf
Languages: de, ko

# DuplicateBannedSymbolDescription
source: The list of banned symbols contains a duplicate.
de: Die Liste der gesperrten Symbole enthält ein Duplikat.

# DuplicateBannedSymbolMessage
source: The symbol '{0}' is listed multiple times in the list of banned APIs
de: Das Symbol "{0}" wird mehrmals in der Liste mit den gesperrten APIs aufgeführt.

# DuplicateBannedSymbolTitle
source: The list of banned symbols contains a duplicate
de: Die Liste der gesperrten Symbole enthält ein Duplikat.

# SymbolIsBannedDescription
source: The symbol has been marked as banned in this project, and an alternate should be used instead.
de: Das Symbol wurde für dieses Projekt als "Gesperrt" gekennzeichnet. Verwenden Sie stattdessen ein anderes Symbol.

# SymbolIsBannedMessage
source: The symbol '{0}' is banned in this project{1}
de: Das Symbol "{0}" ist für dieses Projekt {1} gesperrt.

# SymbolIsBannedTitle
source: Do not used banned APIs
de: Verwenden Sie keine gesperrten APIs.

# UseSpecializedCollectionsEmptyEnumerableTitle
source: Use SpecializedCollections.EmptyEnumerable()
de: SpecializedCollections.EmptyEnumerable() verwenden
ko: SpecializedCollections.EmptyEnumerable()을 사용하세요.

# UseSpecializedCollectionsEmptyEnumerableDescription
source: #N/A
de: #Nicht zutreffend

# UseSpecializedCollectionsEmptyEnumerableMessage
source: Use SpecializedCollections.EmptyEnumerable()
de: SpecializedCollections.EmptyEnumerable() verwenden
ko: SpecializedCollections.EmptyEnumerable()을 사용하세요.

# UseSpecializedCollectionsSingletonEnumerableTitle
source: Use SpecializedCollections.SingletonEnumerable()
de: SpecializedCollections.SingletonEnumerable() verwenden
ko: SpecializedCollections.SingletonEnumerable()을 사용하세요.

# UseSpecializedCollectionsSingletonEnumerableDescription
source: #N/A
de: #Nicht zutreffend

# UseSpecializedCollectionsSingletonEnumerableMessage
source: Use SpecializedCollections.SingletonEnumerable()
de: SpecializedCollections.SingletonEnumerable() verwenden
ko: SpecializedCollections.SingletonEnumerable()을 사용하세요.

# InvokeTheCorrectPropertyToEnsureCorrectUseSiteDiagnosticsTitle
source: Invoke the correct property to ensure correct use site diagnostics.
de: Rufen Sie die richtige Eigenschaft auf, um eine korrekte Nutzung der Sitediagnose sicherzustellen.
ko: 올바른 속성을 호출하여 사이트 진단을 올바르게 사용하는지 확인하세요.

# InvokeTheCorrectPropertyToEnsureCorrectUseSiteDiagnosticsDescription
source: #N/A
de: #Nicht zutreffend

# InvokeTheCorrectPropertyToEnsureCorrectUseSiteDiagnosticsMessage
source: Invoke the correct property to ensure correct use site diagnostics.
de: Rufen Sie die richtige Eigenschaft auf, um eine korrekte Nutzung der Sitediagnose sicherzustellen.
ko: 올바른 속성을 호출하여 사이트 진단을 올바르게 사용하는지 확인하세요.

# DoNotUseGenericCodeActionCreateToCreateCodeActionTitle
source: Do not use generic CodeAction.Create to create CodeAction
de: Generisches CodeAction.Create nicht zum Erstellen von CodeAction verwenden
ko: 제네릭 CodeAction.Create를 사용하여 CodeAction을 만들지 마세요.

# DoNotUseGenericCodeActionCreateToCreateCodeActionDescription
source: #N/A
de: #Nicht zutreffend

# DoNotUseGenericCodeActionCreateToCreateCodeActionMessage
source: Do not use generic CodeAction.Create to create CodeAction
de: Generisches CodeAction.Create nicht zum Erstellen von CodeAction verwenden
ko: 제네릭 CodeAction.Create를 사용하여 CodeAction을 만들지 마세요.

# OverrideObjectEqualsObjectWhenImplementingIequatableTitle
source: Override Object.Equals(object) when implementing Iequatable
de: "Object.Equals(object)" bei Implementierung von "IEquatable" außer Kraft setzen
ko: IEquatable을 구현할 때 Object.Equals(개체)를 재정의하세요.

# OverrideObjectEqualsObjectWhenImplementingIequatableDescription
source: #N/A
de: #Nicht zutreffend

# OverrideObjectEqualsObjectWhenImplementingIequatableMessage
source: Override Object.Equals(object) when implementing Iequatable
de: "Object.Equals(object)" bei Implementierung von "IEquatable" außer Kraft setzen
ko: IEquatable을 구현할 때 Object.Equals(개체)를 재정의하세요.

# DoNotInvokeDiagnosticDescriptorTitle
source: Do not invoke Diagnostic.Descriptor
de: Diagnostic.Descriptor nicht aufrufen
ko: Diagnostic.Descriptor를 호출하지 마세요.

# DoNotInvokeDiagnosticDescriptorDescription
source: Accessing the Descriptor property of Diagnostic in compiler layer leads to unnecessary string allocations for fields of the descriptor that are not utilized in command line compilation. Hence, you should avoid accessing the Descriptor of the compiler diagnostics here. Instead you should directly access these properties off the Diagnostic type.
de: Der Zugriff auf die Descriptor-Eigenschaft der Diagnose auf Compilerebene führt zu unnötigen Zeichenfolgenzuweisungen für Felder des Deskriptors, die bei der Befehlszeilenkompilierung nicht verwendet werden. Vermeiden Sie daher an dieser Stelle den Zugriff auf den Deskriptor der Compilerdiagnose. Greifen Sie stattdessen direkt vom Diagnosetyp aus auf diese Eigenschaften zu.
ko: 컴파일러 레이어에서 진단의 설명자 속성에 액세스하면 명령줄 컴파일에서 사용되지 않는 설명자의 필드에 대해 불필요한 문자열 할당이 발생합니다. 따라서 여기에서 컴파일러 진단의 설명자에 액세스하지 않아야 합니다. 대신 이 진단 형식의 속성에 직접 액세스해야 합니다.

# DoNotInvokeDiagnosticDescriptorMessage
source: Do not invoke property '{0}' on type '{1}', instead directly access the required member{2} on '{1}'
de: Rufen Sie nicht die Eigenschaft "{0}" für den Typ "{1}" auf. Greifen Sie stattdessen direkt auf den erforderlichen Member "{2}" in "{1}" zu.
ko: '{1}' 형식에서 '{0}' 속성을 호출하지 마세요. 대신 '{1}'에서 필수 멤버 {2}에 직접 액세스하세요.

# SymbolDeclaredEventMustBeGeneratedForSourceSymbolsTitle
source: SymbolDeclaredEvent must be generated for source symbols
de: SymbolDeclaredEvent muss für Quellsymbole generiert werden
ko: SymbolDeclaredEvent는 소스 기호에 대해 생성되어야 합니다.

# SymbolDeclaredEventMustBeGeneratedForSourceSymbolsDescription
source: Compilation event queue is required to generate symbol declared events for all declared source symbols. Hence, every source symbol type or one of its base types must generate a symbol declared event.
de: Die Warteschlange für das Kompilierungsereignis ist erforderlich, um für alle deklarierten Quellsymbole Symboldeklarationsereignisse zu generieren. Daher muss jeder Quellsymboltyp oder einer der zugehörigen Basistypen ein Symboldeklarationsereignis generieren.
ko: 선언된 모든 소스 기호에 대해 기호가 선언된 이벤트를 생성하는 데 컴파일 이벤트 대기열이 필요합니다. 그러므로 모든 소스 기호 형식 또는 소스 기호의 기본 형식 중 하나는 기호가 선언된 이벤트를 생성해야 합니다.

# SymbolDeclaredEventMustBeGeneratedForSourceSymbolsMessage
source: SymbolDeclaredEvent must be generated for source symbols
de: SymbolDeclaredEvent muss für Quellsymbole generiert werden
ko: SymbolDeclaredEvent는 소스 기호에 대해 생성되어야 합니다.

# DeclarePublicApiTitle
source: Add public types and members to the declared API
de: Der deklarierten API öffentliche Typen und Member hinzufügen
ko: public 형식과 멤버를 선언된 API에 추가하세요.

# DeclarePublicApiMessage
source: Symbol '{0}' is not part of the declared API.
de: Das Symbol "{0}" gehört nicht zur deklarierten API.
ko: '{0}' 기호는 선언된 API에 속하지 않습니다.

# DeclarePublicApiDescription
source: All public types and members should be declared in PublicAPI.txt. This draws attention to API changes in the code reviews and source control history, and helps prevent breaking changes.
de: Alle öffentlichen Typen und Member müssen in "PublicAPI.txt" deklariert werden. In Code Reviews und im Verlauf der Quellcodeverwaltung wird so die Aufmerksamkeit auf API-Änderungen gelenkt, und fehlerhafte Änderungen werden verhindert.
ko: public 형식과 멤버는 모두 PublicAPI.txt로 선언되어야 합니다. 이로 인해 코드 검토와 소스 제어 기록의 API 변경 내용을 쉽게 확인할 수 있으므로 변경 내용이 발생하는 것을 방지할 수 있습니다.

# RemoveDeletedApiTitle
source: Remove deleted types and members from the declared API
de: Gelöschte Typen und Member aus der deklarierten API entfernen
ko: 선언된 API에서 삭제된 형식과 멤버를 제거하세요.

# RemoveDeletedApiMessage
source: Symbol '{0}' is part of the declared API, but is either not public or could not be found
de: Das Symbol "{0}" gehört zur deklarierten API, ist jedoch entweder nicht öffentlich oder wurde nicht gefunden.
ko: '{0}' 기호는 선언된 API에 속하지만 public 형식이 아니거나 찾을 수 없습니다.

# RemoveDeletedApiDescription
source: When removing a public type or member the corresponding entry in PublicAPI.txt should also be removed. This draws attention to API changes in the code reviews and source control history, and helps prevent breaking changes.
de: Beim Entfernen eines öffentlichen Typs oder Members muss der entsprechende Eintrag in "PublicAPI.txt" ebenfalls entfernt werden. In Code Reviews und im Verlauf der Quellcodeverwaltung wird so die Aufmerksamkeit auf API-Änderungen gelenkt, und fehlerhafte Änderungen werden verhindert.
ko: public 형식 또는 멤버를 제거할 때 PublicAPI.txt의 해당 항목도 제거해야 합니다. 이로 인해 코드 검토와 소스 제어 기록의 API 변경 내용을 쉽게 확인할 수 있으므로 변경 내용이 발생하는 것을 방지할 수 있습니다.

# ExposedNoninstantiableTypeMessage
source: Constructor makes its noninheritable base class inheritable, thereby exposing its protected members.
de: Der Konstruktor legt die zugehörige nicht vererbbare Basisklasse als vererbbar fest und macht damit die zugehörigen geschützten Member verfügbar.
ko: 생성자가 상속할 수 없는 기본 클래스를 상속할 수 있도록 만들어 보호된 멤버가 공개됩니다.

# ExposedNoninstantiableTypeTitle
source: Constructor make noninheritable base class inheritable
de: Konstruktor macht nicht vererbbare Basisklasse vererbbar
ko: 생성자가 상속할 수 없는 기본 클래스를 상속할 수 있도록 만듭니다.

# PublicApiFilesInvalidTitle
source: The contents of the public API files are invalid
de: Der Inhalt der öffentlichen API-Dateien ist ungültig
ko: 공용 API 파일의 콘텐츠가 잘못되었습니다.

# PublicApiFilesInvalidMessage
source: The contents of the public API files are invalid: {0}
de: Der Inhalt der öffentlichen API-Dateien ist ungültig: {0}
ko: 공용 API 파일의 콘텐츠가 잘못되었습니다. {0}

# DuplicateSymbolsInPublicApiFilesTitle
source: Do not duplicate symbols in public API files
de: Keine Symbole in öffentlichen API-Dateien duplizieren
ko: 공용 API 파일에서 기호가 중복되지 않아야 합니다.

# DuplicateSymbolsInPublicApiFilesMessage
source: The symbol '{0}' appears more than once in the public API files.
de: Das Symbol "{0}" ist in den öffentlichen API-Dateien mehrmals enthalten.
ko: 공용 API 파일에서 '{0}' 기호가 2번 이상 표시됩니다.

# PublicImplicitConstructorErrorMessageName
source: implicit constructor for {0}
de: Impliziter Konstruktor für "{0}"
ko: {0}의 암시적 생성자

# AvoidMultipleOverloadsWithOptionalParametersTitle
source: Do not add multiple public overloads with optional parameters
de: Nicht mehrere öffentliche Überladungen mit optionalen Parametern hinzufügen
ko: 선택적 매개 변수가 있는 여러 공용 오버로드를 추가하지 마세요.

# AvoidMultipleOverloadsWithOptionalParametersMessage
source: Symbol '{0}' violates the backcompat requirement: 'Do not add multiple overloads with optional parameters'. See '{1}' for details.
de: Das Symbol "{0}" verstößt gegen die Anforderung der Abwärtskompatibilität: Nicht mehrere öffentliche Überladungen mit optionalen Parametern hinzufügen. Informationen hierzu finden Sie unter "{1}".
ko: '{0}' 기호가 backcompat 요구 사항을 위반합니다. '선택적 매개 변수가 있는 여러 공용 오버로드를 추가하지 마세요'. 자세한 내용은 '{1}'을(를) 확인하세요.

# OverloadWithOptionalParametersShouldHaveMostParametersTitle
source: Public API with optional parameter(s) should have the most parameters amongst its public overloads.
de: Die öffentliche API mit optionalen Parametern muss die meisten Parameter bei den öffentlichen Überladungen aufweisen
ko: 선택적 매개 변수가 있는 공용 API에는 공용 오버로드 중 가장 많은 매개 변수를 보유해야 합니다.

# OverloadWithOptionalParametersShouldHaveMostParametersMessage
source: Symbol '{0}' violates the backcompat requirement: 'Public API with optional parameter(s) should have the most parameters amongst its public overloads'. See '{1}' for details.
de: Das Symbol "{0}" verstößt gegen die Anforderung der Abwärtskompatibilität: Die öffentliche API mit optionalen Parametern muss die meisten Parameter bei den öffentlichen Überladungen aufweisen. Informationen hierzu finden Sie unter "{1}".
ko: '{0}' 기호가 backcompat 요구 사항을 위반합니다. '선택적 매개 변수가 있는 공용 API에는 공용 오버로드 중 가장 많은 매개 변수를 보유해야 합니다.' 자세한 내용은 '{1}'을(를) 확인하세요.

# DoNotMixAttributesFromDifferentVersionsOfMEFTitle
source: Do not mix attributes from different versions of MEF
de: Keine Attribute aus verschiedenen Versionen des MEF kombinieren
ko: 다른 버전의 MEF 특성을 조합하지 마세요.

# DoNotMixAttributesFromDifferentVersionsOfMEFDescription
source: Do not mix attributes from different versions of MEF
de: Keine Attribute aus verschiedenen Versionen des MEF kombinieren
ko: 다른 버전의 MEF 특성을 조합하지 마세요.

# DoNotMixAttributesFromDifferentVersionsOfMEFMessage
source: Attribute '{0}' comes from a different version of MEF than the export attribute on '{1}'
de: Das Attribut "{0}" stammt aus einer anderen Version des MEF als das Exportattribut für "{1}".
ko: '{0}' 특성은 '{1}'의 export 특성이 아닌 다른 버전의 MEF에서 가져온 것입니다.

# PartsExportedWithMEFv2MustBeMarkedAsSharedTitle
source: Parts exported with MEFv2 must be marked as Shared
de: Mit MEFv2 exportierte Teile müssen als "Shared" markiert werden
ko: MEFv2를 통해 내보낸 파트는 Shared로 표시되어야 합니다.

# PartsExportedWithMEFv2MustBeMarkedAsSharedDescription
source: Part exported with MEFv2 must be marked with the Shared attribute.
de: Ein mit MEFv2 exportiertes Teil muss mit dem Shared-Attribut markiert werden.
ko: MEFv2를 통해 내보낸 파트는 Shared 특성으로 표시되어야 합니다.

# PartsExportedWithMEFv2MustBeMarkedAsSharedMessage
source: '{0}' is exported with MEFv2 and hence must be marked as Shared
de: "{0}" wurde mit MEFv2 exportiert und muss daher als "Shared" markiert werden.
ko: '{0}'을(를) MEFv2를 통해 내보냈으므로 Shared로 표시해야 합니다.
